{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week3_fd.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Sep 2023, 16:40:31
{txt}
{com}. //_1
. clear
{txt}
{com}. set more off
{txt}
{com}. //_2
. cd "/Users/Sam/Desktop/Econ 645/Data/Wooldridge"
{res}/Users/Sam/Desktop/Econ 645/Data/Wooldridge
{txt}
{com}. //_3
. use "fertil1.dta", clear
{txt}
{com}. //_4
. est clear
{txt}
{com}. eststo OLS: reg kids educ c.age##c.age i.black i.east i.northcen i.west i.farm i.othrural i.town i.smcity 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,129
{txt}{hline 13}{c +}{hline 34}   F(11, 1117)     = {res}    11.52
{txt}       Model {c |} {res} 314.471892        11  28.5883539   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2771.03741     1,117   2.4807855   {txt}R-squared       ={res}    0.1019
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0931
{txt}       Total {c |} {res}  3085.5093     1,128  2.73538059   {txt}Root MSE        =   {res} 1.5751

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        kids{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}-.1428788{col 26}{space 2}  .018351{col 37}{space 1}   -7.79{col 46}{space 3}0.000{col 54}{space 4}-.1788851{col 67}{space 3}-.1068725
{txt}{space 9}age {c |}{col 14}{res}{space 2} .5624223{col 26}{space 2} .1396257{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} .2884641{col 67}{space 3} .8363804
{txt}{space 12} {c |}
{space 1}c.age#c.age {c |}{col 14}{res}{space 2}-.0060917{col 26}{space 2} .0015793{col 37}{space 1}   -3.86{col 46}{space 3}0.000{col 54}{space 4}-.0091903{col 67}{space 3} -.002993
{txt}{space 12} {c |}
{space 5}1.black {c |}{col 14}{res}{space 2}  .977559{col 26}{space 2}  .173188{col 37}{space 1}    5.64{col 46}{space 3}0.000{col 54}{space 4} .6377485{col 67}{space 3}  1.31737
{txt}{space 6}1.east {c |}{col 14}{res}{space 2} .2362931{col 26}{space 2} .1340365{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0266987{col 67}{space 3} .4992849
{txt}{space 2}1.northcen {c |}{col 14}{res}{space 2} .3847487{col 26}{space 2} .1222117{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .1449583{col 67}{space 3} .6245391
{txt}{space 6}1.west {c |}{col 14}{res}{space 2} .2447027{col 26}{space 2} .1686052{col 37}{space 1}    1.45{col 46}{space 3}0.147{col 54}{space 4}-.0861158{col 67}{space 3} .5755212
{txt}{space 6}1.farm {c |}{col 14}{res}{space 2} -.054186{col 26}{space 2} .1486156{col 37}{space 1}   -0.36{col 46}{space 3}0.715{col 54}{space 4}-.3457832{col 67}{space 3} .2374112
{txt}{space 2}1.othrural {c |}{col 14}{res}{space 2}-.1670751{col 26}{space 2} .1773583{col 37}{space 1}   -0.94{col 46}{space 3}0.346{col 54}{space 4}-.5150681{col 67}{space 3} .1809178
{txt}{space 6}1.town {c |}{col 14}{res}{space 2} .0842369{col 26}{space 2} .1257038{col 37}{space 1}    0.67{col 46}{space 3}0.503{col 54}{space 4}-.1624053{col 67}{space 3} .3308792
{txt}{space 4}1.smcity {c |}{col 14}{res}{space 2} .1830768{col 26}{space 2} .1620166{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.1348143{col 67}{space 3}  .500968
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-8.487543{col 26}{space 2} 3.068381{col 37}{space 1}   -2.77{col 46}{space 3}0.006{col 54}{space 4}-14.50798{col 67}{space 3}-2.467104
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_5
. eststo Pooled_OLS: reg kids educ c.age##c.age i.black i.east i.northcen i.west i.farm i.othrural ///
>          i.town i.smcity i.y74 i.y76 i.y78 i.y80 i.y82 i.y84

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,129
{txt}{hline 13}{c +}{hline 34}   F(17, 1111)     = {res}     9.72
{txt}       Model {c |} {res} 399.610888        17  23.5065228   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2685.89841     1,111  2.41755033   {txt}R-squared       ={res}    0.1295
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1162
{txt}       Total {c |} {res}  3085.5093     1,128  2.73538059   {txt}Root MSE        =   {res} 1.5548

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        kids{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}-.1284268{col 26}{space 2} .0183486{col 37}{space 1}   -7.00{col 46}{space 3}0.000{col 54}{space 4}-.1644286{col 67}{space 3} -.092425
{txt}{space 9}age {c |}{col 14}{res}{space 2} .5321346{col 26}{space 2} .1383863{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .2606065{col 67}{space 3} .8036626
{txt}{space 12} {c |}
{space 1}c.age#c.age {c |}{col 14}{res}{space 2} -.005804{col 26}{space 2} .0015643{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-.0088733{col 67}{space 3}-.0027347
{txt}{space 12} {c |}
{space 5}1.black {c |}{col 14}{res}{space 2} 1.075658{col 26}{space 2} .1735356{col 37}{space 1}    6.20{col 46}{space 3}0.000{col 54}{space 4} .7351631{col 67}{space 3} 1.416152
{txt}{space 6}1.east {c |}{col 14}{res}{space 2}  .217324{col 26}{space 2} .1327878{col 37}{space 1}    1.64{col 46}{space 3}0.102{col 54}{space 4}-.0432192{col 67}{space 3} .4778672
{txt}{space 2}1.northcen {c |}{col 14}{res}{space 2}  .363114{col 26}{space 2} .1208969{col 37}{space 1}    3.00{col 46}{space 3}0.003{col 54}{space 4}  .125902{col 67}{space 3} .6003261
{txt}{space 6}1.west {c |}{col 14}{res}{space 2} .1976032{col 26}{space 2} .1669134{col 37}{space 1}    1.18{col 46}{space 3}0.237{col 54}{space 4}-.1298978{col 67}{space 3} .5251041
{txt}{space 6}1.farm {c |}{col 14}{res}{space 2}-.0525575{col 26}{space 2}   .14719{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-.3413592{col 67}{space 3} .2362443
{txt}{space 2}1.othrural {c |}{col 14}{res}{space 2}-.1628537{col 26}{space 2}  .175442{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4}-.5070887{col 67}{space 3} .1813814
{txt}{space 6}1.town {c |}{col 14}{res}{space 2} .0843532{col 26}{space 2}  .124531{col 37}{space 1}    0.68{col 46}{space 3}0.498{col 54}{space 4}-.1599893{col 67}{space 3} .3286957
{txt}{space 4}1.smcity {c |}{col 14}{res}{space 2} .2118791{col 26}{space 2}  .160296{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.1026379{col 67}{space 3} .5263961
{txt}{space 7}1.y74 {c |}{col 14}{res}{space 2} .2681825{col 26}{space 2}  .172716{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0707039{col 67}{space 3} .6070689
{txt}{space 7}1.y76 {c |}{col 14}{res}{space 2}-.0973795{col 26}{space 2} .1790456{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4} -.448685{col 67}{space 3} .2539261
{txt}{space 7}1.y78 {c |}{col 14}{res}{space 2}-.0686665{col 26}{space 2} .1816837{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-.4251483{col 67}{space 3} .2878154
{txt}{space 7}1.y80 {c |}{col 14}{res}{space 2}-.0713053{col 26}{space 2} .1827707{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}  -.42992{col 67}{space 3} .2873093
{txt}{space 7}1.y82 {c |}{col 14}{res}{space 2}-.5224842{col 26}{space 2} .1724361{col 37}{space 1}   -3.03{col 46}{space 3}0.003{col 54}{space 4}-.8608214{col 67}{space 3} -.184147
{txt}{space 7}1.y84 {c |}{col 14}{res}{space 2}-.5451661{col 26}{space 2} .1745162{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-.8875846{col 67}{space 3}-.2027477
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.742457{col 26}{space 2} 3.051767{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-13.73033{col 67}{space 3}-1.754579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_6
. test 1.y74 1.y76 1.y78 1.y80 1.y82 1.y84

{p 0 7}{space 1}{text:( 1)}{space 1} {res}1.y74 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} 1.y76 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} 1.y78 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} 1.y80 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} 1.y82 = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} 1.y84 = 0{p_end}

{txt}       F(  6,  1111) ={res}    5.87
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. //_7
. esttab OLS Pooled_OLS, mtitles se scalars(F r2) drop(0.black 0.east 0.northcen 0.west 0.farm ///
>                                     0.othrural 0.town 0.smcity 0.y74 0.y76 0.y78 0.y80 0.y82 0.y84) 
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS      Pooled_OLS   
{txt}{hline 44}
{txt}educ        {res}       -0.143***       -0.128***{txt}
            {res} {ralign 12:{txt:(}0.0184{txt:)}}    {ralign 12:{txt:(}0.0183{txt:)}}   {txt}

{txt}age         {res}        0.562***        0.532***{txt}
            {res} {ralign 12:{txt:(}0.140{txt:)}}    {ralign 12:{txt:(}0.138{txt:)}}   {txt}

{txt}c.age#c.age {res}     -0.00609***     -0.00580***{txt}
            {res} {ralign 12:{txt:(}0.00158{txt:)}}    {ralign 12:{txt:(}0.00156{txt:)}}   {txt}

{txt}1.black     {res}        0.978***        1.076***{txt}
            {res} {ralign 12:{txt:(}0.173{txt:)}}    {ralign 12:{txt:(}0.174{txt:)}}   {txt}

{txt}1.east      {res}        0.236           0.217   {txt}
            {res} {ralign 12:{txt:(}0.134{txt:)}}    {ralign 12:{txt:(}0.133{txt:)}}   {txt}

{txt}1.northcen  {res}        0.385**         0.363** {txt}
            {res} {ralign 12:{txt:(}0.122{txt:)}}    {ralign 12:{txt:(}0.121{txt:)}}   {txt}

{txt}1.west      {res}        0.245           0.198   {txt}
            {res} {ralign 12:{txt:(}0.169{txt:)}}    {ralign 12:{txt:(}0.167{txt:)}}   {txt}

{txt}1.farm      {res}      -0.0542         -0.0526   {txt}
            {res} {ralign 12:{txt:(}0.149{txt:)}}    {ralign 12:{txt:(}0.147{txt:)}}   {txt}

{txt}1.othrural  {res}       -0.167          -0.163   {txt}
            {res} {ralign 12:{txt:(}0.177{txt:)}}    {ralign 12:{txt:(}0.175{txt:)}}   {txt}

{txt}1.town      {res}       0.0842          0.0844   {txt}
            {res} {ralign 12:{txt:(}0.126{txt:)}}    {ralign 12:{txt:(}0.125{txt:)}}   {txt}

{txt}1.smcity    {res}        0.183           0.212   {txt}
            {res} {ralign 12:{txt:(}0.162{txt:)}}    {ralign 12:{txt:(}0.160{txt:)}}   {txt}

{txt}1.y74       {res}                        0.268   {txt}
            {res}                 {ralign 12:{txt:(}0.173{txt:)}}   {txt}

{txt}1.y76       {res}                      -0.0974   {txt}
            {res}                 {ralign 12:{txt:(}0.179{txt:)}}   {txt}

{txt}1.y78       {res}                      -0.0687   {txt}
            {res}                 {ralign 12:{txt:(}0.182{txt:)}}   {txt}

{txt}1.y80       {res}                      -0.0713   {txt}
            {res}                 {ralign 12:{txt:(}0.183{txt:)}}   {txt}

{txt}1.y82       {res}                       -0.522** {txt}
            {res}                 {ralign 12:{txt:(}0.172{txt:)}}   {txt}

{txt}1.y84       {res}                       -0.545** {txt}
            {res}                 {ralign 12:{txt:(}0.175{txt:)}}   {txt}

{txt}_cons       {res}       -8.488**        -7.742*  {txt}
            {res} {ralign 12:{txt:(}3.068{txt:)}}    {ralign 12:{txt:(}3.052{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}         1129            1129   {txt}
{txt}F           {res}        11.52           9.723   {txt}
{txt}r2          {res}        0.102           0.130   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_8
. estat hettest

{txt}Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
{p 9 20}Variables: fitted values of kids

{col 10}chi2({res}1{txt}){col 23}={res}    26.28
{txt}{col 10}Prob > chi2{col 23}={res}   0.0000
{txt}
{com}. //_9
. est clear
{txt}
{com}. eststo Without_Robust: reg kids educ c.age##c.age i.black i.east i.northcen i.west i.farm i.othrural ///
>          i.town i.smcity i.y74 i.y76 i.y78 i.y80 i.y82 i.y84

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,129
{txt}{hline 13}{c +}{hline 34}   F(17, 1111)     = {res}     9.72
{txt}       Model {c |} {res} 399.610888        17  23.5065228   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2685.89841     1,111  2.41755033   {txt}R-squared       ={res}    0.1295
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1162
{txt}       Total {c |} {res}  3085.5093     1,128  2.73538059   {txt}Root MSE        =   {res} 1.5548

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        kids{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}-.1284268{col 26}{space 2} .0183486{col 37}{space 1}   -7.00{col 46}{space 3}0.000{col 54}{space 4}-.1644286{col 67}{space 3} -.092425
{txt}{space 9}age {c |}{col 14}{res}{space 2} .5321346{col 26}{space 2} .1383863{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} .2606065{col 67}{space 3} .8036626
{txt}{space 12} {c |}
{space 1}c.age#c.age {c |}{col 14}{res}{space 2} -.005804{col 26}{space 2} .0015643{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-.0088733{col 67}{space 3}-.0027347
{txt}{space 12} {c |}
{space 5}1.black {c |}{col 14}{res}{space 2} 1.075658{col 26}{space 2} .1735356{col 37}{space 1}    6.20{col 46}{space 3}0.000{col 54}{space 4} .7351631{col 67}{space 3} 1.416152
{txt}{space 6}1.east {c |}{col 14}{res}{space 2}  .217324{col 26}{space 2} .1327878{col 37}{space 1}    1.64{col 46}{space 3}0.102{col 54}{space 4}-.0432192{col 67}{space 3} .4778672
{txt}{space 2}1.northcen {c |}{col 14}{res}{space 2}  .363114{col 26}{space 2} .1208969{col 37}{space 1}    3.00{col 46}{space 3}0.003{col 54}{space 4}  .125902{col 67}{space 3} .6003261
{txt}{space 6}1.west {c |}{col 14}{res}{space 2} .1976032{col 26}{space 2} .1669134{col 37}{space 1}    1.18{col 46}{space 3}0.237{col 54}{space 4}-.1298978{col 67}{space 3} .5251041
{txt}{space 6}1.farm {c |}{col 14}{res}{space 2}-.0525575{col 26}{space 2}   .14719{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-.3413592{col 67}{space 3} .2362443
{txt}{space 2}1.othrural {c |}{col 14}{res}{space 2}-.1628537{col 26}{space 2}  .175442{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4}-.5070887{col 67}{space 3} .1813814
{txt}{space 6}1.town {c |}{col 14}{res}{space 2} .0843532{col 26}{space 2}  .124531{col 37}{space 1}    0.68{col 46}{space 3}0.498{col 54}{space 4}-.1599893{col 67}{space 3} .3286957
{txt}{space 4}1.smcity {c |}{col 14}{res}{space 2} .2118791{col 26}{space 2}  .160296{col 37}{space 1}    1.32{col 46}{space 3}0.187{col 54}{space 4}-.1026379{col 67}{space 3} .5263961
{txt}{space 7}1.y74 {c |}{col 14}{res}{space 2} .2681825{col 26}{space 2}  .172716{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0707039{col 67}{space 3} .6070689
{txt}{space 7}1.y76 {c |}{col 14}{res}{space 2}-.0973795{col 26}{space 2} .1790456{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4} -.448685{col 67}{space 3} .2539261
{txt}{space 7}1.y78 {c |}{col 14}{res}{space 2}-.0686665{col 26}{space 2} .1816837{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-.4251483{col 67}{space 3} .2878154
{txt}{space 7}1.y80 {c |}{col 14}{res}{space 2}-.0713053{col 26}{space 2} .1827707{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}  -.42992{col 67}{space 3} .2873093
{txt}{space 7}1.y82 {c |}{col 14}{res}{space 2}-.5224842{col 26}{space 2} .1724361{col 37}{space 1}   -3.03{col 46}{space 3}0.003{col 54}{space 4}-.8608214{col 67}{space 3} -.184147
{txt}{space 7}1.y84 {c |}{col 14}{res}{space 2}-.5451661{col 26}{space 2} .1745162{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-.8875846{col 67}{space 3}-.2027477
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.742457{col 26}{space 2} 3.051767{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-13.73033{col 67}{space 3}-1.754579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo With_Robust: reg kids educ c.age##c.age i.black i.east i.northcen i.west i.farm i.othrural ///
>          i.town i.smcity i.y74 i.y76 i.y78 i.y80 i.y82 i.y84, robust

{txt}Linear regression                               Number of obs     = {res}     1,129
                                                {txt}F(17, 1111)       =  {res}    10.19
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1295
                                                {txt}Root MSE          =    {res} 1.5548

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        kids{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}-.1284268{col 26}{space 2}  .021146{col 37}{space 1}   -6.07{col 46}{space 3}0.000{col 54}{space 4}-.1699175{col 67}{space 3}-.0869362
{txt}{space 9}age {c |}{col 14}{res}{space 2} .5321346{col 26}{space 2} .1389371{col 37}{space 1}    3.83{col 46}{space 3}0.000{col 54}{space 4} .2595258{col 67}{space 3} .8047433
{txt}{space 12} {c |}
{space 1}c.age#c.age {c |}{col 14}{res}{space 2} -.005804{col 26}{space 2} .0015791{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.0089024{col 67}{space 3}-.0027056
{txt}{space 12} {c |}
{space 5}1.black {c |}{col 14}{res}{space 2} 1.075658{col 26}{space 2} .2013188{col 37}{space 1}    5.34{col 46}{space 3}0.000{col 54}{space 4} .6806496{col 67}{space 3} 1.470666
{txt}{space 6}1.east {c |}{col 14}{res}{space 2}  .217324{col 26}{space 2}  .127466{col 37}{space 1}    1.70{col 46}{space 3}0.088{col 54}{space 4}-.0327773{col 67}{space 3} .4674252
{txt}{space 2}1.northcen {c |}{col 14}{res}{space 2}  .363114{col 26}{space 2} .1167013{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .1341342{col 67}{space 3} .5920939
{txt}{space 6}1.west {c |}{col 14}{res}{space 2} .1976032{col 26}{space 2} .1626813{col 37}{space 1}    1.21{col 46}{space 3}0.225{col 54}{space 4} -.121594{col 67}{space 3} .5168003
{txt}{space 6}1.farm {c |}{col 14}{res}{space 2}-.0525575{col 26}{space 2} .1460837{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.3391886{col 67}{space 3} .2340736
{txt}{space 2}1.othrural {c |}{col 14}{res}{space 2}-.1628537{col 26}{space 2} .1808546{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 54}{space 4}-.5177087{col 67}{space 3} .1920014
{txt}{space 6}1.town {c |}{col 14}{res}{space 2} .0843532{col 26}{space 2} .1284759{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-.1677295{col 67}{space 3} .3364359
{txt}{space 4}1.smcity {c |}{col 14}{res}{space 2} .2118791{col 26}{space 2} .1539645{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-.0902149{col 67}{space 3} .5139731
{txt}{space 7}1.y74 {c |}{col 14}{res}{space 2} .2681825{col 26}{space 2} .1875121{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.0997353{col 67}{space 3} .6361003
{txt}{space 7}1.y76 {c |}{col 14}{res}{space 2}-.0973795{col 26}{space 2} .1999339{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4}-.4896701{col 67}{space 3} .2949112
{txt}{space 7}1.y78 {c |}{col 14}{res}{space 2}-.0686665{col 26}{space 2} .1977154{col 37}{space 1}   -0.35{col 46}{space 3}0.728{col 54}{space 4}-.4566042{col 67}{space 3} .3192713
{txt}{space 7}1.y80 {c |}{col 14}{res}{space 2}-.0713053{col 26}{space 2} .1936553{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4}-.4512767{col 67}{space 3} .3086661
{txt}{space 7}1.y82 {c |}{col 14}{res}{space 2}-.5224842{col 26}{space 2} .1879305{col 37}{space 1}   -2.78{col 46}{space 3}0.006{col 54}{space 4}-.8912228{col 67}{space 3}-.1537456
{txt}{space 7}1.y84 {c |}{col 14}{res}{space 2}-.5451661{col 26}{space 2} .1859289{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4}-.9099776{col 67}{space 3}-.1803547
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.742457{col 26}{space 2} 3.070656{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4} -13.7674{col 67}{space 3}-1.717518
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_10
. esttab Without_Robust With_Robust, mtitles se scalars(F r2) drop(0.black 0.east 0.northcen 0.west 0.farm ///
>                                 0.othrural 0.town 0.smcity 0.y74 0.y76 0.y78 0.y80 0.y82 0.y84) 
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}             Without_Ro~t     With_Robust   
{txt}{hline 44}
{txt}educ        {res}       -0.128***       -0.128***{txt}
            {res} {ralign 12:{txt:(}0.0183{txt:)}}    {ralign 12:{txt:(}0.0211{txt:)}}   {txt}

{txt}age         {res}        0.532***        0.532***{txt}
            {res} {ralign 12:{txt:(}0.138{txt:)}}    {ralign 12:{txt:(}0.139{txt:)}}   {txt}

{txt}c.age#c.age {res}     -0.00580***     -0.00580***{txt}
            {res} {ralign 12:{txt:(}0.00156{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}   {txt}

{txt}1.black     {res}        1.076***        1.076***{txt}
            {res} {ralign 12:{txt:(}0.174{txt:)}}    {ralign 12:{txt:(}0.201{txt:)}}   {txt}

{txt}1.east      {res}        0.217           0.217   {txt}
            {res} {ralign 12:{txt:(}0.133{txt:)}}    {ralign 12:{txt:(}0.127{txt:)}}   {txt}

{txt}1.northcen  {res}        0.363**         0.363** {txt}
            {res} {ralign 12:{txt:(}0.121{txt:)}}    {ralign 12:{txt:(}0.117{txt:)}}   {txt}

{txt}1.west      {res}        0.198           0.198   {txt}
            {res} {ralign 12:{txt:(}0.167{txt:)}}    {ralign 12:{txt:(}0.163{txt:)}}   {txt}

{txt}1.farm      {res}      -0.0526         -0.0526   {txt}
            {res} {ralign 12:{txt:(}0.147{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.othrural  {res}       -0.163          -0.163   {txt}
            {res} {ralign 12:{txt:(}0.175{txt:)}}    {ralign 12:{txt:(}0.181{txt:)}}   {txt}

{txt}1.town      {res}       0.0844          0.0844   {txt}
            {res} {ralign 12:{txt:(}0.125{txt:)}}    {ralign 12:{txt:(}0.128{txt:)}}   {txt}

{txt}1.smcity    {res}        0.212           0.212   {txt}
            {res} {ralign 12:{txt:(}0.160{txt:)}}    {ralign 12:{txt:(}0.154{txt:)}}   {txt}

{txt}1.y74       {res}        0.268           0.268   {txt}
            {res} {ralign 12:{txt:(}0.173{txt:)}}    {ralign 12:{txt:(}0.188{txt:)}}   {txt}

{txt}1.y76       {res}      -0.0974         -0.0974   {txt}
            {res} {ralign 12:{txt:(}0.179{txt:)}}    {ralign 12:{txt:(}0.200{txt:)}}   {txt}

{txt}1.y78       {res}      -0.0687         -0.0687   {txt}
            {res} {ralign 12:{txt:(}0.182{txt:)}}    {ralign 12:{txt:(}0.198{txt:)}}   {txt}

{txt}1.y80       {res}      -0.0713         -0.0713   {txt}
            {res} {ralign 12:{txt:(}0.183{txt:)}}    {ralign 12:{txt:(}0.194{txt:)}}   {txt}

{txt}1.y82       {res}       -0.522**        -0.522** {txt}
            {res} {ralign 12:{txt:(}0.172{txt:)}}    {ralign 12:{txt:(}0.188{txt:)}}   {txt}

{txt}1.y84       {res}       -0.545**        -0.545** {txt}
            {res} {ralign 12:{txt:(}0.175{txt:)}}    {ralign 12:{txt:(}0.186{txt:)}}   {txt}

{txt}_cons       {res}       -7.742*         -7.742*  {txt}
            {res} {ralign 12:{txt:(}3.052{txt:)}}    {ralign 12:{txt:(}3.071{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}         1129            1129   {txt}
{txt}F           {res}        9.723           10.19   {txt}
{txt}r2          {res}        0.130           0.130   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_11
. use "cps78_85.dta", clear
{txt}
{com}. //_12
. reg lwage i.y85##c.edu c.exper##c.exper i.union i.female##i.y85

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,084
{txt}{hline 13}{c +}{hline 34}   F(8, 1075)      = {res}    99.80
{txt}       Model {c |} {res} 135.992074         8  16.9990092   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 183.099094     1,075  .170324738   {txt}R-squared       ={res}    0.4262
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4219
{txt}       Total {c |} {res} 319.091167     1,083   .29463635   {txt}Root MSE        =   {res}  .4127

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          lwage{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}1.y85 {c |}{col 17}{res}{space 2} .1178062{col 29}{space 2} .1237817{col 40}{space 1}    0.95{col 49}{space 3}0.341{col 57}{space 4} -.125075{col 70}{space 3} .3606874
{txt}{space 11}educ {c |}{col 17}{res}{space 2} .0747209{col 29}{space 2} .0066764{col 40}{space 1}   11.19{col 49}{space 3}0.000{col 57}{space 4} .0616206{col 70}{space 3} .0878212
{txt}{space 15} {c |}
{space 5}y85#c.educ {c |}
{space 13}1  {c |}{col 17}{res}{space 2} .0184605{col 29}{space 2} .0093542{col 40}{space 1}    1.97{col 49}{space 3}0.049{col 57}{space 4}  .000106{col 70}{space 3}  .036815
{txt}{space 15} {c |}
{space 10}exper {c |}{col 17}{res}{space 2} .0295843{col 29}{space 2} .0035673{col 40}{space 1}    8.29{col 49}{space 3}0.000{col 57}{space 4} .0225846{col 70}{space 3}  .036584
{txt}{space 15} {c |}
c.exper#c.exper {c |}{col 17}{res}{space 2}-.0003994{col 29}{space 2} .0000775{col 40}{space 1}   -5.15{col 49}{space 3}0.000{col 57}{space 4}-.0005516{col 70}{space 3}-.0002473
{txt}{space 15} {c |}
{space 8}1.union {c |}{col 17}{res}{space 2} .2021319{col 29}{space 2} .0302945{col 40}{space 1}    6.67{col 49}{space 3}0.000{col 57}{space 4} .1426888{col 70}{space 3} .2615749
{txt}{space 7}1.female {c |}{col 17}{res}{space 2}-.3167086{col 29}{space 2} .0366215{col 40}{space 1}   -8.65{col 49}{space 3}0.000{col 57}{space 4}-.3885663{col 70}{space 3} -.244851
{txt}{space 15} {c |}
{space 5}female#y85 {c |}
{space 11}1 1  {c |}{col 17}{res}{space 2}  .085052{col 29}{space 2}  .051309{col 40}{space 1}    1.66{col 49}{space 3}0.098{col 57}{space 4}-.0156251{col 70}{space 3}  .185729
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4589329{col 29}{space 2} .0934485{col 40}{space 1}    4.91{col 49}{space 3}0.000{col 57}{space 4} .2755707{col 70}{space 3}  .642295
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_13
. display (exp(-.317)-1)*100
{res}-27.166924
{txt}
{com}. display (exp(-.317+0.085)-1)*100
{res}-20.705388
{txt}
{com}. //_14
. display (exp(0.0747)-1)*100
{res}7.7560834
{txt}
{com}. display (exp(0.0747+0.0185)-1)*100
{res}9.768125
{txt}
{com}. //_15
. display (exp(0.085)-1)*100
{res}8.8717067
{txt}
{com}. //_16
. display (exp(0.0185)-1)*100
{res}1.8672185
{txt}
{com}. //_17
. test 1.y85 0.y85 1.y85#edu 1.y85#1.female

{p 0 7}{space 1}{text:( 1)}{space 1} {res}1.y85 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} 0b.y85 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} 1.y85#c.educ = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} 1.female#1.y85 = 0{p_end}
{txt}       Constraint 2 dropped

       F(  3,  1075) ={res}   80.26
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. //_18
. test 1.y85#edu 1.y85#1.female

{p 0 7}{space 1}{text:( 1)}{space 1} {res}1.y85#c.educ = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} 1.female#1.y85 = 0{p_end}

{txt}       F(  2,  1075) ={res}    3.43
{txt}{col 13}Prob > F ={res}    0.0326
{txt}
{com}. //_19
. test 1.y85 0.y85

{p 0 7}{space 1}{text:( 1)}{space 1} {res}1.y85 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} 0b.y85 = 0{p_end}
{txt}       Constraint 2 dropped

       F(  1,  1075) ={res}    0.91
{txt}{col 13}Prob > F ={res}    0.3415
{txt}
{com}. //_20
. use "slp75_81.dta", clear
{txt}
{com}. //_21
. gen id=_n
{txt}
{com}. gen age81=age75+6
{txt}
{com}. reshape long age educ gdhlth marr slpnap totwrk yngkid, i(id) j(year)
{txt}(note: j = 75 81)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     239   {txt}->{res}     478
{txt}Number of variables            {res}      22   {txt}->{res}      16
{txt}j variable (2 values)                     ->   {res}year
{txt}xij variables:
                            {res}age75 age81   {txt}->   {res}age
                          educ75 educ81   {txt}->   {res}educ
                      gdhlth75 gdhlth81   {txt}->   {res}gdhlth
                          marr75 marr81   {txt}->   {res}marr
                      slpnap75 slpnap81   {txt}->   {res}slpnap
                      totwrk75 totwrk81   {txt}->   {res}totwrk
                      yngkid75 yngkid81   {txt}->   {res}yngkid
{txt}{hline 77}

{com}. replace year=year+1900
{txt}variable {bf}year{sf} was {bf}{res}byte{sf}{txt} now {bf}{res}int{sf}
{txt}(478 real changes made)

{com}. //_22
. gen d75 = .
{txt}(478 missing values generated)

{com}. replace d75=0 if year==1981
{txt}(239 real changes made)

{com}. replace d75=1 if year==1975
{txt}(239 real changes made)

{com}. //_23
. gen d81=.
{txt}(478 missing values generated)

{com}. replace d81=0 if year==1975
{txt}(239 real changes made)

{com}. replace d81=1 if year==1981
{txt}(239 real changes made)

{com}. //_24
. tab year d75

           {txt}{c |}          d75
      year {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
      1975 {c |}{res}         0        239 {txt}{c |}{res}       239 
{txt}      1981 {c |}{res}       239          0 {txt}{c |}{res}       239 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       239        239 {txt}{c |}{res}       478 

{txt}
{com}. tab year d81

           {txt}{c |}          d81
      year {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
      1975 {c |}{res}       239          0 {txt}{c |}{res}       239 
{txt}      1981 {c |}{res}         0        239 {txt}{c |}{res}       239 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       239        239 {txt}{c |}{res}       478 

{txt}
{com}. tab d81 d75

           {txt}{c |}          d75
       d81 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         0        239 {txt}{c |}{res}       239 
{txt}         1 {c |}{res}       239          0 {txt}{c |}{res}       239 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       239        239 {txt}{c |}{res}       478 

{txt}
{com}. //_25
. xtset id year, delta(6)
{res}{txt}{col 8}panel variable:  {res}id (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1975 to 1981
{txt}{col 17}delta:  {res}6 units
{txt}
{com}. //_26
. histogram totwrk
{txt}(bin={res}21{txt}, start={res}0{txt}, width={res}228.80952{txt})
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/totwrk.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/totwrk.png written in PNG format)

{com}. //_27
. histogram slpnap
{txt}(bin={res}21{txt}, start={res}1240{txt}, width={res}231.90476{txt})
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/slpnap.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/slpnap.png written in PNG format)

{com}. //_28
. est clear
{txt}
{com}. eststo OLS: reg slpnap i.d81 totwrk educ marr yngkid gdhlth 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       478
{txt}{hline 13}{c +}{hline 34}   F(6, 471)       = {res}     8.50
{txt}       Model {c |} {res} 12812772.5         6  2135462.09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  118370944       471  251318.353   {txt}R-squared       ={res}    0.0977
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0862
{txt}       Total {c |} {res}  131183717       477  275018.274   {txt}Root MSE        =   {res} 501.32

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      slpnap{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d81 {c |}{col 14}{res}{space 2}-77.02965{col 26}{space 2} 47.96519{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-171.2819{col 67}{space 3} 17.22259
{txt}{space 6}totwrk {c |}{col 14}{res}{space 2}-.1500954{col 26}{space 2} .0244002{col 37}{space 1}   -6.15{col 46}{space 3}0.000{col 54}{space 4}-.1980421{col 67}{space 3}-.1021487
{txt}{space 8}educ {c |}{col 14}{res}{space 2}-20.25655{col 26}{space 2} 8.000179{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-35.97701{col 67}{space 3}-4.536091
{txt}{space 8}marr {c |}{col 14}{res}{space 2}-42.19389{col 26}{space 2} 53.07869{col 37}{space 1}   -0.79{col 46}{space 3}0.427{col 54}{space 4}-146.4942{col 67}{space 3} 62.10645
{txt}{space 6}yngkid {c |}{col 14}{res}{space 2}  74.2579{col 26}{space 2} 77.32582{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-77.68838{col 67}{space 3} 226.2042
{txt}{space 6}gdhlth {c |}{col 14}{res}{space 2} 29.03733{col 26}{space 2} 59.57889{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-88.03599{col 67}{space 3} 146.1107
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3958.756{col 26}{space 2} 121.7663{col 37}{space 1}   32.51{col 46}{space 3}0.000{col 54}{space 4} 3719.483{col 67}{space 3} 4198.028
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_29
. eststo FD: reg d.slpnap d.totwrk d.educ d.marr d.yngkid d.gdhlth

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       239
{txt}{hline 13}{c +}{hline 34}   F(5, 233)       = {res}     8.19
{txt}       Model {c |} {res} 14674698.2         5  2934939.64   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 83482611.7       233  358294.471   {txt}R-squared       ={res}    0.1495
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1313
{txt}       Total {c |} {res} 98157309.9       238  412425.672   {txt}Root MSE        =   {res} 598.58

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    D.slpnap{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}totwrk {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.2266694{col 26}{space 2}  .036054{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.2977029{col 67}{space 3}-.1556359
{txt}{space 12} {c |}
{space 8}educ {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0244717{col 26}{space 2} 48.75938{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-96.09008{col 67}{space 3} 96.04113
{txt}{space 12} {c |}
{space 8}marr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} 104.2139{col 26}{space 2} 92.85536{col 37}{space 1}    1.12{col 46}{space 3}0.263{col 54}{space 4}-78.72946{col 67}{space 3} 287.1574
{txt}{space 12} {c |}
{space 6}yngkid {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}  94.6654{col 26}{space 2} 87.65252{col 37}{space 1}    1.08{col 46}{space 3}0.281{col 54}{space 4}-78.02739{col 67}{space 3} 267.3582
{txt}{space 12} {c |}
{space 6}gdhlth {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} 87.57785{col 26}{space 2} 76.59913{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-63.33758{col 67}{space 3} 238.4933
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-92.63404{col 26}{space 2}  45.8659{col 37}{space 1}   -2.02{col 46}{space 3}0.045{col 54}{space 4}-182.9989{col 67}{space 3}-2.269152
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_30
. esttab OLS FD, mtitles se scalars(F r2) drop(0.d81)
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS              FD   
{txt}{hline 44}
{txt}1.d81       {res}       -77.03                   {txt}
            {res} {ralign 12:{txt:(}47.97{txt:)}}                   {txt}

{txt}totwrk      {res}       -0.150***                {txt}
            {res} {ralign 12:{txt:(}0.0244{txt:)}}                   {txt}

{txt}educ        {res}       -20.26*                  {txt}
            {res} {ralign 12:{txt:(}8.000{txt:)}}                   {txt}

{txt}marr        {res}       -42.19                   {txt}
            {res} {ralign 12:{txt:(}53.08{txt:)}}                   {txt}

{txt}yngkid      {res}        74.26                   {txt}
            {res} {ralign 12:{txt:(}77.33{txt:)}}                   {txt}

{txt}gdhlth      {res}        29.04                   {txt}
            {res} {ralign 12:{txt:(}59.58{txt:)}}                   {txt}

{txt}D.totwrk    {res}                       -0.227***{txt}
            {res}                 {ralign 12:{txt:(}0.0361{txt:)}}   {txt}

{txt}D.educ      {res}                      -0.0245   {txt}
            {res}                 {ralign 12:{txt:(}48.76{txt:)}}   {txt}

{txt}D.marr      {res}                        104.2   {txt}
            {res}                 {ralign 12:{txt:(}92.86{txt:)}}   {txt}

{txt}D.yngkid    {res}                        94.67   {txt}
            {res}                 {ralign 12:{txt:(}87.65{txt:)}}   {txt}

{txt}D.gdhlth    {res}                        87.58   {txt}
            {res}                 {ralign 12:{txt:(}76.60{txt:)}}   {txt}

{txt}_cons       {res}       3958.8***       -92.63*  {txt}
            {res} {ralign 12:{txt:(}121.8{txt:)}}    {ralign 12:{txt:(}45.87{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          478             239   {txt}
{txt}F           {res}        8.497           8.191   {txt}
{txt}r2          {res}       0.0977           0.150   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_31
. gen lnslpnap=ln(slpnap)
{txt}
{com}. gen lntotwrk=ln(totwrk)
{txt}(31 missing values generated)

{com}. gen lneduc=ln(educ)
{txt}
{com}. //_32
. reg d.lnslpnap d.lntotwrk d.lneduc d.marr d.yngkid d.gdhlth

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       214
{txt}{hline 13}{c +}{hline 34}   F(5, 208)       = {res}     4.17
{txt}       Model {c |} {res} .805249181         5  .161049836   {txt}Prob > F        ={res}    0.0012
{txt}    Residual {c |} {res} 8.03583239       208   .03863381   {txt}R-squared       ={res}    0.0911
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0692
{txt}       Total {c |} {res} 8.84108157       213  .041507425   {txt}Root MSE        =   {res} .19655

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  D.lnslpnap{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}lntotwrk {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0848256{col 26}{space 2} .0206499{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.1255354{col 67}{space 3}-.0441158
{txt}{space 12} {c |}
{space 6}lneduc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0289507{col 26}{space 2} .2628724{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}-.5471864{col 67}{space 3}  .489285
{txt}{space 12} {c |}
{space 8}marr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0038529{col 26}{space 2} .0323002{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-.0675306{col 67}{space 3} .0598247
{txt}{space 12} {c |}
{space 6}yngkid {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0056761{col 26}{space 2} .0290466{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.0515874{col 67}{space 3} .0629397
{txt}{space 12} {c |}
{space 6}gdhlth {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}  .048008{col 26}{space 2} .0266772{col 37}{space 1}    1.80{col 46}{space 3}0.073{col 54}{space 4}-.0045843{col 67}{space 3} .1006004
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0204204{col 26}{space 2} .0155593{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-.0510947{col 67}{space 3} .0102538
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_33
. use crime3.dta, clear
{txt}
{com}. //_34
. reg clcrime cclrprc1 cclrprc2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        53
{txt}{hline 13}{c +}{hline 34}   F(2, 50)        = {res}     5.99
{txt}       Model {c |} {res} 1.42294697         2  .711473484   {txt}Prob > F        ={res}    0.0046
{txt}    Residual {c |} {res} 5.93723904        50  .118744781   {txt}R-squared       ={res}    0.1933
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1611
{txt}       Total {c |} {res} 7.36018601        52  .141542039   {txt}Root MSE        =   {res} .34459

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     clcrime{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}cclrprc1 {c |}{col 14}{res}{space 2}-.0040475{col 26}{space 2} .0047199{col 37}{space 1}   -0.86{col 46}{space 3}0.395{col 54}{space 4}-.0135276{col 67}{space 3} .0054326
{txt}{space 4}cclrprc2 {c |}{col 14}{res}{space 2}-.0131966{col 26}{space 2} .0051946{col 37}{space 1}   -2.54{col 46}{space 3}0.014{col 54}{space 4}-.0236302{col 67}{space 3}-.0027629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0856556{col 26}{space 2} .0637825{col 37}{space 1}    1.34{col 46}{space 3}0.185{col 54}{space 4}-.0424553{col 67}{space 3} .2137665
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_35
. use "ezunem.dta", clear
{txt}
{com}. //_36
. reg luclms i.d82 i.d83 i.d84 i.d85 i.d86 i.d87 i.d88 cez

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       176
{txt}{hline 13}{c +}{hline 34}   F(8, 167)       = {res}    10.39
{txt}       Model {c |} {res} 29.2551235         8  3.65689043   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 58.7753327       167    .3519481   {txt}R-squared       ={res}    0.3323
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3003
{txt}       Total {c |} {res} 88.0304561       175  .503031178   {txt}Root MSE        =   {res} .59325

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      luclms{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d82 {c |}{col 14}{res}{space 2} .4571276{col 26}{space 2} .1788722{col 37}{space 1}    2.56{col 46}{space 3}0.011{col 54}{space 4} .1039853{col 67}{space 3} .8102699
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .1023765{col 26}{space 2} .1788722{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-.2507658{col 67}{space 3} .4555188
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.2821805{col 26}{space 2} .1882109{col 37}{space 1}   -1.50{col 46}{space 3}0.136{col 54}{space 4}-.6537598{col 67}{space 3} .0893988
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.3150721{col 26}{space 2} .1830816{col 37}{space 1}   -1.72{col 46}{space 3}0.087{col 54}{space 4}-.6765248{col 67}{space 3} .0463805
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2}-.3470941{col 26}{space 2} .1788722{col 37}{space 1}   -1.94{col 46}{space 3}0.054{col 54}{space 4}-.7002364{col 67}{space 3} .0060481
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} -.614778{col 26}{space 2} .1788722{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.9679202{col 67}{space 3}-.2616357
{txt}{space 7}1.d88 {c |}{col 14}{res}{space 2}-.9534624{col 26}{space 2} .1788722{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-1.306605{col 67}{space 3}-.6003201
{txt}{space 9}cez {c |}{col 14}{res}{space 2}-.0139924{col 26}{space 2} .2146822{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-.4378332{col 67}{space 3} .4098484
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 11.37276{col 26}{space 2} .1264818{col 37}{space 1}   89.92{col 46}{space 3}0.000{col 54}{space 4} 11.12305{col 67}{space 3} 11.62247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_37
. xtset city year
{res}{txt}{col 8}panel variable:  {res}city (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1980 to 1988
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. //_38
. reg d.luclms i.d82 i.d83 i.d84 i.d85 i.d86 i.d87 i.d88 d.ez

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       176
{txt}{hline 13}{c +}{hline 34}   F(8, 167)       = {res}    34.50
{txt}       Model {c |} {res} 12.8826331         8  1.61032914   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7.79583815       167  .046681666   {txt}R-squared       ={res}    0.6230
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6049
{txt}       Total {c |} {res} 20.6784713       175  .118162693   {txt}Root MSE        =   {res} .21606

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    D.luclms{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d82 {c |}{col 14}{res}{space 2} .7787595{col 26}{space 2} .0651444{col 37}{space 1}   11.95{col 46}{space 3}0.000{col 54}{space 4} .6501469{col 67}{space 3} .9073721
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0331192{col 26}{space 2} .0651444{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 54}{space 4}-.1617318{col 67}{space 3} .0954934
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0171382{col 26}{space 2} .0685455{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4}-.1524655{col 67}{space 3} .1181891
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}  .323081{col 26}{space 2} .0666774{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .1914417{col 67}{space 3} .4547202
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2}  .292154{col 26}{space 2} .0651444{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} .1635413{col 67}{space 3} .4207666
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0539481{col 26}{space 2} .0651444{col 37}{space 1}    0.83{col 46}{space 3}0.409{col 54}{space 4}-.0746645{col 67}{space 3} .1825607
{txt}{space 7}1.d88 {c |}{col 14}{res}{space 2}-.0170526{col 26}{space 2} .0651444{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.1456652{col 67}{space 3} .1115601
{txt}{space 12} {c |}
{space 10}ez {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1818775{col 26}{space 2} .0781862{col 37}{space 1}   -2.33{col 46}{space 3}0.021{col 54}{space 4}-.3362382{col 67}{space 3}-.0275169
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.3216319{col 26}{space 2}  .046064{col 37}{space 1}   -6.98{col 46}{space 3}0.000{col 54}{space 4}-.4125748{col 67}{space 3}-.2306891
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_39
. estat imtest

{txt}Cameron & Trivedi's decomposition of IM-test

{hline 21}{c TT}{hline 29}
{ralign 20:Source} {c |}       chi2     df      p
{hline 21}{c +}{hline 29}
{ralign 20:Heteroskedasticity} {c |}{res}      12.85      9    0.1697
{txt}{ralign 20:Skewness} {c |}{res}      13.04      8    0.1104
{txt}{ralign 20:Kurtosis} {c |}{res}       0.11      1    0.7414
{txt}{hline 21}{c +}{hline 29}
{ralign 20:Total} {c |}{res}      26.00     18    0.0998
{txt}{hline 21}{c BT}{hline 29}

{com}. //_40
. estat imtest, white

{txt}White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

{col 10}chi2({res}9{txt}){col 23}= {res}    12.85
{col 10}{txt}Prob > chi2  = {res}   0.1697

{txt}Cameron & Trivedi's decomposition of IM-test

{hline 21}{c TT}{hline 29}
{ralign 20:Source} {c |}       chi2     df      p
{hline 21}{c +}{hline 29}
{ralign 20:Heteroskedasticity} {c |}{res}      12.85      9    0.1697
{txt}{ralign 20:Skewness} {c |}{res}      13.04      8    0.1104
{txt}{ralign 20:Kurtosis} {c |}{res}       0.11      1    0.7414
{txt}{hline 21}{c +}{hline 29}
{ralign 20:Total} {c |}{res}      26.00     18    0.0998
{txt}{hline 21}{c BT}{hline 29}

{com}. //_41
. help xtserial
{txt}
{com}. xtserial luclms d83 d84 d85 d86 d87 d88 cez, output

{txt}Linear regression                               Number of obs     = {res}       154
                                                {txt}F(7, 21)          =  {res}   102.85
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4711
                                                {txt}Root MSE          =    {res} .28063

{txt}{ralign 78:(Std. Err. adjusted for {res:22} clusters in city)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    D.luclms{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}d83 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.3547511{col 26}{space 2} .0410541{col 37}{space 1}   -8.64{col 46}{space 3}0.000{col 54}{space 4}-.4401277{col 67}{space 3}-.2693745
{txt}{space 12} {c |}
{space 9}d84 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.7240107{col 26}{space 2} .0816269{col 37}{space 1}   -8.87{col 46}{space 3}0.000{col 54}{space 4} -.893763{col 67}{space 3}-.5542583
{txt}{space 12} {c |}
{space 9}d85 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.7620015{col 26}{space 2} .0540757{col 37}{space 1}  -14.09{col 46}{space 3}0.000{col 54}{space 4}-.8744581{col 67}{space 3}-.6495448
{txt}{space 12} {c |}
{space 9}d86 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.8042218{col 26}{space 2} .0490039{col 37}{space 1}  -16.41{col 46}{space 3}0.000{col 54}{space 4} -.906131{col 67}{space 3}-.7023126
{txt}{space 12} {c |}
{space 9}d87 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-1.071906{col 26}{space 2} .0496977{col 37}{space 1}  -21.57{col 46}{space 3}0.000{col 54}{space 4}-1.175258{col 67}{space 3}-.9685535
{txt}{space 12} {c |}
{space 9}d88 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} -1.41059{col 26}{space 2}  .065833{col 37}{space 1}  -21.43{col 46}{space 3}0.000{col 54}{space 4}-1.547497{col 67}{space 3}-1.273683
{txt}{space 12} {c |}
{space 9}cez {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} -.070083{col 26}{space 2} .0650804{col 37}{space 1}   -1.08{col 46}{space 3}0.294{col 54}{space 4} -.205425{col 67}{space 3}  .065259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
{col 5}F(  1,      21) = {res}   120.981
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. //_42
. reg d.luclms i.d82 i.d83 i.d84 i.d85 i.d86 i.d87 i.d88 d.cez, robust cluster(city)
{p 0 6 2}{txt}note: 1.d88 omitted because of collinearity{p_end}

Linear regression                               Number of obs     = {res}       154
                                                {txt}F(7, 21)          =  {res}    41.20
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.6333
                                                {txt}Root MSE          =    {res} .21865

{txt}{ralign 78:(Std. Err. adjusted for {res:22} clusters in city)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    D.luclms{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d82 {c |}{col 14}{res}{space 2} .7958121{col 26}{space 2} .0577076{col 37}{space 1}   13.79{col 46}{space 3}0.000{col 54}{space 4} .6758025{col 67}{space 3} .9158217
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0160666{col 26}{space 2} .0565946{col 37}{space 1}   -0.28{col 46}{space 3}0.779{col 54}{space 4}-.1337615{col 67}{space 3} .1016282
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0305751{col 26}{space 2} .0742049{col 37}{space 1}   -0.41{col 46}{space 3}0.684{col 54}{space 4}-.1848926{col 67}{space 3} .1237424
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .3006937{col 26}{space 2} .0568959{col 37}{space 1}    5.28{col 46}{space 3}0.000{col 54}{space 4} .1823723{col 67}{space 3} .4190151
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .2964642{col 26}{space 2} .0786548{col 37}{space 1}    3.77{col 46}{space 3}0.001{col 54}{space 4} .1328926{col 67}{space 3} .4600357
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0710007{col 26}{space 2} .0462206{col 37}{space 1}    1.54{col 46}{space 3}0.139{col 54}{space 4}-.0251204{col 67}{space 3} .1671217
{txt}{space 7}1.d88 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 9}cez {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} -.070083{col 26}{space 2} .0653029{col 37}{space 1}   -1.07{col 46}{space 3}0.295{col 54}{space 4}-.2058877{col 67}{space 3} .0657217
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.3386845{col 26}{space 2} .0359416{col 37}{space 1}   -9.42{col 46}{space 3}0.000{col 54}{space 4}-.4134292{col 67}{space 3}-.2639397
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_43
. use "crime4.dta", clear
{txt}
{com}. //_44
. reg lcrmrte i.d82 i.d83 i.d84 i.d85 i.d86 i.d87 lprbarr lprbconv lprbpris lavgsen lpolpc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       630
{txt}{hline 13}{c +}{hline 34}   F(11, 618)      = {res}    74.49
{txt}       Model {c |} {res} 117.644669        11  10.6949699   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  88.735673       618  .143585231   {txt}R-squared       ={res}    0.5700
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5624
{txt}       Total {c |} {res} 206.380342       629  .328108652   {txt}Root MSE        =   {res} .37893

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     lcrmrte{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d82 {c |}{col 14}{res}{space 2} .0051371{col 26}{space 2}  .057931{col 37}{space 1}    0.09{col 46}{space 3}0.929{col 54}{space 4}-.1086284{col 67}{space 3} .1189026
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} -.043503{col 26}{space 2} .0576243{col 37}{space 1}   -0.75{col 46}{space 3}0.451{col 54}{space 4}-.1566662{col 67}{space 3} .0696601
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.1087542{col 26}{space 2}  .057923{col 37}{space 1}   -1.88{col 46}{space 3}0.061{col 54}{space 4} -.222504{col 67}{space 3} .0049957
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0780454{col 26}{space 2} .0583244{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-.1925835{col 67}{space 3} .0364928
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2}-.0420791{col 26}{space 2} .0578218{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}  -.15563{col 67}{space 3} .0714719
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2}-.0270426{col 26}{space 2}  .056899{col 37}{space 1}   -0.48{col 46}{space 3}0.635{col 54}{space 4}-.1387815{col 67}{space 3} .0846963
{txt}{space 5}lprbarr {c |}{col 14}{res}{space 2}-.7195033{col 26}{space 2} .0367657{col 37}{space 1}  -19.57{col 46}{space 3}0.000{col 54}{space 4}-.7917042{col 67}{space 3}-.6473024
{txt}{space 4}lprbconv {c |}{col 14}{res}{space 2}-.5456589{col 26}{space 2} .0263683{col 37}{space 1}  -20.69{col 46}{space 3}0.000{col 54}{space 4}-.5974413{col 67}{space 3}-.4938765
{txt}{space 4}lprbpris {c |}{col 14}{res}{space 2} .2475521{col 26}{space 2} .0672268{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} .1155314{col 67}{space 3} .3795728
{txt}{space 5}lavgsen {c |}{col 14}{res}{space 2}-.0867575{col 26}{space 2} .0579205{col 37}{space 1}   -1.50{col 46}{space 3}0.135{col 54}{space 4}-.2005023{col 67}{space 3} .0269872
{txt}{space 6}lpolpc {c |}{col 14}{res}{space 2} .3659886{col 26}{space 2} .0300252{col 37}{space 1}   12.19{col 46}{space 3}0.000{col 54}{space 4} .3070248{col 67}{space 3} .4249525
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.082293{col 26}{space 2} .2516253{col 37}{space 1}   -8.28{col 46}{space 3}0.000{col 54}{space 4}-2.576438{col 67}{space 3}-1.588149
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_45
. xtset county year
{res}{txt}{col 8}panel variable:  {res}county (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 81 to 87
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. //_46
. reg d.lcrmrte i.d83 i.d84 i.d85 i.d86 i.d87 d.lprbarr d.lprbconv d.lprbpris d.lavgsen d.lpolpc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       540
{txt}{hline 13}{c +}{hline 34}   F(10, 529)      = {res}    40.32
{txt}       Model {c |} {res} 9.60042828        10  .960042828   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 12.5963755       529  .023811674   {txt}R-squared       ={res}    0.4325
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4218
{txt}       Total {c |} {res} 22.1968038       539  .041181454   {txt}Root MSE        =   {res} .15431

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   D.lcrmrte{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0998658{col 26}{space 2} .0238953{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-.1468071{col 67}{space 3}-.0529246
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0479374{col 26}{space 2} .0235021{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.0941063{col 67}{space 3}-.0017686
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0046111{col 26}{space 2} .0234998{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.0507756{col 67}{space 3} .0415533
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0275143{col 26}{space 2} .0241494{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.0199261{col 67}{space 3} .0749548
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0408267{col 26}{space 2} .0244153{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-.0071361{col 67}{space 3} .0887895
{txt}{space 12} {c |}
{space 5}lprbarr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.3274942{col 26}{space 2} .0299801{col 37}{space 1}  -10.92{col 46}{space 3}0.000{col 54}{space 4}-.3863889{col 67}{space 3}-.2685994
{txt}{space 12} {c |}
{space 4}lprbconv {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.2381066{col 26}{space 2} .0182341{col 37}{space 1}  -13.06{col 46}{space 3}0.000{col 54}{space 4}-.2739268{col 67}{space 3}-.2022864
{txt}{space 12} {c |}
{space 4}lprbpris {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1650462{col 26}{space 2}  .025969{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.2160613{col 67}{space 3}-.1140312
{txt}{space 12} {c |}
{space 5}lavgsen {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0217607{col 26}{space 2} .0220909{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-.0651574{col 67}{space 3}  .021636
{txt}{space 12} {c |}
{space 6}lpolpc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .3984264{col 26}{space 2}  .026882{col 37}{space 1}   14.82{col 46}{space 3}0.000{col 54}{space 4} .3456177{col 67}{space 3}  .451235
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0077134{col 26}{space 2} .0170579{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.0257961{col 67}{space 3} .0412229
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_47
. predict r, residual
{txt}(90 missing values generated)

{com}. gen lag_r =l.r
{txt}(180 missing values generated)

{com}. reg r lag_r i.d83 i.d84 i.d85 i.d86 i.d87 d.lprbarr d.lprbconv d.lprbpris d.lavgsen d.lpolpc
{p 0 6 2}{txt}note: 1.d87 omitted because of collinearity{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       450
{txt}{hline 13}{c +}{hline 34}   F(10, 439)      = {res}     2.35
{txt}       Model {c |} {res} .564663971        10  .056466397   {txt}Prob > F        ={res}    0.0102
{txt}    Residual {c |} {res}  10.528838       439  .023983686   {txt}R-squared       ={res}    0.0509
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0293
{txt}       Total {c |} {res}  11.093502       449  .024707131   {txt}Root MSE        =   {res} .15487

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           r{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lag_r {c |}{col 14}{res}{space 2}-.2332117{col 26}{space 2} .0488802{col 37}{space 1}   -4.77{col 46}{space 3}0.000{col 54}{space 4}  -.32928{col 67}{space 3}-.1371435
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0012379{col 26}{space 2} .0234019{col 37}{space 1}   -0.05{col 46}{space 3}0.958{col 54}{space 4}-.0472317{col 67}{space 3} .0447558
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0016543{col 26}{space 2} .0236303{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-.0480968{col 67}{space 3} .0447883
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0006044{col 26}{space 2} .0236114{col 37}{space 1}   -0.03{col 46}{space 3}0.980{col 54}{space 4}-.0470098{col 67}{space 3} .0458009
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0008841{col 26}{space 2} .0233216{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-.0449517{col 67}{space 3} .0467199
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 5}lprbarr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0082875{col 26}{space 2} .0330698{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.0567074{col 67}{space 3} .0732823
{txt}{space 12} {c |}
{space 4}lprbconv {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0036161{col 26}{space 2} .0200155{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.0429542{col 67}{space 3} .0357221
{txt}{space 12} {c |}
{space 4}lprbpris {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0017131{col 26}{space 2}  .027855{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-.0530326{col 67}{space 3} .0564588
{txt}{space 12} {c |}
{space 5}lavgsen {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0125831{col 26}{space 2} .0245006{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-.0607362{col 67}{space 3}   .03557
{txt}{space 12} {c |}
{space 6}lpolpc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0214883{col 26}{space 2} .0282688{col 37}{space 1}    0.76{col 46}{space 3}0.448{col 54}{space 4}-.0340706{col 67}{space 3} .0770473
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0005347{col 26}{space 2} .0167411{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4} -.032368{col 67}{space 3} .0334373
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_48
. reg d.lcrmrte i.d83 i.d84 i.d85 i.d86 i.d87 d.lprbarr d.lprbconv d.lprbpris d.lavgsen d.lpolpc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       540
{txt}{hline 13}{c +}{hline 34}   F(10, 529)      = {res}    40.32
{txt}       Model {c |} {res} 9.60042828        10  .960042828   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 12.5963755       529  .023811674   {txt}R-squared       ={res}    0.4325
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4218
{txt}       Total {c |} {res} 22.1968038       539  .041181454   {txt}Root MSE        =   {res} .15431

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   D.lcrmrte{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0998658{col 26}{space 2} .0238953{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-.1468071{col 67}{space 3}-.0529246
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0479374{col 26}{space 2} .0235021{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.0941063{col 67}{space 3}-.0017686
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0046111{col 26}{space 2} .0234998{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.0507756{col 67}{space 3} .0415533
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0275143{col 26}{space 2} .0241494{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.0199261{col 67}{space 3} .0749548
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0408267{col 26}{space 2} .0244153{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-.0071361{col 67}{space 3} .0887895
{txt}{space 12} {c |}
{space 5}lprbarr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.3274942{col 26}{space 2} .0299801{col 37}{space 1}  -10.92{col 46}{space 3}0.000{col 54}{space 4}-.3863889{col 67}{space 3}-.2685994
{txt}{space 12} {c |}
{space 4}lprbconv {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.2381066{col 26}{space 2} .0182341{col 37}{space 1}  -13.06{col 46}{space 3}0.000{col 54}{space 4}-.2739268{col 67}{space 3}-.2022864
{txt}{space 12} {c |}
{space 4}lprbpris {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1650462{col 26}{space 2}  .025969{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.2160613{col 67}{space 3}-.1140312
{txt}{space 12} {c |}
{space 5}lavgsen {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0217607{col 26}{space 2} .0220909{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-.0651574{col 67}{space 3}  .021636
{txt}{space 12} {c |}
{space 6}lpolpc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .3984264{col 26}{space 2}  .026882{col 37}{space 1}   14.82{col 46}{space 3}0.000{col 54}{space 4} .3456177{col 67}{space 3}  .451235
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0077134{col 26}{space 2} .0170579{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.0257961{col 67}{space 3} .0412229
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_49
. xtserial lcrmrte d83 d84 d85 d86 d87 lprbarr lprbconv lprbpris lavgsen lpolpc, output

{txt}Linear regression                               Number of obs     = {res}       540
                                                {txt}F(10, 89)         =  {res}    13.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4323
                                                {txt}Root MSE          =    {res} .15419

{txt}{ralign 78:(Std. Err. adjusted for {res:90} clusters in county)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   D.lcrmrte{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}d83 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0920147{col 26}{space 2} .0146354{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4} -.121095{col 67}{space 3}-.0629345
{txt}{space 12} {c |}
{space 9}d84 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1323557{col 26}{space 2} .0179759{col 37}{space 1}   -7.36{col 46}{space 3}0.000{col 54}{space 4}-.1680734{col 67}{space 3} -.096638
{txt}{space 12} {c |}
{space 9}d85 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1293278{col 26}{space 2} .0232716{col 37}{space 1}   -5.56{col 46}{space 3}0.000{col 54}{space 4}-.1755679{col 67}{space 3}-.0830876
{txt}{space 12} {c |}
{space 9}d86 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0938692{col 26}{space 2} .0209561{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4}-.1355086{col 67}{space 3}-.0522298
{txt}{space 12} {c |}
{space 9}d87 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0449434{col 26}{space 2} .0236533{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4} -.091942{col 67}{space 3} .0020552
{txt}{space 12} {c |}
{space 5}lprbarr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.3263268{col 26}{space 2} .0561808{col 37}{space 1}   -5.81{col 46}{space 3}0.000{col 54}{space 4} -.437957{col 67}{space 3}-.2146967
{txt}{space 12} {c |}
{space 4}lprbconv {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.2375214{col 26}{space 2} .0392585{col 37}{space 1}   -6.05{col 46}{space 3}0.000{col 54}{space 4}-.3155272{col 67}{space 3}-.1595155
{txt}{space 12} {c |}
{space 4}lprbpris {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1645109{col 26}{space 2} .0457092{col 37}{space 1}   -3.60{col 46}{space 3}0.001{col 54}{space 4} -.255334{col 67}{space 3}-.0736878
{txt}{space 12} {c |}
{space 5}lavgsen {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0246909{col 26}{space 2} .0252756{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.0749129{col 67}{space 3} .0255312
{txt}{space 12} {c |}
{space 6}lpolpc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .3976861{col 26}{space 2} .1024878{col 37}{space 1}    3.88{col 46}{space 3}0.000{col 54}{space 4} .1940451{col 67}{space 3} .6013271
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
{col 5}F(  1,      89) = {res}    22.065
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. //_50
. reg d.lcrmrte i.d83 i.d84 i.d85 i.d86 i.d87 d.lprbarr d.lprbconv d.lprbpris d.lavgsen d.lpolpc

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       540
{txt}{hline 13}{c +}{hline 34}   F(10, 529)      = {res}    40.32
{txt}       Model {c |} {res} 9.60042828        10  .960042828   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 12.5963755       529  .023811674   {txt}R-squared       ={res}    0.4325
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4218
{txt}       Total {c |} {res} 22.1968038       539  .041181454   {txt}Root MSE        =   {res} .15431

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   D.lcrmrte{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0998658{col 26}{space 2} .0238953{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-.1468071{col 67}{space 3}-.0529246
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0479374{col 26}{space 2} .0235021{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.0941063{col 67}{space 3}-.0017686
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0046111{col 26}{space 2} .0234998{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 54}{space 4}-.0507756{col 67}{space 3} .0415533
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0275143{col 26}{space 2} .0241494{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-.0199261{col 67}{space 3} .0749548
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0408267{col 26}{space 2} .0244153{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-.0071361{col 67}{space 3} .0887895
{txt}{space 12} {c |}
{space 5}lprbarr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.3274942{col 26}{space 2} .0299801{col 37}{space 1}  -10.92{col 46}{space 3}0.000{col 54}{space 4}-.3863889{col 67}{space 3}-.2685994
{txt}{space 12} {c |}
{space 4}lprbconv {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.2381066{col 26}{space 2} .0182341{col 37}{space 1}  -13.06{col 46}{space 3}0.000{col 54}{space 4}-.2739268{col 67}{space 3}-.2022864
{txt}{space 12} {c |}
{space 4}lprbpris {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1650462{col 26}{space 2}  .025969{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.2160613{col 67}{space 3}-.1140312
{txt}{space 12} {c |}
{space 5}lavgsen {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0217607{col 26}{space 2} .0220909{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-.0651574{col 67}{space 3}  .021636
{txt}{space 12} {c |}
{space 6}lpolpc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .3984264{col 26}{space 2}  .026882{col 37}{space 1}   14.82{col 46}{space 3}0.000{col 54}{space 4} .3456177{col 67}{space 3}  .451235
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0077134{col 26}{space 2} .0170579{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.0257961{col 67}{space 3} .0412229
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. rvfplot,yline(0)
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week3_htsk.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week3_htsk.png written in PNG format)

{com}. //_51
. estat imtest, white

{txt}White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

{col 10}chi2({res}50{txt}){col 23}= {res}   257.57
{col 10}{txt}Prob > chi2  = {res}   0.0000

{txt}Cameron & Trivedi's decomposition of IM-test

{hline 21}{c TT}{hline 29}
{ralign 20:Source} {c |}       chi2     df      p
{hline 21}{c +}{hline 29}
{ralign 20:Heteroskedasticity} {c |}{res}     257.57     50    0.0000
{txt}{ralign 20:Skewness} {c |}{res}      62.96     10    0.0000
{txt}{ralign 20:Kurtosis} {c |}{res}      12.82      1    0.0003
{txt}{hline 21}{c +}{hline 29}
{ralign 20:Total} {c |}{res}     333.35     61    0.0000
{txt}{hline 21}{c BT}{hline 29}

{com}. estat hettest

{txt}Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
{p 9 20}Variables: fitted values of D.lcrmrte

{col 10}chi2({res}1{txt}){col 23}={res}     1.16
{txt}{col 10}Prob > chi2{col 23}={res}   0.2807
{txt}
{com}. //_52
. reg d.lcrmrte i.d83 i.d84 i.d85 i.d86 i.d87 d.lprbarr d.lprbconv d.lprbpris d.lavgsen d.lpolpc, robust cluster(county)

{txt}Linear regression                               Number of obs     = {res}       540
                                                {txt}F(10, 89)         =  {res}    13.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4325
                                                {txt}Root MSE          =    {res} .15431

{txt}{ralign 78:(Std. Err. adjusted for {res:90} clusters in county)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   D.lcrmrte{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0998658{col 26}{space 2} .0222563{col 37}{space 1}   -4.49{col 46}{space 3}0.000{col 54}{space 4}-.1440887{col 67}{space 3} -.055643
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0479374{col 26}{space 2} .0200531{col 37}{space 1}   -2.39{col 46}{space 3}0.019{col 54}{space 4}-.0877825{col 67}{space 3}-.0080923
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0046111{col 26}{space 2}   .02503{col 37}{space 1}   -0.18{col 46}{space 3}0.854{col 54}{space 4}-.0543453{col 67}{space 3}  .045123
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0275143{col 26}{space 2} .0211829{col 37}{space 1}    1.30{col 46}{space 3}0.197{col 54}{space 4}-.0145756{col 67}{space 3} .0696043
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0408267{col 26}{space 2} .0241102{col 37}{space 1}    1.69{col 46}{space 3}0.094{col 54}{space 4}-.0070797{col 67}{space 3} .0887331
{txt}{space 12} {c |}
{space 5}lprbarr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.3274942{col 26}{space 2} .0564281{col 37}{space 1}   -5.80{col 46}{space 3}0.000{col 54}{space 4}-.4396157{col 67}{space 3}-.2153727
{txt}{space 12} {c |}
{space 4}lprbconv {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.2381066{col 26}{space 2} .0395843{col 37}{space 1}   -6.02{col 46}{space 3}0.000{col 54}{space 4}-.3167598{col 67}{space 3}-.1594534
{txt}{space 12} {c |}
{space 4}lprbpris {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.1650462{col 26}{space 2} .0457923{col 37}{space 1}   -3.60{col 46}{space 3}0.001{col 54}{space 4}-.2560345{col 67}{space 3} -.074058
{txt}{space 12} {c |}
{space 5}lavgsen {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0217607{col 26}{space 2}   .02582{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-.0730644{col 67}{space 3}  .029543
{txt}{space 12} {c |}
{space 6}lpolpc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .3984264{col 26}{space 2} .1029342{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} .1938983{col 67}{space 3} .6029545
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0077134{col 26}{space 2} .0137846{col 37}{space 1}    0.56{col 46}{space 3}0.577{col 54}{space 4}-.0196763{col 67}{space 3}  .035103
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_53
. cd "/Users/Sam/Desktop/Econ 645/Data/Mitchell"
{res}/Users/Sam/Desktop/Econ 645/Data/Mitchell
{txt}
{com}. //_54
. use "survey7.dta", clear
{txt}(Survey of graduate students)

{com}. //_55
. describe

{txt}Contains data from {res}survey7.dta
{txt}  obs:{res}             8                          Survey of graduate students
{txt} vars:{res}            11                          5 May 2020 14:37
{txt} size:{res}           400                          (_dta has notes)
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:STUDENTVARS    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}STUDENT VARIABLES ==============={p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:mf       }{bind:  }{res}{res}Gender of student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%19.0g    }{space 1}{bind:racelab  }{bind:* }{res}{res}Race of student{p_end}
{p 0 48}{bind:bday           }{txt}{bind: float   }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Date of birth of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%11.1fc   }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%18.0g    }{space 1}{bind:havelab  }{bind:* }{res}{res}Given birth to a child?{p_end}
{p 0 48}{bind:KIDVARS        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}KID VARIABLES ==================={p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%-10s     }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%15.0g    }{space 1}{bind:mfkid    }{bind:* }{res}{res}Sex of child{p_end}
{p 0 48}{bind:kbday          }{txt}{bind: float   }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Date of birth of child{p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by: 

{com}. //_56
. describe, short

{txt}Contains data from {res}survey7.dta
{txt}  obs:{res}             8                          Survey of graduate students
{txt} vars:{res}            11                          5 May 2020 14:37
{txt} size:{res}           400                          
{txt}Sorted by: 

{com}. //_57
. describe id gender race

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:mf       }{bind:  }{res}{res}Gender of student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%19.0g    }{space 1}{bind:racelab  }{bind:* }{res}{res}Race of student{p_end}
{txt}
{com}. //_58
. codebook

{txt}{hline}
{res}id{right:Unique identification variable}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}8{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}8{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}1
{col 21}         1{col 33}2
{col 21}         1{col 33}3
{col 21}         1{col 33}4
{col 21}         1{col 33}5
{col 21}         1{col 33}6
{col 21}         1{col 33}7
{col 21}         1{col 33}8

{txt}{hline}
{res}STUDENTVARS{right:STUDENT VARIABLES ===============}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}.{txt},{res}.{txt}]{col 55}units:  {res}.
{col 10}{txt}unique values:  {res}0{col 51}{txt}missing .:  {res}8{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         8{col 33}.

{txt}{hline}
{res}gender{right:Gender of student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:mf}

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         3{col 33}       1{col 43}{txt}Male
{col 21}{res}         5{col 33}       2{col 43}{txt}Female

{txt}{hline}
{res}race{right:Race of student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:racelab}

{col 18}range:  [{res}1{txt},{res}5{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         2{col 33}       1{col 43}{txt}White
{col 21}{res}         2{col 33}       2{col 43}{txt}Asian
{col 21}{res}         2{col 33}       3{col 43}{txt}Hispanic
{col 21}{res}         1{col 33}       4{col 43}{txt}African American
{col 21}{res}         1{col 33}       5{col 43}{txt}Other

{txt}{hline}
{res}bday{right:Date of birth of student}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}389{txt},{res}7935{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}24jan1961{txt},{res}22sep1981{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}8{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}389{col 40}{txt}24jan1961
{col 21}{res}         1{col 33}3027{col 40}{txt}15apr1968
{col 21}{res}         1{col 33}4160{col 40}{txt}23may1971
{col 21}{res}         1{col 33}4924{col 40}{txt}25jun1973
{col 21}{res}         1{col 33}5036{col 40}{txt}15oct1973
{col 21}{res}         1{col 33}6059{col 40}{txt}03aug1976
{col 21}{res}         1{col 33}6391{col 40}{txt}01jul1977
{col 21}{res}         1{col 33}7935{col 40}{txt}22sep1981

{txt}{hline}
{res}income{right:Income of student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}545.23{txt},{res}1284354.5{txt}]{col 55}units:  {res}.01
{col 10}{txt}unique values:  {res}8{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}545.22998
{col 21}         1{col 33}4500.9199
{col 21}         1{col 33}10500.93
{col 21}         1{col 33}45234.129
{col 21}         1{col 33}109452.11
{col 21}         1{col 33}120102.32
{col 21}         1{col 33}124313.45
{col 21}         1{col 33}1284354.5

{txt}{hline}
{res}havechild{right:Given birth to a child?}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:havelab}

{col 18}range:  [{res}0{txt},{res}1{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}1{col 50}{txt}missing .*:  {res}3{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       0{col 43}{txt}Dont Have Child
{col 21}{res}         4{col 33}       1{col 43}{txt}Have Child
{col 21}{res}         3{col 33}      .n{col 43}{txt}NA

{txt}{hline}
{res}KIDVARS{right:KID VARIABLES ===================}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}.{txt},{res}.{txt}]{col 55}units:  {res}.
{col 10}{txt}unique values:  {res}0{col 51}{txt}missing .:  {res}8{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         8{col 33}.

{txt}{hline}
{res}kidname{right:Name of child}
{txt}{hline}

{col 19}type:  string ({res}str10{txt}), but longest is str9

{col 10}unique values:  {res}5{col 51}{txt}missing "":  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         4{col 33}""
{col 21}         1{col 33}"Catherine"
{col 21}         1{col 33}"Robin"
{col 21}         1{col 33}"Sally"
{col 21}         1{col 33}"Samuell"

{txt}{col 16}warning:  variable has leading and trailing blanks

{txt}{hline}
{res}ksex{right:Sex of child}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:mfkid}

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}2{col 50}{txt}missing .*:  {res}5{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       1{col 43}{txt}Male
{col 21}{res}         2{col 33}       2{col 43}{txt}Female
{col 21}{res}         4{col 33}      .n{col 43}{txt}NA
{col 21}{res}         1{col 33}      .u{col 43}{txt}Unknown

{txt}{hline}
{res}kbday{right:Date of birth of child}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}12888{txt},{res}15932{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}15apr1995{txt},{res}15aug2003{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}4{col 51}{txt}missing .:  {res}4{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}12888{col 40}{txt}15apr1995
{col 21}{res}         1{col 33}14019{col 40}{txt}20may1998
{col 21}{res}         1{col 33}14256{col 40}{txt}12jan1999
{col 21}{res}         1{col 33}15932{col 40}{txt}15aug2003
{col 21}{res}         4{col 33}.{col 40}{txt}        .

{com}. //_59
. codebook race

{txt}{hline}
{res}race{right:Race of student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:racelab}

{col 18}range:  [{res}1{txt},{res}5{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         2{col 33}       1{col 43}{txt}White
{col 21}{res}         2{col 33}       2{col 43}{txt}Asian
{col 21}{res}         2{col 33}       3{col 43}{txt}Hispanic
{col 21}{res}         1{col 33}       4{col 43}{txt}African American
{col 21}{res}         1{col 33}       5{col 43}{txt}Other

{com}. //_60
. codebook havechild, notes

{txt}{hline}
{res}havechild{right:Given birth to a child?}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:havelab}

{col 18}range:  [{res}0{txt},{res}1{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}1{col 50}{txt}missing .*:  {res}3{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       0{col 43}{txt}Dont Have Child
{col 21}{res}         4{col 33}       1{col 43}{txt}Have Child
{col 21}{res}         3{col 33}      .n{col 43}{txt}NA
{res}
havechild:
{txt}{p 2 6}
1.
This variable measures whether a woman has given birth to a child, not just whether she is a parent.
{p_end}
{p 2 6}
2.
The .n (NA) missing code is used for males, because they cannot bear children.
{p_end}
{p 2 6}
3.
The .u (Unknown) missing code for a female indicating it is unknown if she has a child.
{p_end}

{com}. //_61
. codebook ksex, mv

{txt}{hline}
{res}ksex{right:Sex of child}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:mfkid}

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}2{col 50}{txt}missing .*:  {res}5{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       1{col 43}{txt}Male
{col 21}{res}         2{col 33}       2{col 43}{txt}Female
{col 21}{res}         4{col 33}      .n{col 43}{txt}NA
{col 21}{res}         1{col 33}      .u{col 43}{txt}Unknown

{col 9}missing values:{ralign 14:havechild}==mv --> ksex==mv
{col 24}{ralign 14:kbday}==mv --> ksex==mv

{com}. //_62
. lookfor birth

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:bday           }{txt}{bind: float   }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Date of birth of student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%18.0g    }{space 1}{bind:havelab  }{bind:* }{res}{res}Given birth to a child?{p_end}
{p 0 48}{bind:kbday          }{txt}{bind: float   }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Date of birth of child{p_end}
{txt}
{com}. //_63
. notes search birth
{res}
havechild:
{txt}{p 2 6}
1.
This variable measures whether a woman has given birth to a child, not just whether she is a parent.
{p_end}
{res}{txt}
{com}. //_64
. list income bday
{txt}
     {c TLC}{hline 13}{c -}{hline 10}{c TRC}
     {c |} {res}     income       bday {txt}{c |}
     {c LT}{hline 13}{c -}{hline 10}{c RT}
  1. {c |} {res}   10,500.9   01/24/61 {txt}{c |}
  2. {c |} {res}   45,234.1   04/15/68 {txt}{c |}
  3. {c |} {res}1,284,354.5   05/23/71 {txt}{c |}
  4. {c |} {res}  124,313.5   06/25/73 {txt}{c |}
  5. {c |} {res}  120,102.3   09/22/81 {txt}{c |}
     {c LT}{hline 13}{c -}{hline 10}{c RT}
  6. {c |} {res}      545.2   10/15/73 {txt}{c |}
  7. {c |} {res}  109,452.1   07/01/77 {txt}{c |}
  8. {c |} {res}    4,500.9   08/03/76 {txt}{c |}
     {c BLC}{hline 13}{c -}{hline 10}{c BRC}

{com}. describe income bday

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:income         }{txt}{bind: float   }{bind:{txt}%11.1fc   }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:bday           }{txt}{bind: float   }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}Date of birth of student{p_end}
{txt}
{com}. //_65
. use "survey1.dta", clear
{txt}
{com}. //_66
. describe 

{txt}Contains data from {res}survey1.dta
{txt}  obs:{res}             8                          
{txt} vars:{res}             9                          1 Jan 2010 12:13
{txt} size:{res}           432                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:kbdays         }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. //_67
. label variable id "Identification variable"
{txt}
{com}. label variable gender "Gender of the student"
{txt}
{com}. label variable race "Race of the student"
{txt}
{com}. label variable havechild "Given birth to a child"
{txt}
{com}. label variable ksex "Sex of child"
{txt}
{com}. label variable bday "Birthday of student"
{txt}
{com}. label variable income "Income of student"
{txt}
{com}. label variable kbdays "Birthday of child"
{txt}
{com}. label variable kidname "Name of child"
{txt}
{com}. describe

{txt}Contains data from {res}survey1.dta
{txt}  obs:{res}             8                          
{txt} vars:{res}             9                          1 Jan 2010 12:13
{txt} size:{res}           432                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Identification variable{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Gender of the student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Race of the student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Given birth to a child{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Sex of child{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:kbdays         }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of child{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{txt}{hline}
Sorted by: 

{com}. //_68
. label variable id "Unique identification variable"
{txt}
{com}. describe

{txt}Contains data from {res}survey1.dta
{txt}  obs:{res}             8                          
{txt} vars:{res}             9                          1 Jan 2010 12:13
{txt} size:{res}           432                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Gender of the student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Race of the student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Given birth to a child{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Sex of child{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:kbdays         }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of child{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{txt}{hline}
Sorted by: 

{com}. //_69
. save survey2, replace
{txt}file survey2.dta saved

{com}. //_70
. use survey2, clear
{txt}
{com}. //_71
. codebook 

{txt}{hline}
{res}id{right:Unique identification variable}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}8{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}8{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}1
{col 21}         1{col 33}2
{col 21}         1{col 33}3
{col 21}         1{col 33}4
{col 21}         1{col 33}5
{col 21}         1{col 33}6
{col 21}         1{col 33}7
{col 21}         1{col 33}8

{txt}{hline}
{res}gender{right:Gender of the student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         3{col 33}1
{col 21}         5{col 33}2

{txt}{hline}
{res}race{right:Race of the student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}5{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         2{col 33}1
{col 21}         2{col 33}2
{col 21}         2{col 33}3
{col 21}         1{col 33}4
{col 21}         1{col 33}5

{txt}{hline}
{res}havechild{right:Given birth to a child}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}0{txt},{res}1{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}1{col 50}{txt}missing .*:  {res}3{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}0
{col 21}         4{col 33}1
{col 21}         3{col 33}.n

{txt}{hline}
{res}ksex{right:Sex of child}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}2{col 50}{txt}missing .*:  {res}5{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}1
{col 21}         2{col 33}2
{col 21}         4{col 33}.n
{col 21}         1{col 33}.u

{txt}{hline}
{res}bdays{right:Birthday of student}
{txt}{hline}

{col 19}type:  string ({res}str10{txt})

{col 10}unique values:  {res}8{col 51}{txt}missing "":  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}"1/24/1961"
{col 21}         1{col 33}"10/15/1973"
{col 21}         1{col 33}"4/15/1968"
{col 21}         1{col 33}"5/23/1971"
{col 21}         1{col 33}"6/25/1973"
{col 21}         1{col 33}"7/1/1977"
{col 21}         1{col 33}"8/3/1976"
{col 21}         1{col 33}"9/22/1981"

{txt}{hline}
{res}income{right:Income of student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}545.23{txt},{res}1284354.5{txt}]{col 55}units:  {res}.01
{col 10}{txt}unique values:  {res}8{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         1{col 33}545.22998
{col 21}         1{col 33}4500.9199
{col 21}         1{col 33}10500.93
{col 21}         1{col 33}45234.129
{col 21}         1{col 33}109452.11
{col 21}         1{col 33}120102.32
{col 21}         1{col 33}124313.45
{col 21}         1{col 33}1284354.5

{txt}{hline}
{res}kbdays{right:Birthday of child}
{txt}{hline}

{col 19}type:  string ({res}str10{txt}), but longest is str9

{col 10}unique values:  {res}5{col 51}{txt}missing "":  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         4{col 33}""
{col 21}         1{col 33}"1/12/1999"
{col 21}         1{col 33}"4/15/1995"
{col 21}         1{col 33}"5/20/1998"
{col 21}         1{col 33}"8/15/2003"

{txt}{col 16}warning:  variable has leading and trailing blanks

{txt}{hline}
{res}kidname{right:Name of child}
{txt}{hline}

{col 19}type:  string ({res}str10{txt}), but longest is str9

{col 10}unique values:  {res}5{col 51}{txt}missing "":  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         4{col 33}""
{col 21}         1{col 33}"Catherine"
{col 21}         1{col 33}"Robin"
{col 21}         1{col 33}"Sally"
{col 21}         1{col 33}"Samuell"

{txt}{col 16}warning:  variable has leading and trailing blanks

{com}. //_72
. label define racelabel 1 "White" 2 "Asian" 3 "Hispanic" 4 "Black"
{txt}
{com}. //_73
. label values race racelabel
{txt}
{com}. //_74
. codebook race

{txt}{hline}
{res}race{right:Race of the student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:racelabel}, but {res:1} nonmissing value is not labeled

{col 18}range:  [{res}1{txt},{res}5{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         2{col 33}       1{col 43}{txt}White
{col 21}{res}         2{col 33}       2{col 43}{txt}Asian
{col 21}{res}         2{col 33}       3{col 43}{txt}Hispanic
{col 21}{res}         1{col 33}       4{col 43}{txt}Black
{col 21}{res}         1{col 33}       5{col 43}
{txt}
{com}. //_75
. label define racelabel 5 "Other", add
{txt}
{com}. //_76
. label define racelabel 4 "African American", modify
{txt}
{com}. //_77
. codebook race

{txt}{hline}
{res}race{right:Race of the student}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:racelabel}

{col 18}range:  [{res}1{txt},{res}5{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         2{col 33}       1{col 43}{txt}White
{col 21}{res}         2{col 33}       2{col 43}{txt}Asian
{col 21}{res}         2{col 33}       3{col 43}{txt}Hispanic
{col 21}{res}         1{col 33}       4{col 43}{txt}African American
{col 21}{res}         1{col 33}       5{col 43}{txt}Other

{com}. //_78
. label define mfkid 1 "Male" 2 "Female" .u "Unknown" .n "NA"
{txt}
{com}. label values ksex mfkid
{txt}
{com}. codebook ksex

{txt}{hline}
{res}ksex{right:Sex of child}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:mfkid}

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}2{col 50}{txt}missing .*:  {res}5{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       1{col 43}{txt}Male
{col 21}{res}         2{col 33}       2{col 43}{txt}Female
{col 21}{res}         4{col 33}      .n{col 43}{txt}NA
{col 21}{res}         1{col 33}      .u{col 43}{txt}Unknown

{com}. //_79
. label define havechildlabel 0 "Don't have a child" 1 "Have a child" .u "Unknown" .n "NA"
{txt}
{com}. label values havechild havechildlabel
{txt}
{com}. codebook havechild

{txt}{hline}
{res}havechild{right:Given birth to a child}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})
{ralign 22:label}:  {res:havechildlabel}

{col 18}range:  [{res}0{txt},{res}1{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}8
{col 8}{txt}unique mv codes:  {res}1{col 50}{txt}missing .*:  {res}3{txt}/{res}8

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       0{col 43}{txt}Don't have a child
{col 21}{res}         4{col 33}       1{col 43}{txt}Have a child
{col 21}{res}         3{col 33}      .n{col 43}{txt}NA

{com}. //_80
. label list
{txt}havechildlabel:
{res}           0 Don't have a child
           1 Have a child
          .n NA
          .u Unknown
{txt}mfkid:
{res}           1 Male
           2 Female
          .n NA
          .u Unknown
{txt}racelabel:
{res}           1 White
           2 Asian
           3 Hispanic
           4 African American
           5 Other
{txt}
{com}. //_81
. numlabel racelabel, add
{res}{txt}
{com}. label list racelabel
{txt}racelabel:
{res}           1 1. White
           2 2. Asian
           3 3. Hispanic
           4 4. African American
           5 5. Other
{txt}
{com}. tabulate race

{txt}Race of the student {c |}      Freq.     Percent        Cum.
{hline 20}{c +}{hline 35}
           1. White {c |}{res}          2       25.00       25.00
{txt}           2. Asian {c |}{res}          2       25.00       50.00
{txt}        3. Hispanic {c |}{res}          2       25.00       75.00
{txt}4. African American {c |}{res}          1       12.50       87.50
{txt}           5. Other {c |}{res}          1       12.50      100.00
{txt}{hline 20}{c +}{hline 35}
              Total {c |}{res}          8      100.00
{txt}
{com}. //_82
. numlabel racelabel, remove
{res}{txt}
{com}. tabulate race

     {txt}Race of the {c |}
         student {c |}      Freq.     Percent        Cum.
{hline 17}{c +}{hline 35}
           White {c |}{res}          2       25.00       25.00
{txt}           Asian {c |}{res}          2       25.00       50.00
{txt}        Hispanic {c |}{res}          2       25.00       75.00
{txt}African American {c |}{res}          1       12.50       87.50
{txt}           Other {c |}{res}          1       12.50      100.00
{txt}{hline 17}{c +}{hline 35}
           Total {c |}{res}          8      100.00
{txt}
{com}. //_83
. numlabel racelabel, add mask("#) ")
{res}{txt}
{com}. tabulate race

{txt}Race of the student {c |}      Freq.     Percent        Cum.
{hline 20}{c +}{hline 35}
           1) White {c |}{res}          2       25.00       25.00
{txt}           2) Asian {c |}{res}          2       25.00       50.00
{txt}        3) Hispanic {c |}{res}          2       25.00       75.00
{txt}4) African American {c |}{res}          1       12.50       87.50
{txt}           5) Other {c |}{res}          1       12.50      100.00
{txt}{hline 20}{c +}{hline 35}
              Total {c |}{res}          8      100.00
{txt}
{com}. //_84
. numlabel racelabel, remove mask("#) ")
{res}{txt}
{com}. tabulate race

     {txt}Race of the {c |}
         student {c |}      Freq.     Percent        Cum.
{hline 17}{c +}{hline 35}
           White {c |}{res}          2       25.00       25.00
{txt}           Asian {c |}{res}          2       25.00       50.00
{txt}        Hispanic {c |}{res}          2       25.00       75.00
{txt}African American {c |}{res}          1       12.50       87.50
{txt}           Other {c |}{res}          1       12.50      100.00
{txt}{hline 17}{c +}{hline 35}
           Total {c |}{res}          8      100.00
{txt}
{com}. //_85
. save survey3, replace
{txt}file survey3.dta saved

{com}. //_86
. label dir
{res}racelabel
havechildlabel
mfkid
{txt}
{com}. //_87
. label list
{txt}racelabel:
{res}           1 White
           2 Asian
           3 Hispanic
           4 African American
           5 Other
{txt}havechildlabel:
{res}           0 Don't have a child
           1 Have a child
          .n NA
          .u Unknown
{txt}mfkid:
{res}           1 Male
           2 Female
          .n NA
          .u Unknown
{txt}
{com}. //_88
. label save havechildlabel racelabel using surveylabs, replace
{txt}file surveylabs.do saved

{com}. type surveylabs.do
{res}label define havechildlabel 0 `"Don't have a child"', modify
label define havechildlabel 1 `"Have a child"', modify
label define havechildlabel .n `"NA"', modify
label define havechildlabel .u `"Unknown"', modify
label define racelabel 1 `"White"', modify
label define racelabel 2 `"Asian"', modify
label define racelabel 3 `"Hispanic"', modify
label define racelabel 4 `"African American"', modify
label define racelabel 5 `"Other"', modify
{txt}
{com}. //_89
. labelbook

{txt}{hline}
value label {res}havechildlabel 
{txt}{hline}

{col 7}{hi:values}{col 49}{hi:labels}
{col 8}range:  [{res}0{txt},{res}1{txt}]{col 42}string length:  [{res}2{txt},{res}18{txt}]
{col 12}N:  {res}4{col 34}{txt}unique at full length:  {res}yes
{col 9}{txt}gaps:  {res}no{col 36}{txt}{ralign 20:unique at length 12:}  {res}yes
{col 3}{txt}missing .*:  {res}2{col 44}{txt}null string:  {res}no
{col 32}{txt}leading/trailing blanks:  {res}no
{col 37}{txt}numeric -> numeric:  {res}no
  {hi:definition}
{txt}{p 0 15 2}{space 11}0{space 2}
{res}   {ul:Don't have a}{res} child
{p_end}
{txt}{p 0 15 2}{space 11}1{space 2}
{res}Have a child
{p_end}
{txt}{p 0 15 2}{space 10}.n{space 2}
{res}NA
{p_end}
{txt}{p 0 15 2}{space 10}.u{space 2}
{res}Unknown
{p_end}

{txt}{p 3 15}variables:{space 2}{res}havechild


{txt}{hline}
value label {res}mfkid 
{txt}{hline}

{col 7}{hi:values}{col 49}{hi:labels}
{col 8}range:  [{res}1{txt},{res}2{txt}]{col 42}string length:  [{res}2{txt},{res}7{txt}]
{col 12}N:  {res}4{col 34}{txt}unique at full length:  {res}yes
{col 9}{txt}gaps:  {res}no{col 36}{txt}{ralign 20:unique at length 12:}  {res}yes
{col 3}{txt}missing .*:  {res}2{col 44}{txt}null string:  {res}no
{col 32}{txt}leading/trailing blanks:  {res}no
{col 37}{txt}numeric -> numeric:  {res}no
  {hi:definition}
{txt}{p 0 15 2}{space 11}1{space 2}
{res}Male
{p_end}
{txt}{p 0 15 2}{space 11}2{space 2}
{res}Female
{p_end}
{txt}{p 0 15 2}{space 10}.n{space 2}
{res}NA
{p_end}
{txt}{p 0 15 2}{space 10}.u{space 2}
{res}Unknown
{p_end}

{txt}{p 3 15}variables:{space 2}{res}ksex


{txt}{hline}
value label {res}racelabel 
{txt}{hline}

{col 7}{hi:values}{col 49}{hi:labels}
{col 8}range:  [{res}1{txt},{res}5{txt}]{col 42}string length:  [{res}5{txt},{res}16{txt}]
{col 12}N:  {res}5{col 34}{txt}unique at full length:  {res}yes
{col 9}{txt}gaps:  {res}no{col 36}{txt}{ralign 20:unique at length 12:}  {res}yes
{col 3}{txt}missing .*:  {res}0{col 44}{txt}null string:  {res}no
{col 32}{txt}leading/trailing blanks:  {res}no
{col 37}{txt}numeric -> numeric:  {res}no
  {hi:definition}
{txt}{p 0 15 2}{space 11}1{space 2}
{res}White
{p_end}
{txt}{p 0 15 2}{space 11}2{space 2}
{res}Asian
{p_end}
{txt}{p 0 15 2}{space 11}3{space 2}
{res}Hispanic
{p_end}
{txt}{p 0 15 2}{space 11}4{space 2}
{res}   {ul:African Amer}{res}ican
{p_end}
{txt}{p 0 15 2}{space 11}5{space 2}
{res}Other
{p_end}

{txt}{p 3 15}variables:{space 2}{res}race

{txt}
{com}. labelbook racelabel

{txt}{hline}
value label {res}racelabel 
{txt}{hline}

{col 7}{hi:values}{col 49}{hi:labels}
{col 8}range:  [{res}1{txt},{res}5{txt}]{col 42}string length:  [{res}5{txt},{res}16{txt}]
{col 12}N:  {res}5{col 34}{txt}unique at full length:  {res}yes
{col 9}{txt}gaps:  {res}no{col 36}{txt}{ralign 20:unique at length 12:}  {res}yes
{col 3}{txt}missing .*:  {res}0{col 44}{txt}null string:  {res}no
{col 32}{txt}leading/trailing blanks:  {res}no
{col 37}{txt}numeric -> numeric:  {res}no
  {hi:definition}
{txt}{p 0 15 2}{space 11}1{space 2}
{res}White
{p_end}
{txt}{p 0 15 2}{space 11}2{space 2}
{res}Asian
{p_end}
{txt}{p 0 15 2}{space 11}3{space 2}
{res}Hispanic
{p_end}
{txt}{p 0 15 2}{space 11}4{space 2}
{res}   {ul:African Amer}{res}ican
{p_end}
{txt}{p 0 15 2}{space 11}5{space 2}
{res}Other
{p_end}

{txt}{p 3 15}variables:{space 2}{res}race

{txt}
{com}. //_90
. labelbook, problem

{txt}no potential problems in dataset {res}survey3.dta
{txt}
{com}. //_91
. labelbook racelabel, problem detail

{txt}{hline}
value label {res}racelabel 
{txt}{hline}

{col 7}{hi:values}{col 49}{hi:labels}
{col 8}range:  [{res}1{txt},{res}5{txt}]{col 42}string length:  [{res}5{txt},{res}16{txt}]
{col 12}N:  {res}5{col 34}{txt}unique at full length:  {res}yes
{col 9}{txt}gaps:  {res}no{col 36}{txt}{ralign 20:unique at length 12:}  {res}yes
{col 3}{txt}missing .*:  {res}0{col 44}{txt}null string:  {res}no
{col 32}{txt}leading/trailing blanks:  {res}no
{col 37}{txt}numeric -> numeric:  {res}no
  {hi:definition}
{txt}{p 0 15 2}{space 11}1{space 2}
{res}White
{p_end}
{txt}{p 0 15 2}{space 11}2{space 2}
{res}Asian
{p_end}
{txt}{p 0 15 2}{space 11}3{space 2}
{res}Hispanic
{p_end}
{txt}{p 0 15 2}{space 11}4{space 2}
{res}   {ul:African Amer}{res}ican
{p_end}
{txt}{p 0 15 2}{space 11}5{space 2}
{res}Other
{p_end}

{txt}{p 3 15}variables:{space 2}{res}race


{txt}no potential problems in dataset {res}survey3.dta
{txt}
{com}. //_92
. note: This was based on the dataset called survey1.txt
{res}{txt}
{com}. //_93
. note: The missing values for havechild and childage were coded using -1 and -2 but were converted to .n and .u TS
{res}{txt}
{com}. //_94
. notes
{res}
_dta:
{txt}{p 2 6}
1.
This was based on the dataset called survey1.txt
{p_end}
{p 2 6}
2.
The missing values for havechild and childage were coded using -1 and -2 but were converted to .n and .u 10 Sep 2023 16:40
{p_end}

{com}. //_95
. note race: The other category includes people who specified multiple races
{res}{txt}
{com}. note race: This is another note
{res}{txt}
{com}. note race: This is a third note
{res}{txt}
{com}. notes
{res}
_dta:
{txt}{p 2 6}
1.
This was based on the dataset called survey1.txt
{p_end}
{p 2 6}
2.
The missing values for havechild and childage were coded using -1 and -2 but were converted to .n and .u 10 Sep 2023 16:40
{p_end}

{res}race:
{txt}{p 2 6}
1.
The other category includes people who specified multiple races
{p_end}
{p 2 6}
2.
This is another note
{p_end}
{p 2 6}
3.
This is a third note
{p_end}

{com}. //_96
. notes race
{res}
race:
{txt}{p 2 6}
1.
The other category includes people who specified multiple races
{p_end}
{p 2 6}
2.
This is another note
{p_end}
{p 2 6}
3.
This is a third note
{p_end}

{com}. //_97
. notes drop race in 2
{res}{txt}  (1 note dropped)

{com}. notes race
{res}
race:
{txt}{p 2 6}
1.
The other category includes people who specified multiple races
{p_end}
{p 2 6}
3.
This is a third note
{p_end}

{com}. //_98
. notes renumber race
{res}{txt}
{com}. notes race
{res}
race:
{txt}{p 2 6}
1.
The other category includes people who specified multiple races
{p_end}
{p 2 6}
2.
This is a third note
{p_end}

{com}. //_99
. notes search .u
{res}
_dta:
{txt}{p 2 6}
2.
The missing values for havechild and childage were coded using -1 and -2 but were converted to .n and .u 10 Sep 2023 16:40
{p_end}
{res}{txt}
{com}. //_100
. use survey5, clear
{txt}(Survey of graduate students)

{com}. //_101
. list id income in 1/5
{txt}
     {c TLC}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}id     income {txt}{c |}
     {c LT}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res} 1   10500.93 {txt}{c |}
  2. {c |} {res} 2   45234.13 {txt}{c |}
  3. {c |} {res} 3    1284355 {txt}{c |}
  4. {c |} {res} 4   124313.5 {txt}{c |}
  5. {c |} {res} 5   120102.3 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_102
. describe income

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:income         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{txt}
{com}. //_103
. format income %12.2f
{txt}
{com}. list income in 1/5
{txt}
     {c TLC}{hline 12}{c TRC}
     {c |} {res}    income {txt}{c |}
     {c LT}{hline 12}{c RT}
  1. {c |} {res}  10500.93 {txt}{c |}
  2. {c |} {res}  45234.13 {txt}{c |}
  3. {c |} {res}1284354.50 {txt}{c |}
  4. {c |} {res} 124313.45 {txt}{c |}
  5. {c |} {res} 120102.32 {txt}{c |}
     {c BLC}{hline 12}{c BRC}

{com}. //_104
. format income %7.0f
{txt}
{com}. list income in 1/5
{txt}
     {c TLC}{hline 9}{c TRC}
     {c |} {res} income {txt}{c |}
     {c LT}{hline 9}{c RT}
  1. {c |} {res}  10501 {txt}{c |}
  2. {c |} {res}  45234 {txt}{c |}
  3. {c |} {res}1284354 {txt}{c |}
  4. {c |} {res} 124313 {txt}{c |}
  5. {c |} {res} 120102 {txt}{c |}
     {c BLC}{hline 9}{c BRC}

{com}. //_105
. format income %9.1f
{txt}
{com}. list income in 1/5
{txt}
     {c TLC}{hline 11}{c TRC}
     {c |} {res}   income {txt}{c |}
     {c LT}{hline 11}{c RT}
  1. {c |} {res}  10500.9 {txt}{c |}
  2. {c |} {res}  45234.1 {txt}{c |}
  3. {c |} {res}1284354.5 {txt}{c |}
  4. {c |} {res} 124313.5 {txt}{c |}
  5. {c |} {res} 120102.3 {txt}{c |}
     {c BLC}{hline 11}{c BRC}

{com}. //_106
. format income %12.2fc
{txt}
{com}. list income in 1/5
{txt}
     {c TLC}{hline 14}{c TRC}
     {c |} {res}      income {txt}{c |}
     {c LT}{hline 14}{c RT}
  1. {c |} {res}   10,500.93 {txt}{c |}
  2. {c |} {res}   45,234.13 {txt}{c |}
  3. {c |} {res}1,284,354.50 {txt}{c |}
  4. {c |} {res}  124,313.45 {txt}{c |}
  5. {c |} {res}  120,102.32 {txt}{c |}
     {c BLC}{hline 14}{c BRC}

{com}. //_107
. describe kidname

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{txt}
{com}. //_108
. list kidname
{txt}
     {c TLC}{hline 11}{c TRC}
     {c |} {res}  kidname {txt}{c |}
     {c LT}{hline 11}{c RT}
  1. {c |} {res}          {txt}{c |}
  2. {c |} {res}    Sally {txt}{c |}
  3. {c |} {res}Catherine {txt}{c |}
  4. {c |} {res}          {txt}{c |}
  5. {c |} {res}  Samuell {txt}{c |}
     {c LT}{hline 11}{c RT}
  6. {c |} {res}          {txt}{c |}
  7. {c |} {res}    Robin {txt}{c |}
  8. {c |} {res}          {txt}{c |}
     {c BLC}{hline 11}{c BRC}

{com}. //_109
. format kidname %-10s
{txt}
{com}. list kidname
{txt}
     {c TLC}{hline 11}{c TRC}
     {c |} {res}kidname   {txt}{c |}
     {c LT}{hline 11}{c RT}
  1. {c |} {res}          {txt}{c |}
  2. {c |} {res}Sally     {txt}{c |}
  3. {c |} {res}Catherine {txt}{c |}
  4. {c |} {res}          {txt}{c |}
  5. {c |} {res}Samuell   {txt}{c |}
     {c LT}{hline 11}{c RT}
  6. {c |} {res}          {txt}{c |}
  7. {c |} {res}Robin     {txt}{c |}
  8. {c |} {res}          {txt}{c |}
     {c BLC}{hline 11}{c BRC}

{com}. //_110
. list bdays kbdays
{txt}
     {c TLC}{hline 12}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays      kbdays {txt}{c |}
     {c LT}{hline 12}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961             {txt}{c |}
  2. {c |} {res} 4/15/1968   4/15/1995 {txt}{c |}
  3. {c |} {res} 5/23/1971   8/15/2003 {txt}{c |}
  4. {c |} {res} 6/25/1973             {txt}{c |}
  5. {c |} {res} 9/22/1981   1/12/1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973             {txt}{c |}
  7. {c |} {res}  7/1/1977   5/20/1998 {txt}{c |}
  8. {c |} {res}  8/3/1976             {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 11}{c BRC}

{com}. //_111
. generate bday = date(bdays, "MDY")
{txt}
{com}. generate kbday = date(kbdays, "MDY")
{txt}(4 missing values generated)

{com}. //_112
. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 6}{c -}{hline 11}{c -}{hline 7}{c TRC}
     {c |} {res}     bdays   bday      kbdays   kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 6}{c -}{hline 11}{c -}{hline 7}{c RT}
  1. {c |} {res} 1/24/1961    389                   . {txt}{c |}
  2. {c |} {res} 4/15/1968   3027   4/15/1995   12888 {txt}{c |}
  3. {c |} {res} 5/23/1971   4160   8/15/2003   15932 {txt}{c |}
  4. {c |} {res} 6/25/1973   4924                   . {txt}{c |}
  5. {c |} {res} 9/22/1981   7935   1/12/1999   14256 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 6}{c -}{hline 11}{c -}{hline 7}{c RT}
  6. {c |} {res}10/15/1973   5036                   . {txt}{c |}
  7. {c |} {res}  7/1/1977   6391   5/20/1998   14019 {txt}{c |}
  8. {c |} {res}  8/3/1976   6059                   . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 6}{c -}{hline 11}{c -}{hline 7}{c BRC}

{com}. //_113
. format bday %td 
{txt}
{com}. format kbday %td
{txt}
{com}. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays        bday      kbdays       kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961   24jan1961                       . {txt}{c |}
  2. {c |} {res} 4/15/1968   15apr1968   4/15/1995   15apr1995 {txt}{c |}
  3. {c |} {res} 5/23/1971   23may1971   8/15/2003   15aug2003 {txt}{c |}
  4. {c |} {res} 6/25/1973   25jun1973                       . {txt}{c |}
  5. {c |} {res} 9/22/1981   22sep1981   1/12/1999   12jan1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973   15oct1973                       . {txt}{c |}
  7. {c |} {res}  7/1/1977   01jul1977   5/20/1998   20may1998 {txt}{c |}
  8. {c |} {res}  8/3/1976   03aug1976                       . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_114
. format bday %tdNN/DD/YY
{txt}
{com}. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 10}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays       bday      kbdays       kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 10}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961   01/24/61                       . {txt}{c |}
  2. {c |} {res} 4/15/1968   04/15/68   4/15/1995   15apr1995 {txt}{c |}
  3. {c |} {res} 5/23/1971   05/23/71   8/15/2003   15aug2003 {txt}{c |}
  4. {c |} {res} 6/25/1973   06/25/73                       . {txt}{c |}
  5. {c |} {res} 9/22/1981   09/22/81   1/12/1999   12jan1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 10}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973   10/15/73                       . {txt}{c |}
  7. {c |} {res}  7/1/1977   07/01/77   5/20/1998   20may1998 {txt}{c |}
  8. {c |} {res}  8/3/1976   08/03/76                       . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 10}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. format bday %tdMonth/DD/YY 
{txt}
{com}. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 17}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays              bday      kbdays       kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961     January/24/61                       . {txt}{c |}
  2. {c |} {res} 4/15/1968       April/15/68   4/15/1995   15apr1995 {txt}{c |}
  3. {c |} {res} 5/23/1971         May/23/71   8/15/2003   15aug2003 {txt}{c |}
  4. {c |} {res} 6/25/1973        June/25/73                       . {txt}{c |}
  5. {c |} {res} 9/22/1981   September/22/81   1/12/1999   12jan1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 17}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973     October/15/73                       . {txt}{c |}
  7. {c |} {res}  7/1/1977        July/01/77   5/20/1998   20may1998 {txt}{c |}
  8. {c |} {res}  8/3/1976      August/03/76                       . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 17}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_115
. format bday %tdMonth_DD,CCYY
{txt}
{com}. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 19}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays                bday      kbdays       kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 19}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961     January 24,1961                       . {txt}{c |}
  2. {c |} {res} 4/15/1968       April 15,1968   4/15/1995   15apr1995 {txt}{c |}
  3. {c |} {res} 5/23/1971         May 23,1971   8/15/2003   15aug2003 {txt}{c |}
  4. {c |} {res} 6/25/1973        June 25,1973                       . {txt}{c |}
  5. {c |} {res} 9/22/1981   September 22,1981   1/12/1999   12jan1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 19}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973     October 15,1973                       . {txt}{c |}
  7. {c |} {res}  7/1/1977        July 01,1977   5/20/1998   20may1998 {txt}{c |}
  8. {c |} {res}  8/3/1976      August 03,1976                       . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 19}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_116
. format bday %tdNN/DD/YYYY
{txt}
{com}. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays         bday      kbdays       kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961   01/24/6161                       . {txt}{c |}
  2. {c |} {res} 4/15/1968   04/15/6868   4/15/1995   15apr1995 {txt}{c |}
  3. {c |} {res} 5/23/1971   05/23/7171   8/15/2003   15aug2003 {txt}{c |}
  4. {c |} {res} 6/25/1973   06/25/7373                       . {txt}{c |}
  5. {c |} {res} 9/22/1981   09/22/8181   1/12/1999   12jan1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973   10/15/7373                       . {txt}{c |}
  7. {c |} {res}  7/1/1977   07/01/7777   5/20/1998   20may1998 {txt}{c |}
  8. {c |} {res}  8/3/1976   08/03/7676                       . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_117
. format bday %tdNN/DD/CCYY
{txt}
{com}. list bdays bday kbdays kbday
{txt}
     {c TLC}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}     bdays         bday      kbdays       kbday {txt}{c |}
     {c LT}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res} 1/24/1961   01/24/1961                       . {txt}{c |}
  2. {c |} {res} 4/15/1968   04/15/1968   4/15/1995   15apr1995 {txt}{c |}
  3. {c |} {res} 5/23/1971   05/23/1971   8/15/2003   15aug2003 {txt}{c |}
  4. {c |} {res} 6/25/1973   06/25/1973                       . {txt}{c |}
  5. {c |} {res} 9/22/1981   09/22/1981   1/12/1999   12jan1999 {txt}{c |}
     {c LT}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}10/15/1973   10/15/1973                       . {txt}{c |}
  7. {c |} {res}  7/1/1977   07/01/1977   5/20/1998   20may1998 {txt}{c |}
  8. {c |} {res}  8/3/1976   08/03/1976                       . {txt}{c |}
     {c BLC}{hline 12}{c -}{hline 12}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_118
. label variable bday "Date of birth of student"
{txt}
{com}. label variable kbdays "Date of birth of child"
{txt}
{com}. //_119
. drop bday kbdays
{txt}
{com}. //_120
. save survey6, replace
{txt}file survey6.dta saved

{com}. //_121
. use survey6, clear
{txt}(Survey of graduate students)

{com}. //_122
. describe

{txt}Contains data from {res}survey6.dta
{txt}  obs:{res}             8                          Survey of graduate students
{txt} vars:{res}             9                          10 Sep 2023 16:40
{txt} size:{res}           416                          (_dta has notes)
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:mf       }{bind:  }{res}{res}Gender of student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%19.0g    }{space 1}{bind:racelab  }{bind:* }{res}{res}Race of student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%18.0g    }{space 1}{bind:havelab  }{bind:* }{res}{res}Given birth to a child?{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%15.0g    }{space 1}{bind:mfkid    }{bind:* }{res}{res}Sex of child{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%12.2fc   }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%-10s     }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{p 0 48}{bind:kbday          }{txt}{bind: double  }{bind:{txt}%td       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by: 

{com}. //_123
. order id gender race bday income havechild
{txt}
{com}. describe

{txt}Contains data from {res}survey6.dta
{txt}  obs:{res}             8                          Survey of graduate students
{txt} vars:{res}             9                          10 Sep 2023 16:40
{txt} size:{res}           416                          (_dta has notes)
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:mf       }{bind:  }{res}{res}Gender of student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%19.0g    }{space 1}{bind:racelab  }{bind:* }{res}{res}Race of student{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%12.2fc   }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%18.0g    }{space 1}{bind:havelab  }{bind:* }{res}{res}Given birth to a child?{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%15.0g    }{space 1}{bind:mfkid    }{bind:* }{res}{res}Sex of child{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%-10s     }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{p 0 48}{bind:kbday          }{txt}{bind: double  }{bind:{txt}%td       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by: 

{com}. //_124
. order kidname, before(ksex)
{txt}
{com}. describe

{txt}Contains data from {res}survey6.dta
{txt}  obs:{res}             8                          Survey of graduate students
{txt} vars:{res}             9                          10 Sep 2023 16:40
{txt} size:{res}           416                          (_dta has notes)
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:mf       }{bind:  }{res}{res}Gender of student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%19.0g    }{space 1}{bind:racelab  }{bind:* }{res}{res}Race of student{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%12.2fc   }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%18.0g    }{space 1}{bind:havelab  }{bind:* }{res}{res}Given birth to a child?{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%-10s     }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%15.0g    }{space 1}{bind:mfkid    }{bind:* }{res}{res}Sex of child{p_end}
{p 0 48}{bind:kbday          }{txt}{bind: double  }{bind:{txt}%td       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by: 

{com}. //_125
. generate STUDENTVARS = ., before(gender)
{txt}(8 missing values generated)

{com}. generate KIDSVARS = ., after(havechild)
{txt}(8 missing values generated)

{com}. describe

{txt}Contains data from {res}survey6.dta
{txt}  obs:{res}             8                          Survey of graduate students
{txt} vars:{res}            11                          10 Sep 2023 16:40
{txt} size:{res}           544                          (_dta has notes)
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unique identification variable{p_end}
{p 0 48}{bind:STUDENTVARS    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:gender         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:mf       }{bind:  }{res}{res}Gender of student{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%19.0g    }{space 1}{bind:racelab  }{bind:* }{res}{res}Race of student{p_end}
{p 0 48}{bind:bdays          }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Birthday of student{p_end}
{p 0 48}{bind:income         }{txt}{bind: float   }{bind:{txt}%12.2fc   }{space 1}{bind:         }{bind:  }{res}{res}Income of student{p_end}
{p 0 48}{bind:havechild      }{txt}{bind: float   }{bind:{txt}%18.0g    }{space 1}{bind:havelab  }{bind:* }{res}{res}Given birth to a child?{p_end}
{p 0 48}{bind:KIDSVARS       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:kidname        }{txt}{bind: str10   }{bind:{txt}%-10s     }{space 1}{bind:         }{bind:  }{res}{res}Name of child{p_end}
{p 0 48}{bind:ksex           }{txt}{bind: float   }{bind:{txt}%15.0g    }{space 1}{bind:mfkid    }{bind:* }{res}{res}Sex of child{p_end}
{p 0 48}{bind:kbday          }{txt}{bind: double  }{bind:{txt}%td       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
                                            {txt}* indicated variables have notes
{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_126
. use "/Users/Sam/Desktop/Econ 645/Data/CPS/jun23pub.dta", clear
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week3_fd.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}10 Sep 2023, 16:40:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}