{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week9_ldv2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Oct 2023, 16:59:59
{txt}
{com}. //_1
. set more off
{txt}
{com}. clear
{txt}
{com}. //_2
. cd "/Users/Sam/Desktop/Econ 645/Data/Wooldridge"
{res}/Users/Sam/Desktop/Econ 645/Data/Wooldridge
{txt}
{com}. //_3
. use "crime1.dta", clear
{txt}
{com}. //_4
. reg narr86 pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,725
{txt}{hline 13}{c +}{hline 34}   F(9, 2715)      = {res}    23.57
{txt}       Model {c |} {res} 145.702778         9  16.1891976   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1864.64438     2,715  .686793509   {txt}R-squared       ={res}    0.0725
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0694
{txt}       Total {c |} {res} 2010.34716     2,724  .738012906   {txt}Root MSE        =   {res} .82873

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      narr86{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}pcnv {c |}{col 14}{res}{space 2} -.131886{col 26}{space 2} .0404037{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.2111112{col 67}{space 3}-.0526609
{txt}{space 6}avgsen {c |}{col 14}{res}{space 2}-.0113316{col 26}{space 2} .0122413{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-.0353348{col 67}{space 3} .0126717
{txt}{space 5}tottime {c |}{col 14}{res}{space 2} .0120693{col 26}{space 2} .0094364{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4} -.006434{col 67}{space 3} .0305725
{txt}{space 5}ptime86 {c |}{col 14}{res}{space 2}-.0408735{col 26}{space 2}  .008813{col 37}{space 1}   -4.64{col 46}{space 3}0.000{col 54}{space 4}-.0581544{col 67}{space 3}-.0235925
{txt}{space 6}qemp86 {c |}{col 14}{res}{space 2}-.0513099{col 26}{space 2} .0144862{col 37}{space 1}   -3.54{col 46}{space 3}0.000{col 54}{space 4} -.079715{col 67}{space 3}-.0229047
{txt}{space 7}inc86 {c |}{col 14}{res}{space 2}-.0014617{col 26}{space 2}  .000343{col 37}{space 1}   -4.26{col 46}{space 3}0.000{col 54}{space 4}-.0021343{col 67}{space 3}-.0007891
{txt}{space 7}black {c |}{col 14}{res}{space 2} .3270097{col 26}{space 2} .0454264{col 37}{space 1}    7.20{col 46}{space 3}0.000{col 54}{space 4} .2379359{col 67}{space 3} .4160835
{txt}{space 6}hispan {c |}{col 14}{res}{space 2} .1938094{col 26}{space 2} .0397156{col 37}{space 1}    4.88{col 46}{space 3}0.000{col 54}{space 4} .1159335{col 67}{space 3} .2716853
{txt}{space 6}born60 {c |}{col 14}{res}{space 2} -.022465{col 26}{space 2} .0332945{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}-.0877502{col 67}{space 3} .0428202
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .576566{col 26}{space 2} .0378945{col 37}{space 1}   15.22{col 46}{space 3}0.000{col 54}{space 4}  .502261{col 67}{space 3} .6508711
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_5
. poisson narr86 pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-2249.0104}  
Iteration 1:{space 3}log likelihood = {res:-2248.7614}  
Iteration 2:{space 3}log likelihood = {res:-2248.7611}  
Iteration 3:{space 3}log likelihood = {res:-2248.7611}  
{res}
{txt}Poisson regression{col 49}Number of obs{col 67}= {res}     2,725
{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    386.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2248.7611{txt}{col 49}Pseudo R2{col 67}= {res}    0.0791

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      narr86{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}pcnv {c |}{col 14}{res}{space 2}-.4015713{col 26}{space 2} .0849712{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.5681117{col 67}{space 3}-.2350308
{txt}{space 6}avgsen {c |}{col 14}{res}{space 2}-.0237723{col 26}{space 2}  .019946{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-.0628658{col 67}{space 3} .0153212
{txt}{space 5}tottime {c |}{col 14}{res}{space 2} .0244904{col 26}{space 2} .0147504{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0044199{col 67}{space 3} .0534006
{txt}{space 5}ptime86 {c |}{col 14}{res}{space 2}-.0985584{col 26}{space 2} .0206946{col 37}{space 1}   -4.76{col 46}{space 3}0.000{col 54}{space 4}-.1391192{col 67}{space 3}-.0579977
{txt}{space 6}qemp86 {c |}{col 14}{res}{space 2}-.0380187{col 26}{space 2} .0290242{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0949051{col 67}{space 3} .0188677
{txt}{space 7}inc86 {c |}{col 14}{res}{space 2}-.0080807{col 26}{space 2}  .001041{col 37}{space 1}   -7.76{col 46}{space 3}0.000{col 54}{space 4} -.010121{col 67}{space 3}-.0060404
{txt}{space 7}black {c |}{col 14}{res}{space 2} .6608376{col 26}{space 2} .0738342{col 37}{space 1}    8.95{col 46}{space 3}0.000{col 54}{space 4} .5161252{col 67}{space 3}   .80555
{txt}{space 6}hispan {c |}{col 14}{res}{space 2} .4998133{col 26}{space 2} .0739267{col 37}{space 1}    6.76{col 46}{space 3}0.000{col 54}{space 4} .3549196{col 67}{space 3}  .644707
{txt}{space 6}born60 {c |}{col 14}{res}{space 2}-.0510286{col 26}{space 2} .0640518{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.1765678{col 67}{space 3} .0745106
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5995888{col 26}{space 2} .0672501{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4}-.7313966{col 67}{space 3} -.467781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_6
. estat gof

{txt}{col 10}Deviance goodness-of-fit {col 32}= {res} 2822.185
{txt}{col 10}Prob > chi2({res}2715{txt}){col 35}=    {res}0.0742

{txt}{col 10}Pearson goodness-of-fit  {col 32}= {res}  4118.08
{txt}{col 10}Prob > chi2({res}2715{txt}){col 35}=    {res}0.0000
{txt}
{com}. //_7
. display (exp(-.402*.01)-1)*100
{res}-.40119306
{txt}
{com}. //_8
. display (exp(0.6608)-1)*100 
{res}93.634079
{txt}
{com}. //_9
. listcoef, help

{txt}poisson (N={res}2725{txt}): Factor Change in Expected Count 

 Observed SD: {res}.85907678

{txt}------------------------------------------------------------------
  narr86 |      b         z     P>|z|    e^b    e^bStdX      SDofX
---------+--------------------------------------------------------
    pcnv |{res}  -0.40157   -4.726   0.000   0.6693   0.8533     0.3952
  {txt}avgsen |{res}  -0.02377   -1.192   0.233   0.9765   0.9200     3.5080
 {txt}tottime |{res}   0.02449    1.660   0.097   1.0248   1.1194     4.6070
 {txt}ptime86 |{res}  -0.09856   -4.763   0.000   0.9061   0.8251     1.9501
  {txt}qemp86 |{res}  -0.03802   -1.310   0.190   0.9627   0.9406     1.6104
   {txt}inc86 |{res}  -0.00808   -7.762   0.000   0.9920   0.5837    66.6272
   {txt}black |{res}   0.66084    8.950   0.000   1.9364   1.2750     0.3677
  {txt}hispan |{res}   0.49981    6.761   0.000   1.6484   1.2291     0.4127
  {txt}born60 |{res}  -0.05103   -0.797   0.426   0.9503   0.9758     0.4808
{txt}------------------------------------------------------------------
       b = raw coefficient
       z = z-score for test of b=0
   P>|z| = p-value for z-test
     e^b = exp(b) = factor change in expected count for unit increase in X
 e^bStdX = exp(b*SD of X) = change in expected count for SD increase in X
   SDofX = standard deviation of X

{com}. listcoef, percent help

{txt}poisson (N={res}2725{txt}): Percentage Change in Expected Count 

 Observed SD: {res}.85907678

{txt}------------------------------------------------------------------
  narr86 |      b         z     P>|z|      %      %StdX      SDofX
---------+--------------------------------------------------------
    pcnv |{res}  -0.40157   -4.726   0.000    -33.1    -14.7     0.3952
  {txt}avgsen |{res}  -0.02377   -1.192   0.233     -2.3     -8.0     3.5080
 {txt}tottime |{res}   0.02449    1.660   0.097      2.5     11.9     4.6070
 {txt}ptime86 |{res}  -0.09856   -4.763   0.000     -9.4    -17.5     1.9501
  {txt}qemp86 |{res}  -0.03802   -1.310   0.190     -3.7     -5.9     1.6104
   {txt}inc86 |{res}  -0.00808   -7.762   0.000     -0.8    -41.6    66.6272
   {txt}black |{res}   0.66084    8.950   0.000     93.6     27.5     0.3677
  {txt}hispan |{res}   0.49981    6.761   0.000     64.8     22.9     0.4127
  {txt}born60 |{res}  -0.05103   -0.797   0.426     -5.0     -2.4     0.4808
{txt}------------------------------------------------------------------
       b = raw coefficient
       z = z-score for test of b=0
   P>|z| = p-value for z-test
       % = percent change in expected count for unit increase in X
   %StdX = percent change in expected count for SD increase in X
   SDofX = standard deviation of X

{com}. //_10
. margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     2,725
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Predicted number of events, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}pcnv {c |}{col 14}{res}{space 2}-.1623969{col 26}{space 2} .0347091{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-.2304256{col 67}{space 3}-.0943682
{txt}{space 6}avgsen {c |}{col 14}{res}{space 2}-.0096136{col 26}{space 2} .0080714{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0254333{col 67}{space 3} .0062061
{txt}{space 5}tottime {c |}{col 14}{res}{space 2}  .009904{col 26}{space 2} .0059726{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4} -.001802{col 67}{space 3}   .02161
{txt}{space 5}ptime86 {c |}{col 14}{res}{space 2}-.0398574{col 26}{space 2} .0084547{col 37}{space 1}   -4.71{col 46}{space 3}0.000{col 54}{space 4}-.0564283{col 67}{space 3}-.0232865
{txt}{space 6}qemp86 {c |}{col 14}{res}{space 2}-.0153749{col 26}{space 2} .0117466{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-.0383979{col 67}{space 3} .0076481
{txt}{space 7}inc86 {c |}{col 14}{res}{space 2}-.0032679{col 26}{space 2} .0004323{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-.0041152{col 67}{space 3}-.0024205
{txt}{space 7}black {c |}{col 14}{res}{space 2} .2672451{col 26}{space 2} .0309251{col 37}{space 1}    8.64{col 46}{space 3}0.000{col 54}{space 4} .2066331{col 67}{space 3} .3278571
{txt}{space 6}hispan {c |}{col 14}{res}{space 2} .2021263{col 26}{space 2}   .03051{col 37}{space 1}    6.62{col 46}{space 3}0.000{col 54}{space 4} .1423279{col 67}{space 3} .2619248
{txt}{space 6}born60 {c |}{col 14}{res}{space 2}-.0206361{col 26}{space 2} .0259102{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.0714193{col 67}{space 3}  .030147
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_11
. est clear
{txt}
{com}. //_12
. eststo PRM: poisson narr86 pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-2249.0104}  
Iteration 1:{space 3}log likelihood = {res:-2248.7614}  
Iteration 2:{space 3}log likelihood = {res:-2248.7611}  
Iteration 3:{space 3}log likelihood = {res:-2248.7611}  
{res}
{txt}Poisson regression{col 49}Number of obs{col 67}= {res}     2,725
{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    386.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2248.7611{txt}{col 49}Pseudo R2{col 67}= {res}    0.0791

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      narr86{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}pcnv {c |}{col 14}{res}{space 2}-.4015713{col 26}{space 2} .0849712{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.5681117{col 67}{space 3}-.2350308
{txt}{space 6}avgsen {c |}{col 14}{res}{space 2}-.0237723{col 26}{space 2}  .019946{col 37}{space 1}   -1.19{col 46}{space 3}0.233{col 54}{space 4}-.0628658{col 67}{space 3} .0153212
{txt}{space 5}tottime {c |}{col 14}{res}{space 2} .0244904{col 26}{space 2} .0147504{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0044199{col 67}{space 3} .0534006
{txt}{space 5}ptime86 {c |}{col 14}{res}{space 2}-.0985584{col 26}{space 2} .0206946{col 37}{space 1}   -4.76{col 46}{space 3}0.000{col 54}{space 4}-.1391192{col 67}{space 3}-.0579977
{txt}{space 6}qemp86 {c |}{col 14}{res}{space 2}-.0380187{col 26}{space 2} .0290242{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0949051{col 67}{space 3} .0188677
{txt}{space 7}inc86 {c |}{col 14}{res}{space 2}-.0080807{col 26}{space 2}  .001041{col 37}{space 1}   -7.76{col 46}{space 3}0.000{col 54}{space 4} -.010121{col 67}{space 3}-.0060404
{txt}{space 7}black {c |}{col 14}{res}{space 2} .6608376{col 26}{space 2} .0738342{col 37}{space 1}    8.95{col 46}{space 3}0.000{col 54}{space 4} .5161252{col 67}{space 3}   .80555
{txt}{space 6}hispan {c |}{col 14}{res}{space 2} .4998133{col 26}{space 2} .0739267{col 37}{space 1}    6.76{col 46}{space 3}0.000{col 54}{space 4} .3549196{col 67}{space 3}  .644707
{txt}{space 6}born60 {c |}{col 14}{res}{space 2}-.0510286{col 26}{space 2} .0640518{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.1765678{col 67}{space 3} .0745106
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5995888{col 26}{space 2} .0672501{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4}-.7313966{col 67}{space 3} -.467781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_13
. eststo NBRM: nbreg narr86 pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60 

{txt}Fitting Poisson model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-2249.0104}  
Iteration 1:{space 3}log likelihood = {res:-2248.7614}  
Iteration 2:{space 3}log likelihood = {res:-2248.7611}  
Iteration 3:{space 3}log likelihood = {res:-2248.7611}  
{res}
{txt}Fitting constant-only model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-2297.3847}  
Iteration 1:{space 3}log likelihood = {res:-2291.4767}  
Iteration 2:{space 3}log likelihood = {res:-2290.6926}  
Iteration 3:{space 3}log likelihood = {res:-2290.6903}  
Iteration 4:{space 3}log likelihood = {res:-2290.6903}  
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-2181.2355}  
Iteration 1:{space 3}log likelihood = {res:-2158.2716}  
Iteration 2:{space 3}log likelihood = {res:-2157.6284}  
Iteration 3:{space 3}log likelihood = {res: -2157.628}  
Iteration 4:{space 3}log likelihood = {res: -2157.628}  
{res}
{txt}Negative binomial regression{col 49}Number of obs{col 67}= {res}     2,725
{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    266.12
{txt}{col 1}Dispersion{col 16}= {res}mean{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -2157.628{txt}{col 49}Pseudo R2{col 67}= {res}    0.0581

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      narr86{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}pcnv {c |}{col 14}{res}{space 2}-.4770963{col 26}{space 2} .1033295{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-.6796183{col 67}{space 3}-.2745743
{txt}{space 6}avgsen {c |}{col 14}{res}{space 2}-.0173385{col 26}{space 2} .0261171{col 37}{space 1}   -0.66{col 46}{space 3}0.507{col 54}{space 4}-.0685272{col 67}{space 3} .0338501
{txt}{space 5}tottime {c |}{col 14}{res}{space 2} .0197394{col 26}{space 2} .0192325{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-.0179557{col 67}{space 3} .0574344
{txt}{space 5}ptime86 {c |}{col 14}{res}{space 2}-.1073997{col 26}{space 2}  .025074{col 37}{space 1}   -4.28{col 46}{space 3}0.000{col 54}{space 4}-.1565439{col 67}{space 3}-.0582555
{txt}{space 6}qemp86 {c |}{col 14}{res}{space 2}-.0504884{col 26}{space 2} .0351857{col 37}{space 1}   -1.43{col 46}{space 3}0.151{col 54}{space 4}-.1194511{col 67}{space 3} .0184743
{txt}{space 7}inc86 {c |}{col 14}{res}{space 2}-.0077126{col 26}{space 2} .0011465{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0099596{col 67}{space 3}-.0054656
{txt}{space 7}black {c |}{col 14}{res}{space 2} .6560406{col 26}{space 2} .0923594{col 37}{space 1}    7.10{col 46}{space 3}0.000{col 54}{space 4} .4750195{col 67}{space 3} .8370617
{txt}{space 6}hispan {c |}{col 14}{res}{space 2} .5048465{col 26}{space 2} .0895663{col 37}{space 1}    5.64{col 46}{space 3}0.000{col 54}{space 4} .3292998{col 67}{space 3} .6803932
{txt}{space 6}born60 {c |}{col 14}{res}{space 2} -.046412{col 26}{space 2} .0776384{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-.1985804{col 67}{space 3} .1057564
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5637368{col 26}{space 2} .0827121{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.7258495{col 67}{space 3}-.4016242
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnalpha {c |}{col 14}{res}{space 2}-.0738912{col 26}{space 2} .1177617{col 54}{space 4}-.3046999{col 67}{space 3} .1569175
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       alpha {c |}{col 14}{res}{space 2} .9287728{col 26}{space 2} .1093739{col 54}{space 4} .7373446{col 67}{space 3} 1.169899
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of alpha=0: {help j_chibar##|_new:chibar2(01) = }{res}182.27{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. //_14
. listcoef, percent help

{txt}nbreg (N={res}2725{txt}): Percentage Change in Expected Count 

 Observed SD: {res}.85907678

{txt}------------------------------------------------------------------
  narr86 |      b         z     P>|z|      %      %StdX      SDofX
---------+--------------------------------------------------------
    pcnv |{res}  -0.47710   -4.617   0.000    -37.9    -17.2     0.3952
  {txt}avgsen |{res}  -0.01734   -0.664   0.507     -1.7     -5.9     3.5080
 {txt}tottime |{res}   0.01974    1.026   0.305      2.0      9.5     4.6070
 {txt}ptime86 |{res}  -0.10740   -4.283   0.000    -10.2    -18.9     1.9501
  {txt}qemp86 |{res}  -0.05049   -1.435   0.151     -4.9     -7.8     1.6104
   {txt}inc86 |{res}  -0.00771   -6.727   0.000     -0.8    -40.2    66.6272
   {txt}black |{res}   0.65604    7.103   0.000     92.7     27.3     0.3677
  {txt}hispan |{res}   0.50485    5.637   0.000     65.7     23.2     0.4127
  {txt}born60 |{res}  -0.04641   -0.598   0.550     -4.5     -2.2     0.4808
{txt}---------+--------------------------------------------------------
ln alpha |{res}  -0.07389   -0.627
{txt}------------------------------------------------------------------
       b = raw coefficient
       z = z-score for test of b=0
   P>|z| = p-value for z-test
       % = percent change in expected count for unit increase in X
   %StdX = percent change in expected count for SD increase in X
   SDofX = standard deviation of X

{com}. listcoef, help

{txt}nbreg (N={res}2725{txt}): Factor Change in Expected Count 

 Observed SD: {res}.85907678

{txt}------------------------------------------------------------------
  narr86 |      b         z     P>|z|    e^b    e^bStdX      SDofX
---------+--------------------------------------------------------
    pcnv |{res}  -0.47710   -4.617   0.000   0.6206   0.8282     0.3952
  {txt}avgsen |{res}  -0.01734   -0.664   0.507   0.9828   0.9410     3.5080
 {txt}tottime |{res}   0.01974    1.026   0.305   1.0199   1.0952     4.6070
 {txt}ptime86 |{res}  -0.10740   -4.283   0.000   0.8982   0.8110     1.9501
  {txt}qemp86 |{res}  -0.05049   -1.435   0.151   0.9508   0.9219     1.6104
   {txt}inc86 |{res}  -0.00771   -6.727   0.000   0.9923   0.5982    66.6272
   {txt}black |{res}   0.65604    7.103   0.000   1.9271   1.2728     0.3677
  {txt}hispan |{res}   0.50485    5.637   0.000   1.6567   1.2316     0.4127
  {txt}born60 |{res}  -0.04641   -0.598   0.550   0.9546   0.9779     0.4808
{txt}---------+--------------------------------------------------------
ln alpha |{res}  -0.07389   -0.627
{txt}------------------------------------------------------------------
       b = raw coefficient
       z = z-score for test of b=0
   P>|z| = p-value for z-test
     e^b = exp(b) = factor change in expected count for unit increase in X
 e^bStdX = exp(b*SD of X) = change in expected count for SD increase in X
   SDofX = standard deviation of X

{com}. //_15
. display exp(-.4771*.1)-1
{res}-.04658976
{txt}
{com}. //_16
. display (exp(0.01974)-1)
{res}.01993612
{txt}
{com}. //_17
. esttab, mtitle
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      PRM            NBRM   
{txt}{hline 44}
{res}narr86                                      {txt}
{txt}pcnv        {res}       -0.402***       -0.477***{txt}
            {res} {ralign 12:{txt:(}-4.73{txt:)}}    {ralign 12:{txt:(}-4.62{txt:)}}   {txt}

{txt}avgsen      {res}      -0.0238         -0.0173   {txt}
            {res} {ralign 12:{txt:(}-1.19{txt:)}}    {ralign 12:{txt:(}-0.66{txt:)}}   {txt}

{txt}tottime     {res}       0.0245          0.0197   {txt}
            {res} {ralign 12:{txt:(}1.66{txt:)}}    {ralign 12:{txt:(}1.03{txt:)}}   {txt}

{txt}ptime86     {res}      -0.0986***       -0.107***{txt}
            {res} {ralign 12:{txt:(}-4.76{txt:)}}    {ralign 12:{txt:(}-4.28{txt:)}}   {txt}

{txt}qemp86      {res}      -0.0380         -0.0505   {txt}
            {res} {ralign 12:{txt:(}-1.31{txt:)}}    {ralign 12:{txt:(}-1.43{txt:)}}   {txt}

{txt}inc86       {res}     -0.00808***     -0.00771***{txt}
            {res} {ralign 12:{txt:(}-7.76{txt:)}}    {ralign 12:{txt:(}-6.73{txt:)}}   {txt}

{txt}black       {res}        0.661***        0.656***{txt}
            {res} {ralign 12:{txt:(}8.95{txt:)}}    {ralign 12:{txt:(}7.10{txt:)}}   {txt}

{txt}hispan      {res}        0.500***        0.505***{txt}
            {res} {ralign 12:{txt:(}6.76{txt:)}}    {ralign 12:{txt:(}5.64{txt:)}}   {txt}

{txt}born60      {res}      -0.0510         -0.0464   {txt}
            {res} {ralign 12:{txt:(}-0.80{txt:)}}    {ralign 12:{txt:(}-0.60{txt:)}}   {txt}

{txt}_cons       {res}       -0.600***       -0.564***{txt}
            {res} {ralign 12:{txt:(}-8.92{txt:)}}    {ralign 12:{txt:(}-6.82{txt:)}}   {txt}
{hline 44}
{res}lnalpha                                     {txt}
{txt}_cons       {res}                      -0.0739   {txt}
            {res}                 {ralign 12:{txt:(}-0.63{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}         2725            2725   {txt}
{txt}{hline 44}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_18
. margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     2,725
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Predicted number of events, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:pcnv avgsen tottime ptime86 qemp86 inc86 black hispan born60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}pcnv {c |}{col 14}{res}{space 2}-.1933482{col 26}{space 2} .0429858{col 37}{space 1}   -4.50{col 46}{space 3}0.000{col 54}{space 4}-.2775988{col 67}{space 3}-.1090976
{txt}{space 6}avgsen {c |}{col 14}{res}{space 2}-.0070266{col 26}{space 2}  .010587{col 37}{space 1}   -0.66{col 46}{space 3}0.507{col 54}{space 4}-.0277767{col 67}{space 3} .0137235
{txt}{space 5}tottime {c |}{col 14}{res}{space 2} .0079996{col 26}{space 2} .0078006{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-.0072894{col 67}{space 3} .0232886
{txt}{space 5}ptime86 {c |}{col 14}{res}{space 2}-.0435248{col 26}{space 2} .0103794{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0638682{col 67}{space 3}-.0231815
{txt}{space 6}qemp86 {c |}{col 14}{res}{space 2}-.0204609{col 26}{space 2} .0143136{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-.0485151{col 67}{space 3} .0075932
{txt}{space 7}inc86 {c |}{col 14}{res}{space 2}-.0031256{col 26}{space 2} .0004821{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0040705{col 67}{space 3}-.0021807
{txt}{space 7}black {c |}{col 14}{res}{space 2} .2658672{col 26}{space 2} .0395274{col 37}{space 1}    6.73{col 46}{space 3}0.000{col 54}{space 4} .1883949{col 67}{space 3} .3433395
{txt}{space 6}hispan {c |}{col 14}{res}{space 2} .2045942{col 26}{space 2} .0375363{col 37}{space 1}    5.45{col 46}{space 3}0.000{col 54}{space 4} .1310244{col 67}{space 3} .2781641
{txt}{space 6}born60 {c |}{col 14}{res}{space 2}-.0188089{col 26}{space 2} .0314753{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-.0804994{col 67}{space 3} .0428815
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_19
. use recid.dta, clear
{txt}
{com}. //_20
. tab durat

      {txt}durat {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}          8        0.55        0.55
{txt}          2 {c |}{res}         15        1.04        1.59
{txt}          3 {c |}{res}         14        0.97        2.56
{txt}          4 {c |}{res}         13        0.90        3.46
{txt}          5 {c |}{res}         16        1.11        4.57
{txt}          6 {c |}{res}         18        1.25        5.81
{txt}          7 {c |}{res}         18        1.25        7.06
{txt}          8 {c |}{res}         16        1.11        8.17
{txt}          9 {c |}{res}         18        1.25        9.41
{txt}         10 {c |}{res}         22        1.52       10.93
{txt}         11 {c |}{res}         11        0.76       11.70
{txt}         12 {c |}{res}         14        0.97       12.66
{txt}         13 {c |}{res}         15        1.04       13.70
{txt}         14 {c |}{res}         16        1.11       14.81
{txt}         15 {c |}{res}         23        1.59       16.40
{txt}         16 {c |}{res}         11        0.76       17.16
{txt}         17 {c |}{res}          9        0.62       17.79
{txt}         18 {c |}{res}         16        1.11       18.89
{txt}         19 {c |}{res}          9        0.62       19.52
{txt}         20 {c |}{res}          8        0.55       20.07
{txt}         21 {c |}{res}         13        0.90       20.97
{txt}         22 {c |}{res}          7        0.48       21.45
{txt}         23 {c |}{res}         16        1.11       22.56
{txt}         24 {c |}{res}         12        0.83       23.39
{txt}         25 {c |}{res}         13        0.90       24.29
{txt}         26 {c |}{res}          8        0.55       24.84
{txt}         27 {c |}{res}         11        0.76       25.61
{txt}         28 {c |}{res}          9        0.62       26.23
{txt}         29 {c |}{res}          8        0.55       26.78
{txt}         30 {c |}{res}          7        0.48       27.27
{txt}         31 {c |}{res}          6        0.42       27.68
{txt}         32 {c |}{res}          6        0.42       28.10
{txt}         33 {c |}{res}          6        0.42       28.51
{txt}         34 {c |}{res}          4        0.28       28.79
{txt}         35 {c |}{res}          5        0.35       29.13
{txt}         36 {c |}{res}          6        0.42       29.55
{txt}         37 {c |}{res}          6        0.42       29.97
{txt}         38 {c |}{res}          4        0.28       30.24
{txt}         39 {c |}{res}          4        0.28       30.52
{txt}         40 {c |}{res}          2        0.14       30.66
{txt}         41 {c |}{res}          7        0.48       31.14
{txt}         42 {c |}{res}          5        0.35       31.49
{txt}         43 {c |}{res}          5        0.35       31.83
{txt}         44 {c |}{res}          4        0.28       32.11
{txt}         45 {c |}{res}          4        0.28       32.39
{txt}         46 {c |}{res}          7        0.48       32.87
{txt}         47 {c |}{res}          4        0.28       33.15
{txt}         48 {c |}{res}          1        0.07       33.22
{txt}         49 {c |}{res}          4        0.28       33.49
{txt}         50 {c |}{res}          5        0.35       33.84
{txt}         51 {c |}{res}          2        0.14       33.98
{txt}         52 {c |}{res}          2        0.14       34.12
{txt}         53 {c |}{res}          8        0.55       34.67
{txt}         54 {c |}{res}          3        0.21       34.88
{txt}         55 {c |}{res}          5        0.35       35.22
{txt}         56 {c |}{res}          2        0.14       35.36
{txt}         57 {c |}{res}          4        0.28       35.64
{txt}         58 {c |}{res}          1        0.07       35.71
{txt}         59 {c |}{res}          5        0.35       36.06
{txt}         60 {c |}{res}          3        0.21       36.26
{txt}         62 {c |}{res}          3        0.21       36.47
{txt}         63 {c |}{res}          2        0.14       36.61
{txt}         64 {c |}{res}          1        0.07       36.68
{txt}         65 {c |}{res}          2        0.14       36.82
{txt}         66 {c |}{res}          3        0.21       37.02
{txt}         67 {c |}{res}          3        0.21       37.23
{txt}         68 {c |}{res}          4        0.28       37.51
{txt}         69 {c |}{res}          2        0.14       37.65
{txt}         70 {c |}{res}        105        7.27       44.91
{txt}         71 {c |}{res}         90        6.23       51.14
{txt}         72 {c |}{res}         85        5.88       57.02
{txt}         73 {c |}{res}        108        7.47       64.50
{txt}         74 {c |}{res}         72        4.98       69.48
{txt}         75 {c |}{res}         44        3.04       72.53
{txt}         76 {c |}{res}        105        7.27       79.79
{txt}         77 {c |}{res}         61        4.22       84.01
{txt}         78 {c |}{res}         54        3.74       87.75
{txt}         79 {c |}{res}         60        4.15       91.90
{txt}         80 {c |}{res}         69        4.78       96.68
{txt}         81 {c |}{res}         48        3.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,445      100.00
{txt}
{com}. //_21
. tab durat cens

           {txt}{c |}         cens
     durat {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}         8          0 {txt}{c |}{res}         8 
{txt}         2 {c |}{res}        15          0 {txt}{c |}{res}        15 
{txt}         3 {c |}{res}        14          0 {txt}{c |}{res}        14 
{txt}         4 {c |}{res}        13          0 {txt}{c |}{res}        13 
{txt}         5 {c |}{res}        16          0 {txt}{c |}{res}        16 
{txt}         6 {c |}{res}        18          0 {txt}{c |}{res}        18 
{txt}         7 {c |}{res}        18          0 {txt}{c |}{res}        18 
{txt}         8 {c |}{res}        16          0 {txt}{c |}{res}        16 
{txt}         9 {c |}{res}        18          0 {txt}{c |}{res}        18 
{txt}        10 {c |}{res}        22          0 {txt}{c |}{res}        22 
{txt}        11 {c |}{res}        11          0 {txt}{c |}{res}        11 
{txt}        12 {c |}{res}        14          0 {txt}{c |}{res}        14 
{txt}        13 {c |}{res}        15          0 {txt}{c |}{res}        15 
{txt}        14 {c |}{res}        16          0 {txt}{c |}{res}        16 
{txt}        15 {c |}{res}        23          0 {txt}{c |}{res}        23 
{txt}        16 {c |}{res}        11          0 {txt}{c |}{res}        11 
{txt}        17 {c |}{res}         9          0 {txt}{c |}{res}         9 
{txt}        18 {c |}{res}        16          0 {txt}{c |}{res}        16 
{txt}        19 {c |}{res}         9          0 {txt}{c |}{res}         9 
{txt}        20 {c |}{res}         8          0 {txt}{c |}{res}         8 
{txt}        21 {c |}{res}        13          0 {txt}{c |}{res}        13 
{txt}        22 {c |}{res}         7          0 {txt}{c |}{res}         7 
{txt}        23 {c |}{res}        16          0 {txt}{c |}{res}        16 
{txt}        24 {c |}{res}        12          0 {txt}{c |}{res}        12 
{txt}        25 {c |}{res}        13          0 {txt}{c |}{res}        13 
{txt}        26 {c |}{res}         8          0 {txt}{c |}{res}         8 
{txt}        27 {c |}{res}        11          0 {txt}{c |}{res}        11 
{txt}        28 {c |}{res}         9          0 {txt}{c |}{res}         9 
{txt}        29 {c |}{res}         8          0 {txt}{c |}{res}         8 
{txt}        30 {c |}{res}         7          0 {txt}{c |}{res}         7 
{txt}        31 {c |}{res}         6          0 {txt}{c |}{res}         6 
{txt}        32 {c |}{res}         6          0 {txt}{c |}{res}         6 
{txt}        33 {c |}{res}         6          0 {txt}{c |}{res}         6 
{txt}        34 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        35 {c |}{res}         5          0 {txt}{c |}{res}         5 
{txt}        36 {c |}{res}         6          0 {txt}{c |}{res}         6 
{txt}        37 {c |}{res}         6          0 {txt}{c |}{res}         6 
{txt}        38 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        39 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        40 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        41 {c |}{res}         7          0 {txt}{c |}{res}         7 
{txt}        42 {c |}{res}         5          0 {txt}{c |}{res}         5 
{txt}        43 {c |}{res}         5          0 {txt}{c |}{res}         5 
{txt}        44 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        45 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        46 {c |}{res}         7          0 {txt}{c |}{res}         7 
{txt}        47 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        48 {c |}{res}         1          0 {txt}{c |}{res}         1 
{txt}        49 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        50 {c |}{res}         5          0 {txt}{c |}{res}         5 
{txt}        51 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        52 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        53 {c |}{res}         8          0 {txt}{c |}{res}         8 
{txt}        54 {c |}{res}         3          0 {txt}{c |}{res}         3 
{txt}        55 {c |}{res}         5          0 {txt}{c |}{res}         5 
{txt}        56 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        57 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        58 {c |}{res}         1          0 {txt}{c |}{res}         1 
{txt}        59 {c |}{res}         5          0 {txt}{c |}{res}         5 
{txt}        60 {c |}{res}         3          0 {txt}{c |}{res}         3 
{txt}        62 {c |}{res}         3          0 {txt}{c |}{res}         3 
{txt}        63 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        64 {c |}{res}         1          0 {txt}{c |}{res}         1 
{txt}        65 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        66 {c |}{res}         3          0 {txt}{c |}{res}         3 
{txt}        67 {c |}{res}         3          0 {txt}{c |}{res}         3 
{txt}        68 {c |}{res}         4          0 {txt}{c |}{res}         4 
{txt}        69 {c |}{res}         2          0 {txt}{c |}{res}         2 
{txt}        70 {c |}{res}         2        103 {txt}{c |}{res}       105 
{txt}        71 {c |}{res}         2         88 {txt}{c |}{res}        90 
{txt}        72 {c |}{res}         1         84 {txt}{c |}{res}        85 
{txt}        73 {c |}{res}         1        107 {txt}{c |}{res}       108 
{txt}        74 {c |}{res}         1         71 {txt}{c |}{res}        72 
{txt}        75 {c |}{res}         0         44 {txt}{c |}{res}        44 
{txt}        76 {c |}{res}         0        105 {txt}{c |}{res}       105 
{txt}        77 {c |}{res}         1         60 {txt}{c |}{res}        61 
{txt}        78 {c |}{res}         0         54 {txt}{c |}{res}        54 
{txt}        79 {c |}{res}         0         60 {txt}{c |}{res}        60 
{txt}        80 {c |}{res}         0         69 {txt}{c |}{res}        69 
{txt}        81 {c |}{res}         0         48 {txt}{c |}{res}        48 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       552        893 {txt}{c |}{res}     1,445 

{txt}
{com}. //_22
. stset ldurat, failure(cens==0)

     {txt}failure event:  {res}cens == 0
{txt}obs. time interval:  {res}(0, ldurat]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}       1445{txt}  total observations
{res}          8{txt}  observations end on or before enter()
{hline 78}
{res}       1437{txt}  observations remaining, representing
{res}        544{txt}  failures in single-record/single-failure data
{res}   5411.742{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 4.394449
{txt}
{com}. //_23
. streg workprg priors tserved felon alcohol drugs black married educ age, dist(weibull) nohr

         {txt}failure _d:  {res}cens == 0
   {txt}analysis time _t:  {res}ldurat

{txt}Fitting constant-only model:

Iteration 0:   log likelihood = {res}-1254.5107
{txt}Iteration 1:   log likelihood = {res}-1100.1536
{txt}Iteration 2:   log likelihood = {res}-1079.1128
{txt}Iteration 3:   log likelihood = {res}-1078.7957
{txt}Iteration 4:   log likelihood = {res}-1078.7957

{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-1078.7957}  
Iteration 1:{space 3}log likelihood = {res:-1034.1821}  
Iteration 2:{space 3}log likelihood = {res:-1001.9186}  
Iteration 3:{space 3}log likelihood = {res:-1000.5996}  
Iteration 4:{space 3}log likelihood = {res:-1000.5919}  
Iteration 5:{space 3}log likelihood = {res:-1000.5919}  
{res}
{txt}Weibull regression -- log relative-hazard form 

No. of subjects = {res}       1,437                  {txt}Number of obs    =  {res}     1,437
{txt}No. of failures = {res}         544
{txt}Time at risk    = {res} 5411.742317
                                                {txt}LR chi2({res}10{txt})      =  {res}    156.41
{txt}Log likelihood  =   {res}-1000.5919                  {txt}Prob > chi2      =  {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}workprg {c |}{col 14}{res}{space 2} .0780722{col 26}{space 2}  .091463{col 37}{space 1}    0.85{col 46}{space 3}0.393{col 54}{space 4}-.1011921{col 67}{space 3} .2573364
{txt}{space 6}priors {c |}{col 14}{res}{space 2} .0834203{col 26}{space 2} .0139155{col 37}{space 1}    5.99{col 46}{space 3}0.000{col 54}{space 4} .0561465{col 67}{space 3} .1106941
{txt}{space 5}tserved {c |}{col 14}{res}{space 2} .0134545{col 26}{space 2} .0016851{col 37}{space 1}    7.98{col 46}{space 3}0.000{col 54}{space 4} .0101519{col 67}{space 3} .0167572
{txt}{space 7}felon {c |}{col 14}{res}{space 2} -.287139{col 26}{space 2}  .106697{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.4962614{col 67}{space 3}-.0780167
{txt}{space 5}alcohol {c |}{col 14}{res}{space 2} .4399456{col 26}{space 2}   .10658{col 37}{space 1}    4.13{col 46}{space 3}0.000{col 54}{space 4} .2310527{col 67}{space 3} .6488385
{txt}{space 7}drugs {c |}{col 14}{res}{space 2} .2920932{col 26}{space 2} .0983695{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} .0992926{col 67}{space 3} .4848938
{txt}{space 7}black {c |}{col 14}{res}{space 2} .4515388{col 26}{space 2} .0889883{col 37}{space 1}    5.07{col 46}{space 3}0.000{col 54}{space 4} .2771249{col 67}{space 3} .6259527
{txt}{space 5}married {c |}{col 14}{res}{space 2} -.146192{col 26}{space 2} .1098131{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-.3614216{col 67}{space 3} .0690377
{txt}{space 8}educ {c |}{col 14}{res}{space 2} -.023948{col 26}{space 2}  .019578{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-.0623202{col 67}{space 3} .0144241
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0036431{col 26}{space 2} .0005284{col 37}{space 1}   -6.89{col 46}{space 3}0.000{col 54}{space 4}-.0046788{col 67}{space 3}-.0026073
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.639277{col 26}{space 2} .3077568{col 37}{space 1}  -11.83{col 46}{space 3}0.000{col 54}{space 4} -4.24247{col 67}{space 3}-3.036085
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       /ln_p {c |}{col 14}{res}{space 2} .9214587{col 26}{space 2} .0396737{col 37}{space 1}   23.23{col 46}{space 3}0.000{col 54}{space 4} .8436997{col 67}{space 3} .9992178
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           p {c |}{col 14}{res}{space 2} 2.512953{col 26}{space 2} .0996982{col 54}{space 4} 2.324953{col 67}{space 3} 2.716156
{txt}         1/p {c |}{col 14}{res}{space 2} .3979381{col 26}{space 2} .0157877{col 54}{space 4} .3681673{col 67}{space 3} .4301163
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_24
. display (exp(.0780722)-1)*100
{res}8.1200719
{txt}
{com}. //_25
. display (exp(-.287139)-1)*100
{res}-24.959259
{txt}
{com}. //_26
. use mroz.dta, clear
{txt}
{com}. //_27
. est clear
{txt}
{com}. //_28
. eststo OLS: reg lwage educ exper expersq 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       428
{txt}{hline 13}{c +}{hline 34}   F(3, 424)       = {res}    26.29
{txt}       Model {c |} {res} 35.0222967         3  11.6740989   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 188.305144       424  .444115906   {txt}R-squared       ={res}    0.1568
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1509
{txt}       Total {c |} {res} 223.327441       427  .523015084   {txt}Root MSE        =   {res} .66642

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .1074896{col 26}{space 2} .0141465{col 37}{space 1}    7.60{col 46}{space 3}0.000{col 54}{space 4} .0796837{col 67}{space 3} .1352956
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0415665{col 26}{space 2} .0131752{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .0156697{col 67}{space 3} .0674633
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0008112{col 26}{space 2} .0003932{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-.0015841{col 67}{space 3}-.0000382
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5220406{col 26}{space 2} .1986321{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.9124667{col 67}{space 3}-.1316144
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_29
. eststo Heckman: heckman lwage educ exper expersq, select(inlf=nwifeinc educ exper expersq age kidslt6 kidsge6) twostep 
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}       753
{txt}(regression model with sample selection)        Censored obs      = {res}       325
                                                {txt}Uncensored obs    = {res}       428

                                                {txt}Wald chi2({res}3{txt})      =  {res}    51.53
                                                {txt}Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}lwage        {txt}{c |}
{space 8}educ {c |}{col 14}{res}{space 2} .1090655{col 26}{space 2}  .015523{col 37}{space 1}    7.03{col 46}{space 3}0.000{col 54}{space 4} .0786411{col 67}{space 3}   .13949
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0438873{col 26}{space 2} .0162611{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0120163{col 67}{space 3} .0757584
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0008591{col 26}{space 2} .0004389{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.0017194{col 67}{space 3} 1.15e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5781032{col 26}{space 2} .3050062{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-1.175904{col 67}{space 3}  .019698
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}inlf         {txt}{c |}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0120237{col 26}{space 2} .0048398{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0215096{col 67}{space 3}-.0025378
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .1309047{col 26}{space 2} .0252542{col 37}{space 1}    5.18{col 46}{space 3}0.000{col 54}{space 4} .0814074{col 67}{space 3}  .180402
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .1233476{col 26}{space 2} .0187164{col 37}{space 1}    6.59{col 46}{space 3}0.000{col 54}{space 4} .0866641{col 67}{space 3} .1600311
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0018871{col 26}{space 2}    .0006{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4} -.003063{col 67}{space 3}-.0007111
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0528527{col 26}{space 2} .0084772{col 37}{space 1}   -6.23{col 46}{space 3}0.000{col 54}{space 4}-.0694678{col 67}{space 3}-.0362376
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.8683285{col 26}{space 2} .1185223{col 37}{space 1}   -7.33{col 46}{space 3}0.000{col 54}{space 4}-1.100628{col 67}{space 3} -.636029
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}  .036005{col 26}{space 2} .0434768{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 54}{space 4} -.049208{col 67}{space 3} .1212179
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2700768{col 26}{space 2}  .508593{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.7267473{col 67}{space 3} 1.266901
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}mills        {txt}{c |}
{space 6}lambda {c |}{col 14}{res}{space 2} .0322619{col 26}{space 2} .1336246{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4}-.2296376{col 67}{space 3} .2941613
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         rho {c |} {res}   0.04861
       {txt}sigma {c |} {res} .66362875
{txt}{hline 13}{c BT}{hline 64}

{com}. //_30
. esttab, mtitle
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS         Heckman   
{txt}{hline 44}
{res}main                                        {txt}
{txt}educ        {res}        0.107***        0.109***{txt}
            {res} {ralign 12:{txt:(}7.60{txt:)}}    {ralign 12:{txt:(}7.03{txt:)}}   {txt}

{txt}exper       {res}       0.0416**        0.0439** {txt}
            {res} {ralign 12:{txt:(}3.15{txt:)}}    {ralign 12:{txt:(}2.70{txt:)}}   {txt}

{txt}expersq     {res}    -0.000811*      -0.000859   {txt}
            {res} {ralign 12:{txt:(}-2.06{txt:)}}    {ralign 12:{txt:(}-1.96{txt:)}}   {txt}

{txt}_cons       {res}       -0.522**        -0.578   {txt}
            {res} {ralign 12:{txt:(}-2.63{txt:)}}    {ralign 12:{txt:(}-1.90{txt:)}}   {txt}
{hline 44}
{res}inlf                                        {txt}
{txt}nwifeinc    {res}                      -0.0120*  {txt}
            {res}                 {ralign 12:{txt:(}-2.48{txt:)}}   {txt}

{txt}educ        {res}                        0.131***{txt}
            {res}                 {ralign 12:{txt:(}5.18{txt:)}}   {txt}

{txt}exper       {res}                        0.123***{txt}
            {res}                 {ralign 12:{txt:(}6.59{txt:)}}   {txt}

{txt}expersq     {res}                     -0.00189** {txt}
            {res}                 {ralign 12:{txt:(}-3.15{txt:)}}   {txt}

{txt}age         {res}                      -0.0529***{txt}
            {res}                 {ralign 12:{txt:(}-6.23{txt:)}}   {txt}

{txt}kidslt6     {res}                       -0.868***{txt}
            {res}                 {ralign 12:{txt:(}-7.33{txt:)}}   {txt}

{txt}kidsge6     {res}                       0.0360   {txt}
            {res}                 {ralign 12:{txt:(}0.83{txt:)}}   {txt}

{txt}_cons       {res}                        0.270   {txt}
            {res}                 {ralign 12:{txt:(}0.53{txt:)}}   {txt}
{hline 44}
{res}mills                                       {txt}
{txt}lambda      {res}                       0.0323   {txt}
            {res}                 {ralign 12:{txt:(}0.24{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          428             753   {txt}
{txt}{hline 44}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week9_ldv2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Oct 2023, 17:00:00
{txt}{.-}
{smcl}
{txt}{sf}{ul off}