{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week4_fe_re.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Mar 2024, 19:05:26
{txt}
{com}. //_1
. clear 
{txt}
{com}. set more off
{txt}
{com}. //_2
. cd "/Users/Sam/Desktop/Econ 645/Data/Wooldridge"
{res}/Users/Sam/Desktop/Econ 645/Data/Wooldridge
{txt}
{com}. //_3
. use "wagepan.dta", clear
{txt}
{com}. //_4
. xtset nr year
{res}{txt}{col 8}panel variable:  {res}nr (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1980 to 1987
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. //_5
. eststo OLS: reg lwage c.edu exper expersq i.black i.south i.married i.union i.d8*

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,360
{txt}{hline 13}{c +}{hline 34}   F(14, 4345)     = {res}    73.43
{txt}       Model {c |} {res} 236.577196        14  16.8983712   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 999.952446     4,345  .230138653   {txt}R-squared       ={res}    0.1913
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1887
{txt}       Total {c |} {res} 1236.52964     4,359  .283672779   {txt}Root MSE        =   {res} .47973

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0895815{col 26}{space 2} .0051762{col 37}{space 1}   17.31{col 46}{space 3}0.000{col 54}{space 4} .0794334{col 67}{space 3} .0997295
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0665418{col 26}{space 2} .0136722{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4} .0397372{col 67}{space 3} .0933463
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0023832{col 26}{space 2} .0008183{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.0039875{col 67}{space 3}-.0007789
{txt}{space 5}1.black {c |}{col 14}{res}{space 2}-.1275978{col 26}{space 2} .0236068{col 37}{space 1}   -5.41{col 46}{space 3}0.000{col 54}{space 4}-.1738791{col 67}{space 3}-.0813165
{txt}{space 5}1.south {c |}{col 14}{res}{space 2}-.0529354{col 26}{space 2} .0155534{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.0834281{col 67}{space 3}-.0224428
{txt}{space 3}1.married {c |}{col 14}{res}{space 2} .1122106{col 26}{space 2} .0157149{col 37}{space 1}    7.14{col 46}{space 3}0.000{col 54}{space 4} .0814014{col 67}{space 3} .1430198
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .1802554{col 26}{space 2} .0171339{col 37}{space 1}   10.52{col 46}{space 3}0.000{col 54}{space 4} .1466642{col 67}{space 3} .2138466
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2}  .058693{col 26}{space 2} .0303147{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}-.0007393{col 67}{space 3} .1181253
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2} .0638086{col 26}{space 2} .0331714{col 37}{space 1}    1.92{col 46}{space 3}0.054{col 54}{space 4}-.0012242{col 67}{space 3} .1288414
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .0633355{col 26}{space 2} .0366129{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0084444{col 67}{space 3} .1351153
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0915252{col 26}{space 2} .0400387{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0130289{col 67}{space 3} .1700216
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .1105424{col 26}{space 2} .0432973{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .0256575{col 67}{space 3} .1954272
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .1437822{col 26}{space 2} .0463663{col 37}{space 1}    3.10{col 46}{space 3}0.002{col 54}{space 4} .0528806{col 67}{space 3} .2346837
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .1756699{col 26}{space 2} .0493736{col 37}{space 1}    3.56{col 46}{space 3}0.000{col 54}{space 4} .0788725{col 67}{space 3} .2724673
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1333638{col 26}{space 2} .0774193{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-.0184175{col 67}{space 3}  .285145
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_6
. eststo Within: xtreg lwage c.edu exper expersq i.black i.south i.married i.union i.d8*, fe
{p 0 6 2}{txt}note: educ omitted because of collinearity{p_end}
{p 0 6 2}note: 1.black omitted because of collinearity{p_end}
{p 0 6 2}note: 1.d87 omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     4,360
{txt}Group variable: {res}nr{txt}{col 49}Number of groups{col 67}={col 69}{res}       545

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1815{col 63}{txt}min{col 67}={col 69}{res}         8
{txt}     between = {res}0.0009{col 63}{txt}avg{col 67}={col 69}{res}       8.0
{txt}     overall = {res}0.0497{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}11{txt},{res}3804{txt}){col 67}={col 70}{res}    76.71
{txt}corr(u_i, Xb){col 16}= {res}-0.1739{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}exper {c |}{col 14}{res}{space 2} .1313318{col 26}{space 2} .0098277{col 37}{space 1}   13.36{col 46}{space 3}0.000{col 54}{space 4} .1120638{col 67}{space 3} .1505999
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0051475{col 26}{space 2} .0007043{col 37}{space 1}   -7.31{col 46}{space 3}0.000{col 54}{space 4}-.0065284{col 67}{space 3}-.0037666
{txt}{space 5}1.black {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}1.south {c |}{col 14}{res}{space 2} .1018493{col 26}{space 2} .0479605{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} .0078186{col 67}{space 3}   .19588
{txt}{space 3}1.married {c |}{col 14}{res}{space 2} .0462057{col 26}{space 2} .0183034{col 37}{space 1}    2.52{col 46}{space 3}0.012{col 54}{space 4} .0103203{col 67}{space 3}  .082091
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .0809394{col 26}{space 2} .0193065{col 37}{space 1}    4.19{col 46}{space 3}0.000{col 54}{space 4} .0430874{col 67}{space 3} .1187914
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2} .0190821{col 26}{space 2} .0203532{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.0208222{col 67}{space 3} .0589864
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2}-.0117214{col 26}{space 2} .0202191{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}-.0513627{col 67}{space 3} .0279199
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0425071{col 26}{space 2} .0203126{col 37}{space 1}   -2.09{col 46}{space 3}0.036{col 54}{space 4}-.0823318{col 67}{space 3}-.0026825
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0378955{col 26}{space 2} .0203069{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-.0777089{col 67}{space 3} .0019179
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0427598{col 26}{space 2} .0202377{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.0824377{col 67}{space 3}-.0030819
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2}-.0276303{col 26}{space 2} .0203773{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-.0675818{col 67}{space 3} .0123211
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .9952994{col 26}{space 2}  .033587{col 37}{space 1}   29.63{col 46}{space 3}0.000{col 54}{space 4}  .929449{col 67}{space 3}  1.06115
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40924292
     {txt}sigma_e {c |} {res} .35082825
         {txt}rho {c |} {res} .57640294{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}544{txt}, {res}3804{txt}) = {res}9.54{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_7
. esttab OLS Within, mtitles se scalars(F r2) drop(0.d* 0.union 0.married)
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS          Within   
{txt}{hline 44}
{txt}educ        {res}       0.0896***            0   {txt}
            {res} {ralign 12:{txt:(}0.00518{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}exper       {res}       0.0665***        0.131***{txt}
            {res} {ralign 12:{txt:(}0.0137{txt:)}}    {ralign 12:{txt:(}0.00983{txt:)}}   {txt}

{txt}expersq     {res}     -0.00238**      -0.00515***{txt}
            {res} {ralign 12:{txt:(}0.000818{txt:)}}    {ralign 12:{txt:(}0.000704{txt:)}}   {txt}

{txt}0.black     {res}            0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.black     {res}       -0.128***            0   {txt}
            {res} {ralign 12:{txt:(}0.0236{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}0.south     {res}            0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.south     {res}      -0.0529***        0.102*  {txt}
            {res} {ralign 12:{txt:(}0.0156{txt:)}}    {ralign 12:{txt:(}0.0480{txt:)}}   {txt}

{txt}1.married   {res}        0.112***       0.0462*  {txt}
            {res} {ralign 12:{txt:(}0.0157{txt:)}}    {ralign 12:{txt:(}0.0183{txt:)}}   {txt}

{txt}1.union     {res}        0.180***       0.0809***{txt}
            {res} {ralign 12:{txt:(}0.0171{txt:)}}    {ralign 12:{txt:(}0.0193{txt:)}}   {txt}

{txt}1.d81       {res}       0.0587          0.0191   {txt}
            {res} {ralign 12:{txt:(}0.0303{txt:)}}    {ralign 12:{txt:(}0.0204{txt:)}}   {txt}

{txt}1.d82       {res}       0.0638         -0.0117   {txt}
            {res} {ralign 12:{txt:(}0.0332{txt:)}}    {ralign 12:{txt:(}0.0202{txt:)}}   {txt}

{txt}1.d83       {res}       0.0633         -0.0425*  {txt}
            {res} {ralign 12:{txt:(}0.0366{txt:)}}    {ralign 12:{txt:(}0.0203{txt:)}}   {txt}

{txt}1.d84       {res}       0.0915*        -0.0379   {txt}
            {res} {ralign 12:{txt:(}0.0400{txt:)}}    {ralign 12:{txt:(}0.0203{txt:)}}   {txt}

{txt}1.d85       {res}        0.111*        -0.0428*  {txt}
            {res} {ralign 12:{txt:(}0.0433{txt:)}}    {ralign 12:{txt:(}0.0202{txt:)}}   {txt}

{txt}1.d86       {res}        0.144**       -0.0276   {txt}
            {res} {ralign 12:{txt:(}0.0464{txt:)}}    {ralign 12:{txt:(}0.0204{txt:)}}   {txt}

{txt}1.d87       {res}        0.176***            0   {txt}
            {res} {ralign 12:{txt:(}0.0494{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}_cons       {res}        0.133           0.995***{txt}
            {res} {ralign 12:{txt:(}0.0774{txt:)}}    {ralign 12:{txt:(}0.0336{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}         4360            4360   {txt}
{txt}F           {res}        73.43           76.71   {txt}
{txt}r2          {res}        0.191           0.182   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_8
. display (exp(.180)-1)*100
{res}19.721736
{txt}
{com}. //_9
. display (exp(.0844)-1)*100
{res}8.8064032
{txt}
{com}. //_10
. quietly reg lwage c.edu exper expersq i.black i.south i.married i.union i.d8*
{txt}
{com}. estimates store pooled
{txt}
{com}. quietly xtreg lwage c.edu i.black i.south i.married i.union i.d8*, fe
{txt}
{com}. estimates store fe
{txt}
{com}. coefplot (pooled, label("{c -(}bf:Pooled OLS{c )-}") mcolor(midblue) mlcolor(cyan) ///
>   ciopts(lcolor(magenta midblue))) /// options for first group
>   (fe, label("{c -(}bf: Within{c )-}") mcolor(green) mlcolor(lime) ///
>   ciopts(lcolor(lime green))), /// options for second group
>   title(Union and Marriage Wage Premiums) ///
>   drop(_cons 1.d* 0.black 0.south) ///
>   xline(0, lcolor(red) lwidth(medium)) scheme(jet_white) ///
>   xtitle("{c -(}bf: Effect of Union{c )-}") ///
>   graphregion(margin(small)) ///
>   coeflabels(educ="Education" exper="Experience" expersq="Experience Squared" ///
>   1.black="Black" 1.south="South" 1.married="Married" ///
>   1.union="Union") ///
>   msize(large) mcolor(%85) mlwidth(medium) msymbol(circle) /// marker options
>   levels(95 90) ciopts(lwidth(medthick thick) recast(rspike rcap)) ///ci options for all groups
>   legend(ring(1) col(1) pos(3) size(medsmall))
{res}{txt}(note: scheme jet_white not found, using s2color)
{res}{txt}
{com}.   graph export "/Users/Sam/Desktop/Econ 645/Stata/week4_union_wage_premium.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week4_union_wage_premium.png written in PNG format)

{com}. //_11
. use "wagepan.dta", clear
{txt}
{com}. //_12
. xtset nr year
{res}{txt}{col 8}panel variable:  {res}nr (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1980 to 1987
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. //_13
. eststo OLS: reg lwage c.edu##i.d8* exper expersq i.married i.union

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,360
{txt}{hline 13}{c +}{hline 34}   F(19, 4340)     = {res}    50.92
{txt}       Model {c |} {res} 225.412805        19  11.8638318   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1011.11684     4,340   .23297623   {txt}R-squared       ={res}    0.1823
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1787
{txt}       Total {c |} {res} 1236.52964     4,359  .283672779   {txt}Root MSE        =   {res} .48268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .081673{col 26}{space 2} .0125675{col 37}{space 1}    6.50{col 46}{space 3}0.000{col 54}{space 4} .0570343{col 67}{space 3} .1063117
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2}-.0356958{col 26}{space 2}  .199359{col 37}{space 1}   -0.18{col 46}{space 3}0.858{col 54}{space 4}-.4265413{col 67}{space 3} .3551497
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2}-.0315288{col 26}{space 2} .1998095{col 37}{space 1}   -0.16{col 46}{space 3}0.875{col 54}{space 4}-.4232575{col 67}{space 3}    .3602
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0342801{col 26}{space 2} .2007839{col 37}{space 1}   -0.17{col 46}{space 3}0.864{col 54}{space 4}-.4279192{col 67}{space 3} .3593589
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0242933{col 26}{space 2} .2025167{col 37}{space 1}    0.12{col 46}{space 3}0.905{col 54}{space 4}-.3727429{col 67}{space 3} .4213294
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .0058838{col 26}{space 2} .2052301{col 37}{space 1}    0.03{col 46}{space 3}0.977{col 54}{space 4}-.3964719{col 67}{space 3} .4082395
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0251586{col 26}{space 2} .2092184{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}-.3850164{col 67}{space 3} .4353336
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0372565{col 26}{space 2} .2148364{col 37}{space 1}    0.17{col 46}{space 3}0.862{col 54}{space 4}-.3839326{col 67}{space 3} .4584456
{txt}{space 12} {c |}
{space 2}d81#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0084448{col 26}{space 2} .0167792{col 37}{space 1}    0.50{col 46}{space 3}0.615{col 54}{space 4} -.024451{col 67}{space 3} .0413407
{txt}{space 12} {c |}
{space 2}d82#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0088899{col 26}{space 2} .0168742{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-.0241921{col 67}{space 3}  .041972
{txt}{space 12} {c |}
{space 2}d83#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0093544{col 26}{space 2} .0170326{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 54}{space 4}-.0240381{col 67}{space 3}  .042747
{txt}{space 12} {c |}
{space 2}d84#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0070671{col 26}{space 2} .0172551{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.0267617{col 67}{space 3} .0408958
{txt}{space 12} {c |}
{space 2}d85#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0104027{col 26}{space 2} .0175306{col 37}{space 1}    0.59{col 46}{space 3}0.553{col 54}{space 4}-.0239662{col 67}{space 3} .0447716
{txt}{space 12} {c |}
{space 2}d86#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0116562{col 26}{space 2} .0178614{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.0233613{col 67}{space 3} .0466737
{txt}{space 12} {c |}
{space 2}d87#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0134166{col 26}{space 2} .0182525{col 37}{space 1}    0.74{col 46}{space 3}0.462{col 54}{space 4}-.0223676{col 67}{space 3} .0492008
{txt}{space 12} {c |}
{space 7}exper {c |}{col 14}{res}{space 2} .0568876{col 26}{space 2} .0154436{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} .0266102{col 67}{space 3}  .087165
{txt}{space 5}expersq {c |}{col 14}{res}{space 2} -.001919{col 26}{space 2} .0009455{col 37}{space 1}   -2.03{col 46}{space 3}0.042{col 54}{space 4}-.0037726{col 67}{space 3}-.0000654
{txt}{space 3}1.married {c |}{col 14}{res}{space 2} .1229473{col 26}{space 2} .0155752{col 37}{space 1}    7.89{col 46}{space 3}0.000{col 54}{space 4} .0924119{col 67}{space 3} .1534827
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .1720565{col 26}{space 2} .0171378{col 37}{space 1}   10.04{col 46}{space 3}0.000{col 54}{space 4} .1384575{col 67}{space 3} .2056554
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2175863{col 26}{space 2} .1641736{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.1042777{col 67}{space 3} .5394503
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_14
. eststo Within: xtreg lwage c.edu##i.d8* i.married i.union, fe
{p 0 6 2}{txt}note: educ omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     4,360
{txt}Group variable: {res}nr{txt}{col 49}Number of groups{col 67}={col 69}{res}       545

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1708{col 63}{txt}min{col 67}={col 69}{res}         8
{txt}     between = {res}0.1900{col 63}{txt}avg{col 67}={col 69}{res}       8.0
{txt}     overall = {res}0.1325{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}16{txt},{res}3799{txt}){col 67}={col 70}{res}    48.91
{txt}corr(u_i, Xb){col 16}= {res}0.0991{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}1.d81 {c |}{col 14}{res}{space 2}-.0224158{col 26}{space 2} .1458885{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-.3084431{col 67}{space 3} .2636114
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2}-.0057611{col 26}{space 2} .1458558{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.2917243{col 67}{space 3} .2802021
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .0104297{col 26}{space 2} .1458579{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-.2755377{col 67}{space 3} .2963971
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0843743{col 26}{space 2} .1458518{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-.2015811{col 67}{space 3} .3703297
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .0497253{col 26}{space 2} .1458602{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.2362465{col 67}{space 3} .3356971
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0656064{col 26}{space 2} .1458917{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.2204273{col 67}{space 3} .3516401
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0904448{col 26}{space 2} .1458505{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4} -.195508{col 67}{space 3} .3763977
{txt}{space 12} {c |}
{space 2}d81#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0115854{col 26}{space 2} .0122625{col 37}{space 1}    0.94{col 46}{space 3}0.345{col 54}{space 4}-.0124562{col 67}{space 3} .0356271
{txt}{space 12} {c |}
{space 2}d82#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0147905{col 26}{space 2} .0122635{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 54}{space 4}-.0092533{col 67}{space 3} .0388342
{txt}{space 12} {c |}
{space 2}d83#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0171182{col 26}{space 2} .0122633{col 37}{space 1}    1.40{col 46}{space 3}0.163{col 54}{space 4}-.0069251{col 67}{space 3} .0411615
{txt}{space 12} {c |}
{space 2}d84#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0165839{col 26}{space 2} .0122657{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4} -.007464{col 67}{space 3} .0406319
{txt}{space 12} {c |}
{space 2}d85#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0237085{col 26}{space 2} .0122738{col 37}{space 1}    1.93{col 46}{space 3}0.053{col 54}{space 4}-.0003554{col 67}{space 3} .0477725
{txt}{space 12} {c |}
{space 2}d86#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0274123{col 26}{space 2}  .012274{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0033481{col 67}{space 3} .0514765
{txt}{space 12} {c |}
{space 2}d87#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0304332{col 26}{space 2} .0122723{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0063722{col 67}{space 3} .0544942
{txt}{space 12} {c |}
{space 3}1.married {c |}{col 14}{res}{space 2} .0548205{col 26}{space 2} .0184126{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4}  .018721{col 67}{space 3}   .09092
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .0829785{col 26}{space 2} .0194461{col 37}{space 1}    4.27{col 46}{space 3}0.000{col 54}{space 4} .0448527{col 67}{space 3} .1211042
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.362459{col 26}{space 2} .0162385{col 37}{space 1}   83.90{col 46}{space 3}0.000{col 54}{space 4} 1.330622{col 67}{space 3} 1.394296
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37264193
     {txt}sigma_e {c |} {res} .35335713
         {txt}rho {c |} {res} .52654439{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}544{txt}, {res}3799{txt}) = {res}8.09{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_15
. esttab OLS Within, mtitles se scalars(F r2) drop(0.d* 0.union 0.married)
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS          Within   
{txt}{hline 44}
{txt}educ        {res}       0.0817***            0   {txt}
            {res} {ralign 12:{txt:(}0.0126{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.d81       {res}      -0.0357         -0.0224   {txt}
            {res} {ralign 12:{txt:(}0.199{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d82       {res}      -0.0315        -0.00576   {txt}
            {res} {ralign 12:{txt:(}0.200{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d83       {res}      -0.0343          0.0104   {txt}
            {res} {ralign 12:{txt:(}0.201{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d84       {res}       0.0243          0.0844   {txt}
            {res} {ralign 12:{txt:(}0.203{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d85       {res}      0.00588          0.0497   {txt}
            {res} {ralign 12:{txt:(}0.205{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d86       {res}       0.0252          0.0656   {txt}
            {res} {ralign 12:{txt:(}0.209{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d87       {res}       0.0373          0.0904   {txt}
            {res} {ralign 12:{txt:(}0.215{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d81#c.educ{res}      0.00844          0.0116   {txt}
            {res} {ralign 12:{txt:(}0.0168{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d82#c.educ{res}      0.00889          0.0148   {txt}
            {res} {ralign 12:{txt:(}0.0169{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d83#c.educ{res}      0.00935          0.0171   {txt}
            {res} {ralign 12:{txt:(}0.0170{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d84#c.educ{res}      0.00707          0.0166   {txt}
            {res} {ralign 12:{txt:(}0.0173{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d85#c.educ{res}       0.0104          0.0237   {txt}
            {res} {ralign 12:{txt:(}0.0175{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d86#c.educ{res}       0.0117          0.0274*  {txt}
            {res} {ralign 12:{txt:(}0.0179{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d87#c.educ{res}       0.0134          0.0304*  {txt}
            {res} {ralign 12:{txt:(}0.0183{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}exper       {res}       0.0569***                {txt}
            {res} {ralign 12:{txt:(}0.0154{txt:)}}                   {txt}

{txt}expersq     {res}     -0.00192*                  {txt}
            {res} {ralign 12:{txt:(}0.000945{txt:)}}                   {txt}

{txt}1.married   {res}        0.123***       0.0548** {txt}
            {res} {ralign 12:{txt:(}0.0156{txt:)}}    {ralign 12:{txt:(}0.0184{txt:)}}   {txt}

{txt}1.union     {res}        0.172***       0.0830***{txt}
            {res} {ralign 12:{txt:(}0.0171{txt:)}}    {ralign 12:{txt:(}0.0194{txt:)}}   {txt}

{txt}_cons       {res}        0.218           1.362***{txt}
            {res} {ralign 12:{txt:(}0.164{txt:)}}    {ralign 12:{txt:(}0.0162{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}         4360            4360   {txt}
{txt}F           {res}        50.92           48.91   {txt}
{txt}r2          {res}        0.182           0.171   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_16
. display (exp(0.0304)-1)*100
{res}3.0866798
{txt}
{com}. //_17
. quietly reg lwage c.edu##i.d8* exper expersq i.married i.union
{txt}
{com}. estimates store pooled
{txt}
{com}. quietly xtreg lwage c.edu##i.d8* i.married i.union, fe
{txt}
{com}. estimates store fe
{txt}
{com}. coefplot ///
>   (pooled, label("{c -(}bf:Pooled OLS{c )-}") mcolor(midblue) mlcolor(cyan) ///
>     ciopts(lcolor(magenta midblue))) /// options for first group
>   (fe, label("{c -(}bf: Within{c )-}") mcolor(green) mlcolor(lime) ///
>     ciopts(lcolor(lime green))), /// options for second gropu
>   title("Change in Return to Education") ///
>   keep(educ 1.d81#c.educ 1.d82#c.educ 1.d83#c.educ 1.d84#c.educ ///
>     1.d85#c.educ 1.d86#c.educ 1.d87#c.educ) ///
>   xline(0, lcolor(red) lwidth(medium)) scheme(jet_white) ///
>   xtitle("{c -(}bf: Coefficients{c )-}") ///
>   graphregion(margin(small)) ///
>   coeflabels(educ="Education" 1.d81#c.educ="1981 Returns" ///
>     1.d82#c.educ="1982 Returns" 1.d83#c.educ="1983 Returns" ///
>     1.d84#c.educ="1984 Returns" 1.d85#c.educ="1985 Returns" ///
>     1.d86#c.educ="1986 Returns" 1.d87#c.educ="1987 Returns") ///
>   msize(large) mcolor(%85) mlwidth(medium) msymbol(circle) /// marker options
>   levels(95 90) ciopts(lwidth(medthick thick) recast(rspike rcap)) ///ci options for all groups
>   legend(ring(1) col(1) pos(3) size(medsmall))
{res}{txt}(note: scheme jet_white not found, using s2color)
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week4_edu_returns.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week4_edu_returns.png written in PNG format)

{com}. //_18
. xtreg lwage c.edu##i.d8* i.married i.union, fe
{p 0 6 2}{txt}note: educ omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     4,360
{txt}Group variable: {res}nr{txt}{col 49}Number of groups{col 67}={col 69}{res}       545

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1708{col 63}{txt}min{col 67}={col 69}{res}         8
{txt}     between = {res}0.1900{col 63}{txt}avg{col 67}={col 69}{res}       8.0
{txt}     overall = {res}0.1325{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}16{txt},{res}3799{txt}){col 67}={col 70}{res}    48.91
{txt}corr(u_i, Xb){col 16}= {res}0.0991{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}1.d81 {c |}{col 14}{res}{space 2}-.0224158{col 26}{space 2} .1458885{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-.3084431{col 67}{space 3} .2636114
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2}-.0057611{col 26}{space 2} .1458558{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.2917243{col 67}{space 3} .2802021
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .0104297{col 26}{space 2} .1458579{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-.2755377{col 67}{space 3} .2963971
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0843743{col 26}{space 2} .1458518{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-.2015811{col 67}{space 3} .3703297
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .0497253{col 26}{space 2} .1458602{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.2362465{col 67}{space 3} .3356971
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0656064{col 26}{space 2} .1458917{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.2204273{col 67}{space 3} .3516401
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0904448{col 26}{space 2} .1458505{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4} -.195508{col 67}{space 3} .3763977
{txt}{space 12} {c |}
{space 2}d81#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0115854{col 26}{space 2} .0122625{col 37}{space 1}    0.94{col 46}{space 3}0.345{col 54}{space 4}-.0124562{col 67}{space 3} .0356271
{txt}{space 12} {c |}
{space 2}d82#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0147905{col 26}{space 2} .0122635{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 54}{space 4}-.0092533{col 67}{space 3} .0388342
{txt}{space 12} {c |}
{space 2}d83#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0171182{col 26}{space 2} .0122633{col 37}{space 1}    1.40{col 46}{space 3}0.163{col 54}{space 4}-.0069251{col 67}{space 3} .0411615
{txt}{space 12} {c |}
{space 2}d84#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0165839{col 26}{space 2} .0122657{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4} -.007464{col 67}{space 3} .0406319
{txt}{space 12} {c |}
{space 2}d85#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0237085{col 26}{space 2} .0122738{col 37}{space 1}    1.93{col 46}{space 3}0.053{col 54}{space 4}-.0003554{col 67}{space 3} .0477725
{txt}{space 12} {c |}
{space 2}d86#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0274123{col 26}{space 2}  .012274{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0033481{col 67}{space 3} .0514765
{txt}{space 12} {c |}
{space 2}d87#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0304332{col 26}{space 2} .0122723{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0063722{col 67}{space 3} .0544942
{txt}{space 12} {c |}
{space 3}1.married {c |}{col 14}{res}{space 2} .0548205{col 26}{space 2} .0184126{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4}  .018721{col 67}{space 3}   .09092
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .0829785{col 26}{space 2} .0194461{col 37}{space 1}    4.27{col 46}{space 3}0.000{col 54}{space 4} .0448527{col 67}{space 3} .1211042
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.362459{col 26}{space 2} .0162385{col 37}{space 1}   83.90{col 46}{space 3}0.000{col 54}{space 4} 1.330622{col 67}{space 3} 1.394296
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37264193
     {txt}sigma_e {c |} {res} .35335713
         {txt}rho {c |} {res} .52654439{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}544{txt}, {res}3799{txt}) = {res}8.09{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_19
. predict u, resid
{txt}
{com}. //_20
. reg u l.u, noconst

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     3,815
{txt}{hline 13}{c +}{hline 34}   F(1, 3814)      = {res}  2181.06
{txt}       Model {c |} {res} 332.737937         1  332.737937   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 581.856111     3,814  .152557973   {txt}R-squared       ={res}    0.3638
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3636
{txt}       Total {c |} {res} 914.594048     3,815  .239736317   {txt}Root MSE        =   {res} .39059

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           u{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}u {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .5857228{col 26}{space 2} .0125418{col 37}{space 1}   46.70{col 46}{space 3}0.000{col 54}{space 4} .5611336{col 67}{space 3}  .610312
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_21
. est clear
{txt}
{com}. eststo OLS: reg lwage c.edu##i.d8* i.black##i.d8* exper expersq i.married i.union

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,360
{txt}{hline 13}{c +}{hline 34}   F(27, 4332)     = {res}    37.78
{txt}       Model {c |} {res} 235.665339        27  8.72834589   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  1000.8643     4,332  .231039774   {txt}R-squared       ={res}    0.1906
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1855
{txt}       Total {c |} {res} 1236.52964     4,359  .283672779   {txt}Root MSE        =   {res} .48067

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0830098{col 26}{space 2} .0125217{col 37}{space 1}    6.63{col 46}{space 3}0.000{col 54}{space 4} .0584609{col 67}{space 3} .1075588
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2}-.0412547{col 26}{space 2} .1993287{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.4320409{col 67}{space 3} .3495315
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2}-.0152276{col 26}{space 2} .1997638{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.4068669{col 67}{space 3} .3764117
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0268885{col 26}{space 2} .2007155{col 37}{space 1}   -0.13{col 46}{space 3}0.893{col 54}{space 4}-.4203936{col 67}{space 3} .3666166
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0257253{col 26}{space 2}  .202407{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 54}{space 4} -.371096{col 67}{space 3} .4225465
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .0252159{col 26}{space 2} .2050566{col 37}{space 1}    0.12{col 46}{space 3}0.902{col 54}{space 4}   -.3768{col 67}{space 3} .4272319
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0228682{col 26}{space 2} .2089636{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-.3868074{col 67}{space 3} .4325438
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .0552934{col 26}{space 2} .2144675{col 37}{space 1}    0.26{col 46}{space 3}0.797{col 54}{space 4}-.3651726{col 67}{space 3} .4757594
{txt}{space 12} {c |}
{space 2}d81#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0083812{col 26}{space 2} .0167209{col 37}{space 1}    0.50{col 46}{space 3}0.616{col 54}{space 4}-.0244003{col 67}{space 3} .0411627
{txt}{space 12} {c |}
{space 2}d82#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0080581{col 26}{space 2} .0168149{col 37}{space 1}    0.48{col 46}{space 3}0.632{col 54}{space 4}-.0249077{col 67}{space 3}  .041024
{txt}{space 12} {c |}
{space 2}d83#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0087321{col 26}{space 2}  .016972{col 37}{space 1}    0.51{col 46}{space 3}0.607{col 54}{space 4}-.0245417{col 67}{space 3} .0420059
{txt}{space 12} {c |}
{space 2}d84#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0065985{col 26}{space 2} .0171926{col 37}{space 1}    0.38{col 46}{space 3}0.701{col 54}{space 4}-.0271079{col 67}{space 3} .0403049
{txt}{space 12} {c |}
{space 2}d85#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0091917{col 26}{space 2} .0174659{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4}-.0250503{col 67}{space 3} .0434338
{txt}{space 12} {c |}
{space 2}d86#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0109991{col 26}{space 2} .0177943{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4}-.0238868{col 67}{space 3} .0458851
{txt}{space 12} {c |}
{space 2}d87#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0119645{col 26}{space 2} .0181818{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-.0236811{col 67}{space 3} .0476102
{txt}{space 12} {c |}
{space 5}1.black {c |}{col 14}{res}{space 2}-.0821357{col 26}{space 2} .0645627{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-.2087116{col 67}{space 3} .0444401
{txt}{space 12} {c |}
{space 3}black#d81 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2} .0350059{col 26}{space 2} .0911407{col 37}{space 1}    0.38{col 46}{space 3}0.701{col 54}{space 4}-.1436765{col 67}{space 3} .2136883
{txt}{space 12} {c |}
{space 3}black#d82 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0989736{col 26}{space 2} .0911617{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-.2776971{col 67}{space 3} .0797499
{txt}{space 12} {c |}
{space 3}black#d83 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0594933{col 26}{space 2} .0911759{col 37}{space 1}   -0.65{col 46}{space 3}0.514{col 54}{space 4}-.2382447{col 67}{space 3} .1192581
{txt}{space 12} {c |}
{space 3}black#d84 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0446436{col 26}{space 2} .0911938{col 37}{space 1}   -0.49{col 46}{space 3}0.624{col 54}{space 4}-.2234302{col 67}{space 3}  .134143
{txt}{space 12} {c |}
{space 3}black#d85 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.1412043{col 26}{space 2} .0912107{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4} -.320024{col 67}{space 3} .0376154
{txt}{space 12} {c |}
{space 3}black#d86 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0280978{col 26}{space 2}  .091229{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-.2069534{col 67}{space 3} .1507578
{txt}{space 12} {c |}
{space 3}black#d87 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.1448229{col 26}{space 2} .0912847{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.3237875{col 67}{space 3} .0341418
{txt}{space 12} {c |}
{space 7}exper {c |}{col 14}{res}{space 2} .0616496{col 26}{space 2} .0154296{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} .0313997{col 67}{space 3} .0918995
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0020374{col 26}{space 2} .0009435{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-.0038872{col 67}{space 3}-.0001876
{txt}{space 3}1.married {c |}{col 14}{res}{space 2} .1069328{col 26}{space 2} .0157148{col 37}{space 1}    6.80{col 46}{space 3}0.000{col 54}{space 4} .0761238{col 67}{space 3} .1377419
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .1843211{col 26}{space 2} .0171798{col 37}{space 1}   10.73{col 46}{space 3}0.000{col 54}{space 4}   .15064{col 67}{space 3} .2180023
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1982792{col 26}{space 2} .1638308{col 37}{space 1}    1.21{col 46}{space 3}0.226{col 54}{space 4}-.1229129{col 67}{space 3} .5194713
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_22
. eststo Within: xtreg lwage c.edu##i.d8* i.black##i.d8* i.married i.union, fe
{p 0 6 2}{txt}note: educ omitted because of collinearity{p_end}
{p 0 6 2}note: 1.black omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     4,360
{txt}Group variable: {res}nr{txt}{col 49}Number of groups{col 67}={col 69}{res}       545

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1738{col 63}{txt}min{col 67}={col 69}{res}         8
{txt}     between = {res}0.1934{col 63}{txt}avg{col 67}={col 69}{res}       8.0
{txt}     overall = {res}0.1389{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}23{txt},{res}3792{txt}){col 67}={col 70}{res}    34.69
{txt}corr(u_i, Xb){col 16}= {res}0.1049{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}1.d81 {c |}{col 14}{res}{space 2}-.0276557{col 26}{space 2} .1463492{col 37}{space 1}   -0.19{col 46}{space 3}0.850{col 54}{space 4}-.3145865{col 67}{space 3} .2592752
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2} .0162187{col 26}{space 2} .1463125{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-.2706402{col 67}{space 3} .3030775
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .0242781{col 26}{space 2} .1463218{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4} -.262599{col 67}{space 3} .3111552
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0961124{col 26}{space 2} .1463152{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-.1907517{col 67}{space 3} .3829765
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .0806915{col 26}{space 2} .1463169{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.2061759{col 67}{space 3} .3675589
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2}  .075028{col 26}{space 2} .1463527{col 37}{space 1}    0.51{col 46}{space 3}0.608{col 54}{space 4}-.2119097{col 67}{space 3} .3619656
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .1199805{col 26}{space 2} .1463163{col 37}{space 1}    0.82{col 46}{space 3}0.412{col 54}{space 4}-.1668858{col 67}{space 3} .4068467
{txt}{space 12} {c |}
{space 2}d81#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0117652{col 26}{space 2} .0122599{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-.0122714{col 67}{space 3} .0358018
{txt}{space 12} {c |}
{space 2}d82#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0140603{col 26}{space 2} .0122605{col 37}{space 1}    1.15{col 46}{space 3}0.252{col 54}{space 4}-.0099776{col 67}{space 3} .0380982
{txt}{space 12} {c |}
{space 2}d83#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0166878{col 26}{space 2} .0122603{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0073497{col 67}{space 3} .0407252
{txt}{space 12} {c |}
{space 2}d84#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0162498{col 26}{space 2} .0122624{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.0077918{col 67}{space 3} .0402914
{txt}{space 12} {c |}
{space 2}d85#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0227215{col 26}{space 2} .0122702{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4}-.0013353{col 67}{space 3} .0467783
{txt}{space 12} {c |}
{space 2}d86#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2}  .027172{col 26}{space 2} .0122704{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0031148{col 67}{space 3} .0512291
{txt}{space 12} {c |}
{space 2}d87#c.educ {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0295045{col 26}{space 2} .0122688{col 37}{space 1}    2.40{col 46}{space 3}0.016{col 54}{space 4} .0054504{col 67}{space 3} .0535587
{txt}{space 12} {c |}
{space 5}1.black {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 3}black#d81 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2} .0298494{col 26}{space 2} .0669496{col 37}{space 1}    0.45{col 46}{space 3}0.656{col 54}{space 4}-.1014113{col 67}{space 3} .1611101
{txt}{space 12} {c |}
{space 3}black#d82 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.1111954{col 26}{space 2} .0669827{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4} -.242521{col 67}{space 3} .0201302
{txt}{space 12} {c |}
{space 3}black#d83 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0687691{col 26}{space 2} .0669927{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-.2001144{col 67}{space 3} .0625761
{txt}{space 12} {c |}
{space 3}black#d84 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0589417{col 26}{space 2} .0670094{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4}-.1903196{col 67}{space 3} .0724362
{txt}{space 12} {c |}
{space 3}black#d85 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.1573439{col 26}{space 2} .0670161{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4} -.288735{col 67}{space 3}-.0259527
{txt}{space 12} {c |}
{space 3}black#d86 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.0458512{col 26}{space 2} .0670197{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-.1772493{col 67}{space 3} .0855469
{txt}{space 12} {c |}
{space 3}black#d87 {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}-.1494466{col 26}{space 2}  .067063{col 37}{space 1}   -2.23{col 46}{space 3}0.026{col 54}{space 4}-.2809297{col 67}{space 3}-.0179636
{txt}{space 12} {c |}
{space 3}1.married {c |}{col 14}{res}{space 2} .0516758{col 26}{space 2} .0184369{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0155286{col 67}{space 3} .0878229
{txt}{space 5}1.union {c |}{col 14}{res}{space 2} .0845706{col 26}{space 2}  .019456{col 37}{space 1}    4.35{col 46}{space 3}0.000{col 54}{space 4} .0464254{col 67}{space 3} .1227157
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.362641{col 26}{space 2} .0162264{col 37}{space 1}   83.98{col 46}{space 3}0.000{col 54}{space 4} 1.330828{col 67}{space 3} 1.394455
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37090778
     {txt}sigma_e {c |} {res} .35303669
         {txt}rho {c |} {res}  .5246707{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}544{txt}, {res}3792{txt}) = {res}8.01{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_23
. esttab OLS Within, mtitles se scalars(F r2) drop(0.d* 0.b* 1.black#0.d* 0.union 0.married)
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS          Within   
{txt}{hline 44}
{txt}educ        {res}       0.0830***            0   {txt}
            {res} {ralign 12:{txt:(}0.0125{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.d81       {res}      -0.0413         -0.0277   {txt}
            {res} {ralign 12:{txt:(}0.199{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d82       {res}      -0.0152          0.0162   {txt}
            {res} {ralign 12:{txt:(}0.200{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d83       {res}      -0.0269          0.0243   {txt}
            {res} {ralign 12:{txt:(}0.201{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d84       {res}       0.0257          0.0961   {txt}
            {res} {ralign 12:{txt:(}0.202{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d85       {res}       0.0252          0.0807   {txt}
            {res} {ralign 12:{txt:(}0.205{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d86       {res}       0.0229          0.0750   {txt}
            {res} {ralign 12:{txt:(}0.209{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d87       {res}       0.0553           0.120   {txt}
            {res} {ralign 12:{txt:(}0.214{txt:)}}    {ralign 12:{txt:(}0.146{txt:)}}   {txt}

{txt}1.d81#c.educ{res}      0.00838          0.0118   {txt}
            {res} {ralign 12:{txt:(}0.0167{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d82#c.educ{res}      0.00806          0.0141   {txt}
            {res} {ralign 12:{txt:(}0.0168{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d83#c.educ{res}      0.00873          0.0167   {txt}
            {res} {ralign 12:{txt:(}0.0170{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d84#c.educ{res}      0.00660          0.0162   {txt}
            {res} {ralign 12:{txt:(}0.0172{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d85#c.educ{res}      0.00919          0.0227   {txt}
            {res} {ralign 12:{txt:(}0.0175{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d86#c.educ{res}       0.0110          0.0272*  {txt}
            {res} {ralign 12:{txt:(}0.0178{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.d87#c.educ{res}       0.0120          0.0295*  {txt}
            {res} {ralign 12:{txt:(}0.0182{txt:)}}    {ralign 12:{txt:(}0.0123{txt:)}}   {txt}

{txt}1.black     {res}      -0.0821               0   {txt}
            {res} {ralign 12:{txt:(}0.0646{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.black#1~81{res}       0.0350          0.0298   {txt}
            {res} {ralign 12:{txt:(}0.0911{txt:)}}    {ralign 12:{txt:(}0.0669{txt:)}}   {txt}

{txt}1.black#1~82{res}      -0.0990          -0.111   {txt}
            {res} {ralign 12:{txt:(}0.0912{txt:)}}    {ralign 12:{txt:(}0.0670{txt:)}}   {txt}

{txt}1.black#1~83{res}      -0.0595         -0.0688   {txt}
            {res} {ralign 12:{txt:(}0.0912{txt:)}}    {ralign 12:{txt:(}0.0670{txt:)}}   {txt}

{txt}1.black#1~84{res}      -0.0446         -0.0589   {txt}
            {res} {ralign 12:{txt:(}0.0912{txt:)}}    {ralign 12:{txt:(}0.0670{txt:)}}   {txt}

{txt}1.black#1~85{res}       -0.141          -0.157*  {txt}
            {res} {ralign 12:{txt:(}0.0912{txt:)}}    {ralign 12:{txt:(}0.0670{txt:)}}   {txt}

{txt}1.black#1~86{res}      -0.0281         -0.0459   {txt}
            {res} {ralign 12:{txt:(}0.0912{txt:)}}    {ralign 12:{txt:(}0.0670{txt:)}}   {txt}

{txt}1.black#1~87{res}       -0.145          -0.149*  {txt}
            {res} {ralign 12:{txt:(}0.0913{txt:)}}    {ralign 12:{txt:(}0.0671{txt:)}}   {txt}

{txt}exper       {res}       0.0616***                {txt}
            {res} {ralign 12:{txt:(}0.0154{txt:)}}                   {txt}

{txt}expersq     {res}     -0.00204*                  {txt}
            {res} {ralign 12:{txt:(}0.000944{txt:)}}                   {txt}

{txt}1.married   {res}        0.107***       0.0517** {txt}
            {res} {ralign 12:{txt:(}0.0157{txt:)}}    {ralign 12:{txt:(}0.0184{txt:)}}   {txt}

{txt}1.union     {res}        0.184***       0.0846***{txt}
            {res} {ralign 12:{txt:(}0.0172{txt:)}}    {ralign 12:{txt:(}0.0195{txt:)}}   {txt}

{txt}_cons       {res}        0.198           1.363***{txt}
            {res} {ralign 12:{txt:(}0.164{txt:)}}    {ralign 12:{txt:(}0.0162{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}         4360            4360   {txt}
{txt}F           {res}        37.78           34.69   {txt}
{txt}r2          {res}        0.191           0.174   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_24
. use "wagepan.dta", clear
{txt}
{com}. //_25
. xtset nr year
{res}{txt}{col 8}panel variable:  {res}nr (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1980 to 1987
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. //_26
. reg lwage educ i.black i.hisp exper expersq married union i.d8*

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,360
{txt}{hline 13}{c +}{hline 34}   F(14, 4345)     = {res}    72.46
{txt}       Model {c |} {res} 234.048277        14  16.7177341   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1002.48136     4,345  .230720682   {txt}R-squared       ={res}    0.1893
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1867
{txt}       Total {c |} {res} 1236.52964     4,359  .283672779   {txt}Root MSE        =   {res} .48033

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0913498{col 26}{space 2} .0052374{col 37}{space 1}   17.44{col 46}{space 3}0.000{col 54}{space 4} .0810819{col 67}{space 3} .1016177
{txt}{space 5}1.black {c |}{col 14}{res}{space 2}-.1392342{col 26}{space 2} .0235796{col 37}{space 1}   -5.90{col 46}{space 3}0.000{col 54}{space 4}-.1854622{col 67}{space 3}-.0930062
{txt}{space 6}1.hisp {c |}{col 14}{res}{space 2} .0160195{col 26}{space 2} .0207971{col 37}{space 1}    0.77{col 46}{space 3}0.441{col 54}{space 4}-.0247535{col 67}{space 3} .0567925
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0672345{col 26}{space 2} .0136948{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} .0403856{col 67}{space 3} .0940834
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0024117{col 26}{space 2}   .00082{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-.0040192{col 67}{space 3}-.0008042
{txt}{space 5}married {c |}{col 14}{res}{space 2} .1082529{col 26}{space 2} .0156894{col 37}{space 1}    6.90{col 46}{space 3}0.000{col 54}{space 4} .0774937{col 67}{space 3} .1390122
{txt}{space 7}union {c |}{col 14}{res}{space 2} .1824613{col 26}{space 2} .0171568{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4} .1488253{col 67}{space 3} .2160973
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2}   .05832{col 26}{space 2} .0303536{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0011886{col 67}{space 3} .1178286
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2} .0627744{col 26}{space 2} .0332141{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4}-.0023421{col 67}{space 3} .1278909
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .0620117{col 26}{space 2} .0366601{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0098608{col 67}{space 3} .1338843
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0904672{col 26}{space 2} .0400907{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4}  .011869{col 67}{space 3} .1690654
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .1092463{col 26}{space 2} .0433525{col 37}{space 1}    2.52{col 46}{space 3}0.012{col 54}{space 4} .0242533{col 67}{space 3} .1942393
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .1419596{col 26}{space 2}  .046423{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} .0509469{col 67}{space 3} .2329723
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .1738334{col 26}{space 2}  .049433{col 37}{space 1}    3.52{col 46}{space 3}0.000{col 54}{space 4} .0769194{col 67}{space 3} .2707474
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0920558{col 26}{space 2} .0782701{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 54}{space 4}-.0613935{col 67}{space 3} .2455051
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo m1: quietly reg lwage educ i.black i.hisp exper expersq married union i.d8*
{txt}
{com}. //_27
. xtreg lwage educ i.black i.hisp exper expersq married union i.d8*, fe
{p 0 6 2}{txt}note: educ omitted because of collinearity{p_end}
{p 0 6 2}note: 1.black omitted because of collinearity{p_end}
{p 0 6 2}note: 1.hisp omitted because of collinearity{p_end}
{p 0 6 2}note: 1.d87 omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     4,360
{txt}Group variable: {res}nr{txt}{col 49}Number of groups{col 67}={col 69}{res}       545

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1806{col 63}{txt}min{col 67}={col 69}{res}         8
{txt}     between = {res}0.0005{col 63}{txt}avg{col 67}={col 69}{res}       8.0
{txt}     overall = {res}0.0635{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}10{txt},{res}3805{txt}){col 67}={col 70}{res}    83.85
{txt}corr(u_i, Xb){col 16}= {res}-0.1212{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}1.black {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 6}1.hisp {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}exper {c |}{col 14}{res}{space 2} .1321464{col 26}{space 2} .0098247{col 37}{space 1}   13.45{col 46}{space 3}0.000{col 54}{space 4} .1128842{col 67}{space 3} .1514087
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0051855{col 26}{space 2} .0007044{col 37}{space 1}   -7.36{col 46}{space 3}0.000{col 54}{space 4}-.0065666{col 67}{space 3}-.0038044
{txt}{space 5}married {c |}{col 14}{res}{space 2} .0466804{col 26}{space 2} .0183104{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .0107811{col 67}{space 3} .0825796
{txt}{space 7}union {c |}{col 14}{res}{space 2} .0800019{col 26}{space 2} .0193103{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .0421423{col 67}{space 3} .1178614
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2} .0190448{col 26}{space 2} .0203626{col 37}{space 1}    0.94{col 46}{space 3}0.350{col 54}{space 4}-.0208779{col 67}{space 3} .0589674
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2} -.011322{col 26}{space 2} .0202275{col 37}{space 1}   -0.56{col 46}{space 3}0.576{col 54}{space 4}-.0509798{col 67}{space 3} .0283359
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2}-.0419955{col 26}{space 2} .0203205{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4}-.0818357{col 67}{space 3}-.0021553
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2}-.0384709{col 26}{space 2} .0203144{col 37}{space 1}   -1.89{col 46}{space 3}0.058{col 54}{space 4}-.0782991{col 67}{space 3} .0013573
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2}-.0432498{col 26}{space 2} .0202458{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-.0829434{col 67}{space 3}-.0035562
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2}-.0273819{col 26}{space 2} .0203863{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-.0673511{col 67}{space 3} .0125872
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2}  1.02764{col 26}{space 2} .0299499{col 37}{space 1}   34.31{col 46}{space 3}0.000{col 54}{space 4} .9689201{col 67}{space 3} 1.086359
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .4009279
     {txt}sigma_e {c |} {res} .35099001
         {txt}rho {c |} {res} .56612236{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}544{txt}, {res}3805{txt}) = {res}9.64{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_28
. estimates store femodel
{txt}
{com}. eststo m2: quietly xtreg lwage educ i.black i.hisp exper expersq married union i.d8*, fe
{txt}
{com}. //_29
. xtreg lwage educ i.black i.hisp exper expersq married union i.d8*, re theta
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     4,360
{txt}Group variable: {res}nr                              {txt}Number of groups  = {res}       545

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1799                                         {txt}min = {res}         8
{txt}     between = {res}0.1860                                         {txt}avg = {res}       8.0
{txt}     overall = {res}0.1830                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}14{txt})     =  {res}   957.77
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000
{txt}theta          = {res}.64291089

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0918763{col 26}{space 2} .0106597{col 37}{space 1}    8.62{col 46}{space 3}0.000{col 54}{space 4} .0709836{col 67}{space 3} .1127689
{txt}{space 5}1.black {c |}{col 14}{res}{space 2}-.1393767{col 26}{space 2} .0477228{col 37}{space 1}   -2.92{col 46}{space 3}0.003{col 54}{space 4}-.2329117{col 67}{space 3}-.0458417
{txt}{space 6}1.hisp {c |}{col 14}{res}{space 2} .0217317{col 26}{space 2} .0426063{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.0617751{col 67}{space 3} .1052385
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .1057545{col 26}{space 2} .0153668{col 37}{space 1}    6.88{col 46}{space 3}0.000{col 54}{space 4} .0756361{col 67}{space 3} .1358729
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0047239{col 26}{space 2} .0006895{col 37}{space 1}   -6.85{col 46}{space 3}0.000{col 54}{space 4}-.0060753{col 67}{space 3}-.0033726
{txt}{space 5}married {c |}{col 14}{res}{space 2}  .063986{col 26}{space 2} .0167742{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0311091{col 67}{space 3} .0968629
{txt}{space 7}union {c |}{col 14}{res}{space 2} .1061344{col 26}{space 2} .0178539{col 37}{space 1}    5.94{col 46}{space 3}0.000{col 54}{space 4} .0711415{col 67}{space 3} .1411273
{txt}{space 7}1.d81 {c |}{col 14}{res}{space 2}  .040462{col 26}{space 2} .0246946{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4}-.0079385{col 67}{space 3} .0888626
{txt}{space 7}1.d82 {c |}{col 14}{res}{space 2} .0309212{col 26}{space 2} .0323416{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.0324672{col 67}{space 3} .0943096
{txt}{space 7}1.d83 {c |}{col 14}{res}{space 2} .0202806{col 26}{space 2}  .041582{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.0612186{col 67}{space 3} .1017798
{txt}{space 7}1.d84 {c |}{col 14}{res}{space 2} .0431187{col 26}{space 2} .0513163{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0574595{col 67}{space 3} .1436969
{txt}{space 7}1.d85 {c |}{col 14}{res}{space 2} .0578155{col 26}{space 2} .0612323{col 37}{space 1}    0.94{col 46}{space 3}0.345{col 54}{space 4}-.0621977{col 67}{space 3} .1778286
{txt}{space 7}1.d86 {c |}{col 14}{res}{space 2} .0919476{col 26}{space 2} .0712293{col 37}{space 1}    1.29{col 46}{space 3}0.197{col 54}{space 4}-.0476592{col 67}{space 3} .2315544
{txt}{space 7}1.d87 {c |}{col 14}{res}{space 2} .1349289{col 26}{space 2} .0813135{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0244427{col 67}{space 3} .2943005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0235864{col 26}{space 2} .1506683{col 37}{space 1}    0.16{col 46}{space 3}0.876{col 54}{space 4} -.271718{col 67}{space 3} .3188907
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .32460315
     {txt}sigma_e {c |} {res} .35099001
         {txt}rho {c |} {res} .46100216{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. eststo m3: quietly xtreg lwage educ i.black i.hisp exper expersq married union i.d8*, re
{txt}
{com}. //_30
. hausman femodel ., sigmamore

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:5}) does not equal the number of coefficients being tested ({result:10}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}  femodel   {col 30}     m3     {col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 7}exper {c |}{res}{col 18} .1321464{col 31} .1057545{col 47} .0263919{col 63}        .
{txt}{space 5}expersq {c |}{res}{col 18}-.0051855{col 31}-.0047239{col 47}-.0004616{col 63} .0001533
{txt}{space 5}married {c |}{res}{col 18} .0466804{col 31}  .063986{col 47}-.0173057{col 63} .0074632
{txt}{space 7}union {c |}{res}{col 18} .0800019{col 31} .1061344{col 47}-.0261326{col 63} .0074922
{txt}{space 7}1.d81 {c |}{res}{col 18} .0190448{col 31}  .040462{col 47}-.0214172{col 63}        .
{txt}{space 7}1.d82 {c |}{res}{col 18} -.011322{col 31} .0309212{col 47}-.0422431{col 63}        .
{txt}{space 7}1.d83 {c |}{res}{col 18}-.0419955{col 31} .0202806{col 47}-.0622762{col 63}        .
{txt}{space 7}1.d84 {c |}{res}{col 18}-.0384709{col 31} .0431187{col 47}-.0815896{col 63}        .
{txt}{space 7}1.d85 {c |}{res}{col 18}-.0432498{col 31} .0578155{col 47}-.1010653{col 63}        .
{txt}{space 7}1.d86 {c |}{res}{col 18}-.0273819{col 31} .0919476{col 47}-.1193295{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from xtreg}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from xtreg}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:5})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}     26.22
{txt}{col 17}Prob>chi2 =  {res}    0.0001
{txt}{col 17}(V_b-V_B is not positive definite)

{com}. //_31
. esttab m1 m2 m3, drop(0.black 0.hisp 0.d8*) mtitles("Pooled OLS" "Within Model" "RE Model")
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}               Pooled OLS    Within Model        RE Model   
{txt}{hline 60}
{txt}educ        {res}       0.0913***            0          0.0919***{txt}
            {res} {ralign 12:{txt:(}17.44{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}8.62{txt:)}}   {txt}

{txt}1.black     {res}       -0.139***            0          -0.139** {txt}
            {res} {ralign 12:{txt:(}-5.90{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}-2.92{txt:)}}   {txt}

{txt}1.hisp      {res}       0.0160               0          0.0217   {txt}
            {res} {ralign 12:{txt:(}0.77{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}0.51{txt:)}}   {txt}

{txt}exper       {res}       0.0672***        0.132***        0.106***{txt}
            {res} {ralign 12:{txt:(}4.91{txt:)}}    {ralign 12:{txt:(}13.45{txt:)}}    {ralign 12:{txt:(}6.88{txt:)}}   {txt}

{txt}expersq     {res}     -0.00241**      -0.00519***     -0.00472***{txt}
            {res} {ralign 12:{txt:(}-2.94{txt:)}}    {ralign 12:{txt:(}-7.36{txt:)}}    {ralign 12:{txt:(}-6.85{txt:)}}   {txt}

{txt}married     {res}        0.108***       0.0467*         0.0640***{txt}
            {res} {ralign 12:{txt:(}6.90{txt:)}}    {ralign 12:{txt:(}2.55{txt:)}}    {ralign 12:{txt:(}3.81{txt:)}}   {txt}

{txt}union       {res}        0.182***       0.0800***        0.106***{txt}
            {res} {ralign 12:{txt:(}10.63{txt:)}}    {ralign 12:{txt:(}4.14{txt:)}}    {ralign 12:{txt:(}5.94{txt:)}}   {txt}

{txt}1.d81       {res}       0.0583          0.0190          0.0405   {txt}
            {res} {ralign 12:{txt:(}1.92{txt:)}}    {ralign 12:{txt:(}0.94{txt:)}}    {ralign 12:{txt:(}1.64{txt:)}}   {txt}

{txt}1.d82       {res}       0.0628         -0.0113          0.0309   {txt}
            {res} {ralign 12:{txt:(}1.89{txt:)}}    {ralign 12:{txt:(}-0.56{txt:)}}    {ralign 12:{txt:(}0.96{txt:)}}   {txt}

{txt}1.d83       {res}       0.0620         -0.0420*         0.0203   {txt}
            {res} {ralign 12:{txt:(}1.69{txt:)}}    {ralign 12:{txt:(}-2.07{txt:)}}    {ralign 12:{txt:(}0.49{txt:)}}   {txt}

{txt}1.d84       {res}       0.0905*        -0.0385          0.0431   {txt}
            {res} {ralign 12:{txt:(}2.26{txt:)}}    {ralign 12:{txt:(}-1.89{txt:)}}    {ralign 12:{txt:(}0.84{txt:)}}   {txt}

{txt}1.d85       {res}        0.109*        -0.0432*         0.0578   {txt}
            {res} {ralign 12:{txt:(}2.52{txt:)}}    {ralign 12:{txt:(}-2.14{txt:)}}    {ralign 12:{txt:(}0.94{txt:)}}   {txt}

{txt}1.d86       {res}        0.142**       -0.0274          0.0919   {txt}
            {res} {ralign 12:{txt:(}3.06{txt:)}}    {ralign 12:{txt:(}-1.34{txt:)}}    {ralign 12:{txt:(}1.29{txt:)}}   {txt}

{txt}1.d87       {res}        0.174***            0           0.135   {txt}
            {res} {ralign 12:{txt:(}3.52{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}1.66{txt:)}}   {txt}

{txt}_cons       {res}       0.0921           1.028***       0.0236   {txt}
            {res} {ralign 12:{txt:(}1.18{txt:)}}    {ralign 12:{txt:(}34.31{txt:)}}    {ralign 12:{txt:(}0.16{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}         4360            4360            4360   {txt}
{txt}{hline 60}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_32
. display (exp(.108)-1)*100
{res}11.404775
{txt}
{com}. display (exp(.0467)-1)*100
{res}4.780762
{txt}
{com}. display (exp(.064)-1)*100
{res}6.6092399
{txt}
{com}. //_33
. quietly reg lwage educ i.black i.hisp exper expersq married union i.d8*
{txt}
{com}. estimates store pooled
{txt}
{com}. quietly xtreg lwage educ i.black i.hisp exper expersq married union i.d8*, fe
{txt}
{com}. estimates store fe
{txt}
{com}. quietly xtreg lwage educ i.black i.hisp exper expersq married union i.d8*, re theta
{txt}
{com}. estimates store re
{txt}
{com}. coefplot ///
> (pooled, label("{c -(}bf:Pooled OLS{c )-}") mcolor(midblue) mlcolor(cyan) ///
>   ciopts(lcolor(magenta midblue))) /// options for first group
> (fe, label("{c -(}bf: Within{c )-}") mcolor(green) mlcolor(lime) ///
>   ciopts(lcolor(lime green))) /// options for second group
> (re, label("{c -(}bf: Random Effects{c )-}") mcolor(yellow) mlcolor(gold) ///
>   ciopts(lcolor(gold yellow))), /// options for third group
>   title("Returns to Marriage for Men") ///
>   keep(married) ///
>   xline(0, lcolor(red) lpattern(dash) lwidth(medium)) scheme(jet_white) ///
>   xtitle("{c -(}bf: Coefficients{c )-}") ///
>   graphregion(margin(small)) ///
>   coeflabels(married="Married") ///
>   msize(large) mcolor(%85) mlwidth(medium) msymbol(circle) /// marker options
>   levels(95 90) ciopts(lwidth(medthick thick) recast(rspike rcap)) ///ci options for all groups
>   legend(ring(1) col(1) pos(3) size(medsmall))
{res}{txt}(note: scheme jet_white not found, using s2color)
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week4_married_returns.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week4_married_returns.png written in PNG format)

{com}. //_34
. use "rental.dta", clear
{txt}
{com}. //_35
. xtset city year, delta(10)
{res}{txt}{col 8}panel variable:  {res}city (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 80 to 90
{txt}{col 17}delta:  {res}10 units
{txt}
{com}. //_36
. reg lrent i.y90 lpop lavginc pctstu, robust

{txt}Linear regression                               Number of obs     = {res}       128
                                                {txt}F(4, 123)         =  {res}   223.26
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8613
                                                {txt}Root MSE          =    {res} .12592

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lrent{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.y90 {c |}{col 14}{res}{space 2} .2622267{col 26}{space 2} .0579584{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} .1475017{col 67}{space 3} .3769517
{txt}{space 8}lpop {c |}{col 14}{res}{space 2} .0406863{col 26}{space 2} .0223732{col 37}{space 1}    1.82{col 46}{space 3}0.071{col 54}{space 4}   -.0036{col 67}{space 3} .0849726
{txt}{space 5}lavginc {c |}{col 14}{res}{space 2} .5714461{col 26}{space 2} .0989016{col 37}{space 1}    5.78{col 46}{space 3}0.000{col 54}{space 4} .3756765{col 67}{space 3} .7672157
{txt}{space 6}pctstu {c |}{col 14}{res}{space 2} .0050436{col 26}{space 2} .0011488{col 37}{space 1}    4.39{col 46}{space 3}0.000{col 54}{space 4} .0027696{col 67}{space 3} .0073176
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5688069{col 26}{space 2} .8506229{col 37}{space 1}   -0.67{col 46}{space 3}0.505{col 54}{space 4}-2.252563{col 67}{space 3} 1.114949
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_37
. reg d.lrent i.y90 d.lpop d.lavginc d.pctstu
{p 0 6 2}{txt}note: 1.y90 omitted because of collinearity{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        64
{txt}{hline 13}{c +}{hline 34}   F(3, 60)        = {res}     9.51
{txt}       Model {c |} {res} .231738668         3  .077246223   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .487362198        60  .008122703   {txt}R-squared       ={res}    0.3223
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2884
{txt}       Total {c |} {res} .719100867        63  .011414299   {txt}Root MSE        =   {res} .09013

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     D.lrent{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.y90 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 8}lpop {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0722456{col 26}{space 2} .0883426{col 37}{space 1}    0.82{col 46}{space 3}0.417{col 54}{space 4} -.104466{col 67}{space 3} .2489571
{txt}{space 12} {c |}
{space 5}lavginc {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .3099605{col 26}{space 2} .0664771{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .1769865{col 67}{space 3} .4429346
{txt}{space 12} {c |}
{space 6}pctstu {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0112033{col 26}{space 2} .0041319{col 37}{space 1}    2.71{col 46}{space 3}0.009{col 54}{space 4} .0029382{col 67}{space 3} .0194684
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3855214{col 26}{space 2} .0368245{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .3118615{col 67}{space 3} .4591813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_38
. xtreg lrent i.y90 lpop lavginc pctstu, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       128
{txt}Group variable: {res}city{txt}{col 49}Number of groups{col 67}={col 69}{res}        64

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.9765{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     between = {res}0.2173{col 63}{txt}avg{col 67}={col 69}{res}       2.0
{txt}     overall = {res}0.7597{col 63}{txt}max{col 67}={col 69}{res}         2

{txt}{col 49}F({res}4{txt},{res}60{txt}){col 67}={col 70}{res}   624.15
{txt}corr(u_i, Xb){col 16}= {res}-0.1297{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lrent{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}1.y90 {c |}{col 14}{res}{space 2} .3855214{col 26}{space 2} .0368245{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .3118615{col 67}{space 3} .4591813
{txt}{space 8}lpop {c |}{col 14}{res}{space 2} .0722456{col 26}{space 2} .0883426{col 37}{space 1}    0.82{col 46}{space 3}0.417{col 54}{space 4} -.104466{col 67}{space 3} .2489571
{txt}{space 5}lavginc {c |}{col 14}{res}{space 2} .3099605{col 26}{space 2} .0664771{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .1769865{col 67}{space 3} .4429346
{txt}{space 6}pctstu {c |}{col 14}{res}{space 2} .0112033{col 26}{space 2} .0041319{col 37}{space 1}    2.71{col 46}{space 3}0.009{col 54}{space 4} .0029382{col 67}{space 3} .0194684
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.409384{col 26}{space 2} 1.167238{col 37}{space 1}    1.21{col 46}{space 3}0.232{col 54}{space 4}-.9254394{col 67}{space 3} 3.744208
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .15905877
     {txt}sigma_e {c |} {res} .06372873
         {txt}rho {c |} {res}  .8616755{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}63{txt}, {res}60{txt}) = {res}6.67{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_39
. use "airfare.dta", clear
{txt}
{com}. //_40
. reg lfare concen ldist ldistsq i.y99 i.y00

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,596
{txt}{hline 13}{c +}{hline 34}   F(5, 4590)      = {res}   627.18
{txt}       Model {c |} {res} 355.197587         5  71.0395174   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 519.896787     4,590  .113267274   {txt}R-squared       ={res}    0.4059
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4052
{txt}       Total {c |} {res} 875.094374     4,595  .190444913   {txt}Root MSE        =   {res} .33655

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lfare{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}concen {c |}{col 14}{res}{space 2} .3609856{col 26}{space 2} .0300677{col 37}{space 1}   12.01{col 46}{space 3}0.000{col 54}{space 4} .3020384{col 67}{space 3} .4199327
{txt}{space 7}ldist {c |}{col 14}{res}{space 2}-.9018838{col 26}{space 2} .1282905{col 37}{space 1}   -7.03{col 46}{space 3}0.000{col 54}{space 4}-1.153395{col 67}{space 3}-.6503727
{txt}{space 5}ldistsq {c |}{col 14}{res}{space 2} .1030514{col 26}{space 2} .0097268{col 37}{space 1}   10.59{col 46}{space 3}0.000{col 54}{space 4} .0839822{col 67}{space 3} .1221207
{txt}{space 7}1.y99 {c |}{col 14}{res}{space 2} .0272979{col 26}{space 2} .0121656{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0034475{col 67}{space 3} .0511483
{txt}{space 7}1.y00 {c |}{col 14}{res}{space 2} .0893211{col 26}{space 2}  .012169{col 37}{space 1}    7.34{col 46}{space 3}0.000{col 54}{space 4} .0654641{col 67}{space 3} .1131782
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.219743{col 26}{space 2} .4206248{col 37}{space 1}   14.79{col 46}{space 3}0.000{col 54}{space 4} 5.395116{col 67}{space 3}  7.04437
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_41
. sum concen

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}concen {c |}{res}      4,596    .6101149     .196435      .1605          1
{txt}
{com}. //_42
. xtset id year
{res}{txt}{col 8}panel variable:  {res}id (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1997 to 2000
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. //_43
. xtreg lfare concen ldist ldistsq i.y99 i.y00, re theta
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     4,596
{txt}Group variable: {res}id                              {txt}Number of groups  = {res}     1,149

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1282                                         {txt}min = {res}         4
{txt}     between = {res}0.4179                                         {txt}avg = {res}       4.0
{txt}     overall = {res}0.4030                                         {txt}max = {res}         4

                                                {txt}Wald chi2({res}5{txt})      =  {res}  1331.49
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000
{txt}theta          = {res}.83489895

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lfare{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}concen {c |}{col 14}{res}{space 2}  .216343{col 26}{space 2} .0265686{col 37}{space 1}    8.14{col 46}{space 3}0.000{col 54}{space 4} .1642694{col 67}{space 3} .2684166
{txt}{space 7}ldist {c |}{col 14}{res}{space 2}-.8544998{col 26}{space 2} .2464622{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-1.337557{col 67}{space 3}-.3714428
{txt}{space 5}ldistsq {c |}{col 14}{res}{space 2} .0977308{col 26}{space 2} .0186343{col 37}{space 1}    5.24{col 46}{space 3}0.000{col 54}{space 4} .0612083{col 67}{space 3} .1342532
{txt}{space 7}1.y99 {c |}{col 14}{res}{space 2} .0255419{col 26}{space 2} .0038794{col 37}{space 1}    6.58{col 46}{space 3}0.000{col 54}{space 4} .0179385{col 67}{space 3} .0331454
{txt}{space 7}1.y00 {c |}{col 14}{res}{space 2} .0870883{col 26}{space 2} .0038876{col 37}{space 1}   22.40{col 46}{space 3}0.000{col 54}{space 4} .0794686{col 67}{space 3} .0947079
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.232589{col 26}{space 2} .8098919{col 37}{space 1}    7.70{col 46}{space 3}0.000{col 54}{space 4}  4.64523{col 67}{space 3} 7.819948
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .31930578
     {txt}sigma_e {c |} {res}  .1069025
         {txt}rho {c |} {res} .89920879{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. //_44
. xtreg lfare concen ldist ldistsq i.y99 i.y00, fe
{p 0 6 2}{txt}note: ldist omitted because of collinearity{p_end}
{p 0 6 2}note: ldistsq omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     4,596
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     1,149

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1286{col 63}{txt}min{col 67}={col 69}{res}         4
{txt}     between = {res}0.0576{col 63}{txt}avg{col 67}={col 69}{res}       4.0
{txt}     overall = {res}0.0102{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}3{txt},{res}3444{txt}){col 67}={col 70}{res}   169.47
{txt}corr(u_i, Xb){col 16}= {res}-0.2143{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lfare{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}concen {c |}{col 14}{res}{space 2}  .177761{col 26}{space 2} .0294665{col 37}{space 1}    6.03{col 46}{space 3}0.000{col 54}{space 4} .1199873{col 67}{space 3} .2355346
{txt}{space 7}ldist {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}ldistsq {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}1.y99 {c |}{col 14}{res}{space 2} .0250736{col 26}{space 2} .0038791{col 37}{space 1}    6.46{col 46}{space 3}0.000{col 54}{space 4}  .017468{col 67}{space 3} .0326791
{txt}{space 7}1.y00 {c |}{col 14}{res}{space 2} .0864927{col 26}{space 2} .0038892{col 37}{space 1}   22.24{col 46}{space 3}0.000{col 54}{space 4} .0788673{col 67}{space 3} .0941181
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.959254{col 26}{space 2} .0183174{col 37}{space 1}  270.74{col 46}{space 3}0.000{col 54}{space 4}  4.92334{col 67}{space 3} 4.995168
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .43441394
     {txt}sigma_e {c |} {res}  .1069025
         {txt}rho {c |} {res} .94290028{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}1148{txt}, {res}3444{txt}) = {res}60.09{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_45
. cd "/Users/Sam/Desktop/Econ 645/Data/Mitchell"
{res}/Users/Sam/Desktop/Econ 645/Data/Mitchell
{txt}
{com}. //_46
. use wws, clear
{txt}(Working Women Survey)

{com}. //_47
. summarize wage

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}      2,246    288.2885    9595.692          0     380000
{txt}
{com}. //_48
. list id wage if wage > 1000
{txt}
      {c TLC}{hline 8}{c -}{hline 8}{c TRC}
      {c |} {res}idcode     wage {txt}{c |}
      {c LT}{hline 8}{c -}{hline 8}{c RT}
 893. {c |} {res}  3145   380000 {txt}{c |}
1241. {c |} {res}  2341   250000 {txt}{c |}
      {c BLC}{hline 8}{c -}{hline 8}{c BRC}

{com}. //_49
. histogram wage if wage < 1000
{txt}(bin={res}33{txt}, start={res}0{txt}, width={res}1.2347451{txt})
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week4_wages_hist.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week4_wages_hist.png written in PNG format)

{com}. //_50
. summarize hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}hours {c |}{res}      2,242    37.21811    10.50914          1         80
{txt}
{com}. //_51
. histogram hours
{txt}(bin={res}33{txt}, start={res}1{txt}, width={res}2.3939394{txt})
{res}{txt}
{com}. //_52
. gen weekwage = wage*hours
{txt}(4 missing values generated)

{com}. //_53
. summarize weekwage, detail

                          {txt}weekwage
{hline 61}
      Percentiles      Smallest
 1%    {res} 18.01074              0
{txt} 5%    {res} 61.99676        4.64573
{txt}10%    {res} 85.02411       6.038647       {txt}Obs         {res}      2,242
{txt}25%    {res} 146.3211        8.05153       {txt}Sum of Wgt. {res}      2,242

{txt}50%    {res}  241.401                      {txt}Mean          {res} 11539.95
                        {txt}Largest       Std. Dev.     {res} 384170.1
{txt}75%    {res} 385.5072       1607.924
{txt}90%    {res} 526.4493           1920       {txt}Variance      {res} 1.48e+11
{txt}95%    {res}  681.159       1.00e+07       {txt}Skewness      {res} 35.42672
{txt}99%    {res} 1607.923       1.52e+07       {txt}Kurtosis      {res} 1294.728
{txt}
{com}. //_54
. list id weekwage if weekwage > 80000
{txt}
      {c TLC}{hline 8}{c -}{hline 10}{c TRC}
      {c |} {res}idcode   weekwage {txt}{c |}
      {c LT}{hline 8}{c -}{hline 10}{c RT}
  19. {c |} {res}  5111          . {txt}{c |}
 372. {c |} {res}  4324          . {txt}{c |}
 804. {c |} {res}  3318          . {txt}{c |}
 893. {c |} {res}  3145   15200000 {txt}{c |}
1139. {c |} {res}  2583          . {txt}{c |}
      {c LT}{hline 8}{c -}{hline 10}{c RT}
1241. {c |} {res}  2341   10000000 {txt}{c |}
      {c BLC}{hline 8}{c -}{hline 10}{c BRC}

{com}. //_55
. histogram weekwage if weekwage < 80000 
{txt}(bin={res}33{txt}, start={res}0{txt}, width={res}58.181818{txt})
{res}{txt}
{com}. //_56
. drop weekwage
{txt}
{com}. //_57
. gen weekwage = wage*hours, after(wage)
{txt}(4 missing values generated)

{com}. //_58
. tabulate married nevermarried

           {txt}{c |}   Woman never been
           {c |}        married
   married {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       570        234 {txt}{c |}{res}       804 
{txt}         1 {c |}{res}     1,440          2 {txt}{c |}{res}     1,442 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     2,010        236 {txt}{c |}{res}     2,246 

{txt}
{com}. //_59
. gen maritalstatus = .
{txt}(2,246 missing values generated)

{com}. //_60
. replace maritalstatus = 1 if married==0 & nevermarried==1
{txt}(234 real changes made)

{com}. replace maritalstatus = 2 if married==1 & nevermarried==0
{txt}(1,440 real changes made)

{com}. replace maritalstatus = 3 if married==0 & nevermarried==0
{txt}(570 real changes made)

{com}. //_61
. tabulate maritalstatus

{txt}maritalstat {c |}
         us {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        234       10.43       10.43
{txt}          2 {c |}{res}      1,440       64.17       74.60
{txt}          3 {c |}{res}        570       25.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,244      100.00
{txt}
{com}. table maritalstatus married nevermarried

{txt}{hline 10}{c TT}{hline 29}
          {c |} Woman never been married and
          {c |}           married           
maritalst {c |} {hline 5} 0 {hline 4}    {hline 5} 1 {hline 4}
atus      {c |}     0      1        0      1
{hline 10}{c +}{hline 29}
        1 {c |}      {res}             234       
        {txt}2 {c |}      {res}  1,440                
        {txt}3 {c |}   {res}570                       
{txt}{hline 10}{c BT}{hline 29}

{com}. //_62
. label define maritalstatus1 1 "Single" 2 "Married" 3 "Divorced or Widowed"
{txt}
{com}. label values maritalstatus maritalstatus1
{txt}
{com}. label variable maritalstatus "Marital Status"
{txt}
{com}. tabulate maritalstatus

     {txt}Marital Status {c |}      Freq.     Percent        Cum.
{hline 20}{c +}{hline 35}
             Single {c |}{res}        234       10.43       10.43
{txt}            Married {c |}{res}      1,440       64.17       74.60
{txt}Divorced or Widowed {c |}{res}        570       25.40      100.00
{txt}{hline 20}{c +}{hline 35}
              Total {c |}{res}      2,244      100.00
{txt}
{com}. //_63
. generate over40hours = .
{txt}(2,246 missing values generated)

{com}. replace over40hours = 0 if hours <= 40
{txt}(1,852 real changes made)

{com}. //_64
. replace over40hours = 1 if hours > 40 & hours < 99999
{txt}(390 real changes made)

{com}. //_65
. display int(10.65)
{res}10
{txt}
{com}. display round(10.65,1)
{res}11
{txt}
{com}. //_66
. display ln(10.65)
{res}2.3655599
{txt}
{com}. display log10(10.65)
{res}1.0273496
{txt}
{com}. display sqrt(10.65)
{res}3.2634338
{txt}
{com}. //_67
. set seed 12345
{txt}
{com}. //_68
. gen runiformtest = runiform()
{txt}
{com}. summarize runiformtest

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
runiformtest {c |}{res}      2,246    .4924636    .2875376   .0007583   .9985869
{txt}
{com}. //_69
. gen rnormaltest = rnormal()
{txt}
{com}. gen rnormaltest2 = rnormal(100,15)
{txt}
{com}. summarize rnormaltest rnormaltest2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}rnormaltest {c |}{res}      2,246     .018436    .9857847  -3.389103   3.372525
{txt}rnormaltest2 {c |}{res}      2,246    99.70718    14.77732   47.81653   154.2297
{txt}
{com}. //_70
. gen rchi2test = rchi2(5)
{txt}
{com}. summarize rchi2test

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}rchi2test {c |}{res}      2,246    5.063639    3.322998   .1102785   29.24291
{txt}
{com}. //_71
. help string functions
{txt}
{com}. //_72
. use "authors.dta", clear
{txt}
{com}. //_73
. format name %-17s
{txt}
{com}. //_74
. list name 
{txt}
     {c TLC}{hline 22}{c TRC}
     {c |} {res}name                 {txt}{c |}
     {c LT}{hline 22}{c RT}
  1. {c |} {res} Ruth Canaale        {txt}{c |}
  2. {c |} {res}Y. Don Uflossmore    {txt}{c |}
  3. {c |} {res}thch nht hnh      {txt}{c |}
  4. {c |} {res}J. Carreo Quiones  {txt}{c |}
  5. {c |} {res} Knausgrd          {txt}{c |}
     {c LT}{hline 22}{c RT}
  6. {c |} {res}Don b Iteme          {txt}{c |}
  7. {c |} {res}isaac O'yerbreath    {txt}{c |}
  8. {c |} {res}Mike avity           {txt}{c |}
  9. {c |} {res}     MILE ZOLA      {txt}{c |}
 10. {c |} {res}i William Crown      {txt}{c |}
     {c LT}{hline 22}{c RT}
 11. {c |} {res}Ott W. Onthurt       {txt}{c |}
 12. {c |} {res}Olive Tu'Drill       {txt}{c |}
 13. {c |} {res}bjrk gumundsdttir {txt}{c |}
     {c BLC}{hline 22}{c BRC}

{com}. //_75
. generate name2 = ustrtitle(name)
{txt}
{com}. generate lowname = ustrlower(name)
{txt}
{com}. generate upname = ustrupper(name)
{txt}
{com}. //_76
. format name2 lowname upname %-23s
{txt}
{com}. list name2 lowname upname
{txt}
     {c TLC}{hline 22}{c -}{hline 22}{c -}{hline 22}{c TRC}
     {c |} {res}name2                  lowname                upname               {txt}{c |}
     {c LT}{hline 22}{c -}{hline 22}{c -}{hline 22}{c RT}
  1. {c |} {res} Ruth Canaale           ruth canaale           RUTH CANAALE        {txt}{c |}
  2. {c |} {res}Y. Don Uflossmore      y. don uflossmore      Y. DON UFLOSSMORE    {txt}{c |}
  3. {c |} {res}Thch Nht Hnh        thch nht hnh        THCH NHT HNH      {txt}{c |}
  4. {c |} {res}J. Carreo Quiones    j. carreo quiones    J. CARREO QUIONES  {txt}{c |}
  5. {c |} {res} Knausgrd             knausgrd             KNAUSGRD          {txt}{c |}
     {c LT}{hline 22}{c -}{hline 22}{c -}{hline 22}{c RT}
  6. {c |} {res}Don B Iteme            don b iteme            DON B ITEME          {txt}{c |}
  7. {c |} {res}Isaac O'yerbreath      isaac o'yerbreath      ISAAC O'YERBREATH    {txt}{c |}
  8. {c |} {res}Mike Avity             mike avity             MIKE AVITY           {txt}{c |}
  9. {c |} {res}     mile Zola             mile zola             MILE ZOLA      {txt}{c |}
 10. {c |} {res}I William Crown        i william crown        I WILLIAM CROWN      {txt}{c |}
     {c LT}{hline 22}{c -}{hline 22}{c -}{hline 22}{c RT}
 11. {c |} {res}Ott W. Onthurt         ott w. onthurt         OTT W. ONTHURT       {txt}{c |}
 12. {c |} {res}Olive Tu'drill         olive tu'drill         OLIVE TU'DRILL       {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir   bjrk gumundsdttir   BJRK GUMUNDSDTTIR {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 22}{c -}{hline 22}{c BRC}

{com}. //_77
. generate name3 = ustrltrim(name2)
{txt}
{com}. format name2 name3 %-17s
{txt}
{com}. list name name2 name3
{txt}
     {c TLC}{hline 22}{c -}{hline 22}{c -}{hline 22}{c TRC}
     {c |} {res}name                   name2                  name3                {txt}{c |}
     {c LT}{hline 22}{c -}{hline 22}{c -}{hline 22}{c RT}
  1. {c |} {res} Ruth Canaale           Ruth Canaale          Ruth Canaale         {txt}{c |}
  2. {c |} {res}Y. Don Uflossmore      Y. Don Uflossmore      Y. Don Uflossmore    {txt}{c |}
  3. {c |} {res}thch nht hnh        Thch Nht Hnh        Thch Nht Hnh      {txt}{c |}
  4. {c |} {res}J. Carreo Quiones    J. Carreo Quiones    J. Carreo Quiones  {txt}{c |}
  5. {c |} {res} Knausgrd             Knausgrd             Knausgrd          {txt}{c |}
     {c LT}{hline 22}{c -}{hline 22}{c -}{hline 22}{c RT}
  6. {c |} {res}Don b Iteme            Don B Iteme            Don B Iteme          {txt}{c |}
  7. {c |} {res}isaac O'yerbreath      Isaac O'yerbreath      Isaac O'yerbreath    {txt}{c |}
  8. {c |} {res}Mike avity             Mike Avity             Mike Avity           {txt}{c |}
  9. {c |} {res}     MILE ZOLA             mile Zola        mile Zola           {txt}{c |}
 10. {c |} {res}i William Crown        I William Crown        I William Crown      {txt}{c |}
     {c LT}{hline 22}{c -}{hline 22}{c -}{hline 22}{c RT}
 11. {c |} {res}Ott W. Onthurt         Ott W. Onthurt         Ott W. Onthurt       {txt}{c |}
 12. {c |} {res}Olive Tu'Drill         Olive Tu'drill         Olive Tu'drill       {txt}{c |}
 13. {c |} {res}bjrk gumundsdttir   Bjrk Gumundsdttir   Bjrk Gumundsdttir {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 22}{c -}{hline 22}{c BRC}

{com}. //_78
. display substr("abcdef",2,3)
{res}bcd
{txt}
{com}. //_79
. gen secondchar = substr(name3,2,1)
{txt}
{com}. gen firstinit = (secondchar == " " | secondchar == ".") if !missing(secondchar)
{txt}
{com}. list name3 secondchar firstinit
{txt}
     {c TLC}{hline 22}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}name3                  second~r   firsti~t {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}Ruth Canaale                  u          0 {txt}{c |}
  2. {c |} {res}Y. Don Uflossmore             .          1 {txt}{c |}
  3. {c |} {res}Thch Nht Hnh               h          0 {txt}{c |}
  4. {c |} {res}J. Carreo Quiones           .          1 {txt}{c |}
  5. {c |} {res} Knausgrd                             0 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res}Don B Iteme                   o          0 {txt}{c |}
  7. {c |} {res}Isaac O'yerbreath             s          0 {txt}{c |}
  8. {c |} {res}Mike Avity                    i          0 {txt}{c |}
  9. {c |} {res}mile Zola                              0 {txt}{c |}
 10. {c |} {res}I William Crown                          1 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c -}{hline 10}{c RT}
 11. {c |} {res}Ott W. Onthurt                t          0 {txt}{c |}
 12. {c |} {res}Olive Tu'drill                l          0 {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir          j          0 {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_80
. generate namecount = ustrwordcount(name3)
{txt}
{com}. list name3 namecount
{txt}
     {c TLC}{hline 22}{c -}{hline 10}{c TRC}
     {c |} {res}name3                  nameco~t {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c RT}
  1. {c |} {res}Ruth Canaale                  2 {txt}{c |}
  2. {c |} {res}Y. Don Uflossmore             4 {txt}{c |}
  3. {c |} {res}Thch Nht Hnh               3 {txt}{c |}
  4. {c |} {res}J. Carreo Quiones           4 {txt}{c |}
  5. {c |} {res} Knausgrd                   2 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c RT}
  6. {c |} {res}Don B Iteme                   3 {txt}{c |}
  7. {c |} {res}Isaac O'yerbreath             2 {txt}{c |}
  8. {c |} {res}Mike Avity                    2 {txt}{c |}
  9. {c |} {res}mile Zola                    2 {txt}{c |}
 10. {c |} {res}I William Crown               3 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c RT}
 11. {c |} {res}Ott W. Onthurt                4 {txt}{c |}
 12. {c |} {res}Olive Tu'drill                2 {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir          2 {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. //_81
. generate uname1=ustrword(name3,1)
{txt}
{com}. generate uname2=ustrword(name3,2)
{txt}
{com}. generate uname3=ustrword(name3,3)
{txt}(7 missing values generated)

{com}. generate uname4=ustrword(name3,4)
{txt}(10 missing values generated)

{com}. //_82
. list name3 uname1 uname2 uname3 uname4 namecount
{txt}
     {c TLC}{hline 22}{c -}{hline 8}{c -}{hline 16}{c -}{hline 9}{c -}{hline 12}{c -}{hline 10}{c TRC}
     {c |} {res}name3                  uname1           uname2    uname3       uname4   nameco~t {txt}{c |}
     {c LT}{hline 22}{c -}{hline 8}{c -}{hline 16}{c -}{hline 9}{c -}{hline 12}{c -}{hline 10}{c RT}
  1. {c |} {res}Ruth Canaale             Ruth          Canaale                                 2 {txt}{c |}
  2. {c |} {res}Y. Don Uflossmore           Y                .       Don   Uflossmore          4 {txt}{c |}
  3. {c |} {res}Thch Nht Hnh         Thch             Nht      Hnh                       3 {txt}{c |}
  4. {c |} {res}J. Carreo Quiones         J                .   Carreo     Quiones          4 {txt}{c |}
  5. {c |} {res} Knausgrd                         Knausgrd                                 2 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 8}{c -}{hline 16}{c -}{hline 9}{c -}{hline 12}{c -}{hline 10}{c RT}
  6. {c |} {res}Don B Iteme               Don                B     Iteme                       3 {txt}{c |}
  7. {c |} {res}Isaac O'yerbreath       Isaac      O'yerbreath                                 2 {txt}{c |}
  8. {c |} {res}Mike Avity               Mike            Avity                                 2 {txt}{c |}
  9. {c |} {res}mile Zola              mile             Zola                                 2 {txt}{c |}
 10. {c |} {res}I William Crown             I          William     Crown                       3 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 8}{c -}{hline 16}{c -}{hline 9}{c -}{hline 12}{c -}{hline 10}{c RT}
 11. {c |} {res}Ott W. Onthurt            Ott                W         .      Onthurt          4 {txt}{c |}
 12. {c |} {res}Olive Tu'drill          Olive         Tu'drill                                 2 {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir    Bjrk   Gumundsdttir                                 2 {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 8}{c -}{hline 16}{c -}{hline 9}{c -}{hline 12}{c -}{hline 10}{c BRC}

{com}. //_83
. generate name4 = usubinstr(name3,".","",.)
{txt}
{com}. replace namecount = ustrwordcount(name4)
{txt}(3 real changes made)

{com}. list name4 namecount
{txt}
     {c TLC}{hline 22}{c -}{hline 10}{c TRC}
     {c |} {res}               name4   nameco~t {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c RT}
  1. {c |} {res}        Ruth Canaale          2 {txt}{c |}
  2. {c |} {res}    Y Don Uflossmore          3 {txt}{c |}
  3. {c |} {res}     Thch Nht Hnh          3 {txt}{c |}
  4. {c |} {res}  J Carreo Quiones          3 {txt}{c |}
  5. {c |} {res}          Knausgrd          2 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c RT}
  6. {c |} {res}         Don B Iteme          3 {txt}{c |}
  7. {c |} {res}   Isaac O'yerbreath          2 {txt}{c |}
  8. {c |} {res}          Mike Avity          2 {txt}{c |}
  9. {c |} {res}          mile Zola          2 {txt}{c |}
 10. {c |} {res}     I William Crown          3 {txt}{c |}
     {c LT}{hline 22}{c -}{hline 10}{c RT}
 11. {c |} {res}       Ott W Onthurt          3 {txt}{c |}
 12. {c |} {res}      Olive Tu'drill          2 {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir          2 {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 10}{c BRC}

{com}. //_84
. gen fname = ustrword(name4,1)
{txt}
{com}. gen mname = ustrword(name4,2) if namecount==3
{txt}(7 missing values generated)

{com}. gen lname = ustrword(name4,namecount)
{txt}
{com}. format fname mname lname %-15s
{txt}
{com}. list name4 fname mname lname
{txt}
     {c TLC}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c TRC}
     {c |} {res}               name4   fname   mname     lname          {txt}{c |}
     {c LT}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c RT}
  1. {c |} {res}        Ruth Canaale   Ruth              Canaale        {txt}{c |}
  2. {c |} {res}    Y Don Uflossmore   Y       Don       Uflossmore     {txt}{c |}
  3. {c |} {res}     Thch Nht Hnh   Thch   Nht      Hnh           {txt}{c |}
  4. {c |} {res}  J Carreo Quiones   J       Carreo   Quiones       {txt}{c |}
  5. {c |} {res}          Knausgrd                    Knausgrd      {txt}{c |}
     {c LT}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c RT}
  6. {c |} {res}         Don B Iteme   Don     B         Iteme          {txt}{c |}
  7. {c |} {res}   Isaac O'yerbreath   Isaac             O'yerbreath    {txt}{c |}
  8. {c |} {res}          Mike Avity   Mike              Avity          {txt}{c |}
  9. {c |} {res}          mile Zola   mile             Zola           {txt}{c |}
 10. {c |} {res}     I William Crown   I       William   Crown          {txt}{c |}
     {c LT}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c RT}
 11. {c |} {res}       Ott W Onthurt   Ott     W         Onthurt        {txt}{c |}
 12. {c |} {res}      Olive Tu'drill   Olive             Tu'drill       {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir   Bjrk             Gumundsdttir {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c BRC}

{com}. //_85
. replace fname=fname + "." if ustrlen(fname)==1
{txt}(4 real changes made)

{com}. replace mname=mname + "." if ustrlen(mname)==1
{txt}(2 real changes made)

{com}. list fname mname
{txt}
     {c TLC}{hline 7}{c -}{hline 9}{c TRC}
     {c |} {res}fname   mname   {txt}{c |}
     {c LT}{hline 7}{c -}{hline 9}{c RT}
  1. {c |} {res}Ruth            {txt}{c |}
  2. {c |} {res}Y.      Don     {txt}{c |}
  3. {c |} {res}Thch   Nht    {txt}{c |}
  4. {c |} {res}J.      Carreo {txt}{c |}
  5. {c |} {res}.              {txt}{c |}
     {c LT}{hline 7}{c -}{hline 9}{c RT}
  6. {c |} {res}Don     B.      {txt}{c |}
  7. {c |} {res}Isaac           {txt}{c |}
  8. {c |} {res}Mike            {txt}{c |}
  9. {c |} {res}mile           {txt}{c |}
 10. {c |} {res}I.      William {txt}{c |}
     {c LT}{hline 7}{c -}{hline 9}{c RT}
 11. {c |} {res}Ott     W.      {txt}{c |}
 12. {c |} {res}Olive           {txt}{c |}
 13. {c |} {res}Bjrk           {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 9}{c BRC}

{com}. //_86
. gen mlen = ustrlen(mname)
{txt}
{com}. gen flen = ustrlen(fname)
{txt}
{com}. gen fullname = fname + " " + lname if namecount == 2
{txt}(6 missing values generated)

{com}. replace fullname = fname + " " + mname + " " + lname if namecount==3 & mlen > 2
{txt}(4 real changes made)

{com}. replace fullname = fname + " " + mname + " " + lname if namecount==3 & mlen==2
{txt}(2 real changes made)

{com}. replace fullname = mname + " " + fname + " " + lname if namecount==3 & flen==2
{txt}(3 real changes made)

{com}. list fullname fname mname lname
{txt}
     {c TLC}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c TRC}
     {c |} {res}            fullname   fname   mname     lname          {txt}{c |}
     {c LT}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c RT}
  1. {c |} {res}        Ruth Canaale   Ruth              Canaale        {txt}{c |}
  2. {c |} {res}   Don Y. Uflossmore   Y.      Don       Uflossmore     {txt}{c |}
  3. {c |} {res}     Thch Nht Hnh   Thch   Nht      Hnh           {txt}{c |}
  4. {c |} {res} Carreo J. Quiones   J.      Carreo   Quiones       {txt}{c |}
  5. {c |} {res}        . Knausgrd   .                Knausgrd      {txt}{c |}
     {c LT}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c RT}
  6. {c |} {res}        Don B. Iteme   Don     B.        Iteme          {txt}{c |}
  7. {c |} {res}   Isaac O'yerbreath   Isaac             O'yerbreath    {txt}{c |}
  8. {c |} {res}          Mike Avity   Mike              Avity          {txt}{c |}
  9. {c |} {res}          mile Zola   mile             Zola           {txt}{c |}
 10. {c |} {res}    William I. Crown   I.      William   Crown          {txt}{c |}
     {c LT}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c RT}
 11. {c |} {res}      Ott W. Onthurt   Ott     W.        Onthurt        {txt}{c |}
 12. {c |} {res}      Olive Tu'drill   Olive             Tu'drill       {txt}{c |}
 13. {c |} {res}Bjrk Gumundsdttir   Bjrk             Gumundsdttir {txt}{c |}
     {c BLC}{hline 22}{c -}{hline 7}{c -}{hline 9}{c -}{hline 16}{c BRC}

{com}. //_87
. use "wws2lab.dta", clear
{txt}(Working Women Survey w/fixes)

{com}. codebook occupation, tabulate(25)

{txt}{hline}
{res}occupation{right:occupation}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})
{ralign 22:label}:  {res:occlbl}

{col 18}range:  [{res}1{txt},{res}13{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}13{col 51}{txt}missing .:  {res}9{txt}/{res}2,246

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}       319{col 33}       1{col 43}{txt}Professional/technical
{col 21}{res}       264{col 33}       2{col 43}{txt}Managers/admin
{col 21}{res}       725{col 33}       3{col 43}{txt}Sales
{col 21}{res}       101{col 33}       4{col 43}{txt}Clerical/unskilled
{col 21}{res}        53{col 33}       5{col 43}{txt}Craftsmen
{col 21}{res}       246{col 33}       6{col 43}{txt}Operatives
{col 21}{res}        28{col 33}       7{col 43}{txt}Transport
{col 21}{res}       286{col 33}       8{col 43}{txt}Laborers
{col 21}{res}         1{col 33}       9{col 43}{txt}Farmers
{col 21}{res}         9{col 33}      10{col 43}{txt}Farm laborers
{col 21}{res}        16{col 33}      11{col 43}{txt}Service
{col 21}{res}         2{col 33}      12{col 43}{txt}Household workers
{col 21}{res}       187{col 33}      13{col 43}{txt}Other
{col 21}{res}         9{col 33}       .{col 43}
{txt}
{com}. //_88
. recode occupation (1/3=1) (5/8=2) (4 9/13=3), generate(occ3)
{txt}(1918 differences between occupation and occ3)

{com}. tab occupation occ3

                      {txt}{c |}       RECODE of occupation
                      {c |}           (occupation)
           occupation {c |}         1          2          3 {c |}     Total
{hline 22}{c +}{hline 33}{c +}{hline 10}
Professional/technica {c |}{res}       319          0          0 {txt}{c |}{res}       319 
{txt}       Managers/admin {c |}{res}       264          0          0 {txt}{c |}{res}       264 
{txt}                Sales {c |}{res}       725          0          0 {txt}{c |}{res}       725 
{txt}   Clerical/unskilled {c |}{res}         0          0        101 {txt}{c |}{res}       101 
{txt}            Craftsmen {c |}{res}         0         53          0 {txt}{c |}{res}        53 
{txt}           Operatives {c |}{res}         0        246          0 {txt}{c |}{res}       246 
{txt}            Transport {c |}{res}         0         28          0 {txt}{c |}{res}        28 
{txt}             Laborers {c |}{res}         0        286          0 {txt}{c |}{res}       286 
{txt}              Farmers {c |}{res}         0          0          1 {txt}{c |}{res}         1 
{txt}        Farm laborers {c |}{res}         0          0          9 {txt}{c |}{res}         9 
{txt}              Service {c |}{res}         0          0         16 {txt}{c |}{res}        16 
{txt}    Household workers {c |}{res}         0          0          2 {txt}{c |}{res}         2 
{txt}                Other {c |}{res}         0          0        187 {txt}{c |}{res}       187 
{txt}{hline 22}{c +}{hline 33}{c +}{hline 10}
                Total {c |}{res}     1,308        613        316 {txt}{c |}{res}     2,237 

{txt}
{com}. table occupation occ3

{txt}{hline 23}{c TT}{hline 17}
                       {c |}    RECODE of    
                       {c |}    occupation   
                       {c |}   (occupation)  
            occupation {c |}    1     2     3
{hline 23}{c +}{hline 17}
Professional/technical {c |}  {res}319            
        {txt}Managers/admin {c |}  {res}264            
                 {txt}Sales {c |}  {res}725            
    {txt}Clerical/unskilled {c |}     {res}         101
             {txt}Craftsmen {c |}     {res}    53      
            {txt}Operatives {c |}     {res}   246      
             {txt}Transport {c |}     {res}    28      
              {txt}Laborers {c |}     {res}   286      
               {txt}Farmers {c |}     {res}           1
         {txt}Farm laborers {c |}     {res}           9
               {txt}Service {c |}     {res}          16
     {txt}Household workers {c |}     {res}           2
                 {txt}Other {c |}     {res}         187
{txt}{hline 23}{c BT}{hline 17}

{com}. //_89
. drop occ3
{txt}
{com}. recode occupation (1/3= 1 "White Collar") (5/8=2 "Blue Collar") (4 9/12=3 "Other"), generate(occ3)
{txt}(1731 differences between occupation and occ3)

{com}. tab occupation occ3, missing

                      {txt}{c |}           RECODE of occupation (occupation)
           occupation {c |} White Col  Blue Coll      Other         13          . {c |}     Total
{hline 22}{c +}{hline 55}{c +}{hline 10}
Professional/technica {c |}{res}       319          0          0          0          0 {txt}{c |}{res}       319 
{txt}       Managers/admin {c |}{res}       264          0          0          0          0 {txt}{c |}{res}       264 
{txt}                Sales {c |}{res}       725          0          0          0          0 {txt}{c |}{res}       725 
{txt}   Clerical/unskilled {c |}{res}         0          0        101          0          0 {txt}{c |}{res}       101 
{txt}            Craftsmen {c |}{res}         0         53          0          0          0 {txt}{c |}{res}        53 
{txt}           Operatives {c |}{res}         0        246          0          0          0 {txt}{c |}{res}       246 
{txt}            Transport {c |}{res}         0         28          0          0          0 {txt}{c |}{res}        28 
{txt}             Laborers {c |}{res}         0        286          0          0          0 {txt}{c |}{res}       286 
{txt}              Farmers {c |}{res}         0          0          1          0          0 {txt}{c |}{res}         1 
{txt}        Farm laborers {c |}{res}         0          0          9          0          0 {txt}{c |}{res}         9 
{txt}              Service {c |}{res}         0          0         16          0          0 {txt}{c |}{res}        16 
{txt}    Household workers {c |}{res}         0          0          2          0          0 {txt}{c |}{res}         2 
{txt}                Other {c |}{res}         0          0          0        187          0 {txt}{c |}{res}       187 
{txt}                    . {c |}{res}         0          0          0          0          9 {txt}{c |}{res}         9 
{txt}{hline 22}{c +}{hline 55}{c +}{hline 10}
                Total {c |}{res}     1,308        613        129        187          9 {txt}{c |}{res}     2,246 

{txt}
{com}. table occupation occ3, missing

{txt}{hline 23}{c TT}{hline 55}
                       {c |}           RECODE of occupation (occupation)           
            occupation {c |} White Collar   Blue Collar         Other            13
{hline 23}{c +}{hline 55}
Professional/technical {c |}          {res}319             .             .             .
        {txt}Managers/admin {c |}          {res}264             .             .             .
                 {txt}Sales {c |}          {res}725             .             .             .
    {txt}Clerical/unskilled {c |}            {res}.             .           101             .
             {txt}Craftsmen {c |}            {res}.            53             .             .
            {txt}Operatives {c |}            {res}.           246             .             .
             {txt}Transport {c |}            {res}.            28             .             .
              {txt}Laborers {c |}            {res}.           286             .             .
               {txt}Farmers {c |}            {res}.             .             1             .
         {txt}Farm laborers {c |}            {res}.             .             9             .
               {txt}Service {c |}            {res}.             .            16             .
     {txt}Household workers {c |}            {res}.             .             2             .
                 {txt}Other {c |}            {res}.             .             .           187
{txt}{hline 23}{c BT}{hline 55}

{com}. //_90
. summarize wage, detail

                         {txt}hourly wage
{hline 61}
      Percentiles      Smallest
 1%    {res} 1.892108              0
{txt} 5%    {res} 2.801002       1.004952
{txt}10%    {res} 3.220612       1.032247       {txt}Obs         {res}      2,244
{txt}25%    {res} 4.259257       1.151368       {txt}Sum of Wgt. {res}      2,244

{txt}50%    {res}  6.27227                      {txt}Mean          {res} 7.796781
                        {txt}Largest       Std. Dev.     {res}  5.82459
{txt}75%    {res} 9.657809       40.19808
{txt}90%    {res} 12.77777       40.19808       {txt}Variance      {res} 33.92584
{txt}95%    {res} 16.72241       40.19808       {txt}Skewness      {res} 3.078195
{txt}99%    {res} 38.70926       40.74659       {txt}Kurtosis      {res} 15.58899
{txt}
{com}. //_91
. egen wage3 = cut(wage), at(0,4,6,9,12)
{txt}(278 missing values generated)

{com}. egen wage4 = cut(wage), group(3)
{txt}(2 missing values generated)

{com}. tabstat wage, by(wage3)

{txt}Summary for variables: wage
{col 6}by categories of: wage3 

{ralign 8:wage3} {...}
{c |}      mean
{hline 9}{c +}{hline 10}
{ralign 8:0} {...}
{c |}{...}
 {res} 3.085733
{txt}{ralign 8:4} {...}
{c |}{...}
 {res} 4.918866
{txt}{ralign 8:6} {...}
{c |}{...}
 {res} 7.327027
{txt}{ralign 8:9} {...}
{c |}{...}
 {res} 10.40792
{txt}{hline 9}{c +}{hline 10}
{ralign 8:Total} {...}
{c |}{...}
 {res} 6.188629
{txt}{hline 9}{c BT}{hline 10}

{com}. tabstat wage, by(wage4)

{txt}Summary for variables: wage
{col 6}by categories of: wage4 

{ralign 8:wage4} {...}
{c |}      mean
{hline 9}{c +}{hline 10}
{ralign 8:0} {...}
{c |}{...}
 {res} 3.633853
{txt}{ralign 8:1} {...}
{c |}{...}
 {res} 6.374262
{txt}{ralign 8:2} {...}
{c |}{...}
 {res} 13.38223
{txt}{hline 9}{c +}{hline 10}
{ralign 8:Total} {...}
{c |}{...}
 {res} 7.796781
{txt}{hline 9}{c BT}{hline 10}

{com}. //_92
. infile id age pl1-pl5 bp1-bp5 using "cardio2miss.txt", clear
{txt}(5 observations read)

{com}. list
{txt}
     {c TLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c TRC}
     {c |} {res}id   age   pl1   pl2   pl3   pl4   pl5   bp1   bp2   bp3   bp4   bp5 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c RT}
  1. {c |} {res} 1    40    54   115    87    86    93   129    81   105    -2    -2 {txt}{c |}
  2. {c |} {res} 2    30    92   123    88   136   125   107    87   111    58   120 {txt}{c |}
  3. {c |} {res} 3    16   105    -1    97   122   128   101    57   109    68   112 {txt}{c |}
  4. {c |} {res} 4    23    52   105    79   115    71   121   106   129    39   137 {txt}{c |}
  5. {c |} {res} 5    18    70   116    -1   128    52   112    68   125    59   111 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c BRC}

{com}. //_93
. mvdecode bp* pl*, mv(-1 -2)
         {txt}bp4:{res}{col 15}1{txt} missing value generated
         bp5:{res}{col 15}1{txt} missing value generated
         pl2:{res}{col 15}1{txt} missing value generated
         pl3:{res}{col 15}1{txt} missing value generated

{com}. list
{txt}
     {c TLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c TRC}
     {c |} {res}id   age   pl1   pl2   pl3   pl4   pl5   bp1   bp2   bp3   bp4   bp5 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c RT}
  1. {c |} {res} 1    40    54   115    87    86    93   129    81   105     .     . {txt}{c |}
  2. {c |} {res} 2    30    92   123    88   136   125   107    87   111    58   120 {txt}{c |}
  3. {c |} {res} 3    16   105     .    97   122   128   101    57   109    68   112 {txt}{c |}
  4. {c |} {res} 4    23    52   105    79   115    71   121   106   129    39   137 {txt}{c |}
  5. {c |} {res} 5    18    70   116     .   128    52   112    68   125    59   111 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c BRC}

{com}. //_94
. use "wws2lab.dta", clear
{txt}(Working Women Survey w/fixes)

{com}. //_95
. codebook grade4

{txt}{hline}
{res}grade4{right:4 level Current Grade Completed}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})
{ralign 22:label}:  {res:grade4}

{col 18}range:  [{res}1{txt},{res}4{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}4{col 51}{txt}missing .:  {res}4{txt}/{res}2,246

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}       332{col 33}       1{col 43}{txt}Not HS
{col 21}{res}       941{col 33}       2{col 43}{txt}HS Grad
{col 21}{res}       456{col 33}       3{col 43}{txt}Some Coll
{col 21}{res}       513{col 33}       4{col 43}{txt}Coll Grad
{col 21}{res}         4{col 33}       .{col 43}
{txt}
{com}. //_96
. regress wage i.grade4

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,240
{txt}{hline 13}{c +}{hline 34}   F(3, 2236)      = {res}    85.35
{txt}       Model {c |} {res} 7811.98756         3  2603.99585   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 68221.1897     2,236  30.5103711   {txt}R-squared       ={res}    0.1027
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1015
{txt}       Total {c |} {res} 76033.1772     2,239  33.9585428   {txt}Root MSE        =   {res} 5.5236

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        wage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}grade4 {c |}
{space 4}HS Grad  {c |}{col 14}{res}{space 2} 1.490229{col 26}{space 2} .3526422{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4}  .798689{col 67}{space 3}  2.18177
{txt}{space 2}Some Coll  {c |}{col 14}{res}{space 2} 3.769248{col 26}{space 2} .3985065{col 37}{space 1}    9.46{col 46}{space 3}0.000{col 54}{space 4} 2.987767{col 67}{space 3} 4.550729
{txt}{space 2}Coll Grad  {c |}{col 14}{res}{space 2} 5.319548{col 26}{space 2} .3892162{col 37}{space 1}   13.67{col 46}{space 3}0.000{col 54}{space 4} 4.556285{col 67}{space 3}  6.08281
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.194571{col 26}{space 2}  .303148{col 37}{space 1}   17.14{col 46}{space 3}0.000{col 54}{space 4}  4.60009{col 67}{space 3} 5.789052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_97
. regress wage ib2.grade4

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,240
{txt}{hline 13}{c +}{hline 34}   F(3, 2236)      = {res}    85.35
{txt}       Model {c |} {res} 7811.98756         3  2603.99585   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 68221.1897     2,236  30.5103711   {txt}R-squared       ={res}    0.1027
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1015
{txt}       Total {c |} {res} 76033.1772     2,239  33.9585428   {txt}Root MSE        =   {res} 5.5236

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        wage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}grade4 {c |}
{space 5}Not HS  {c |}{col 14}{res}{space 2}-1.490229{col 26}{space 2} .3526422{col 37}{space 1}   -4.23{col 46}{space 3}0.000{col 54}{space 4} -2.18177{col 67}{space 3} -.798689
{txt}{space 2}Some Coll  {c |}{col 14}{res}{space 2} 2.279019{col 26}{space 2} .3152246{col 37}{space 1}    7.23{col 46}{space 3}0.000{col 54}{space 4} 1.660855{col 67}{space 3} 2.897182
{txt}{space 2}Coll Grad  {c |}{col 14}{res}{space 2} 3.829318{col 26}{space 2} .3033948{col 37}{space 1}   12.62{col 46}{space 3}0.000{col 54}{space 4} 3.234353{col 67}{space 3} 4.424283
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   6.6848{col 26}{space 2} .1801606{col 37}{space 1}   37.10{col 46}{space 3}0.000{col 54}{space 4} 6.331501{col 67}{space 3}   7.0381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_98
. list wage grade4 i.grade4 in 1/10, nolabel
{txt}
     {c TLC}{hline 10}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}                        1b.       2.       3.       4.{txt}{c |}
     {c |} {res}    wage   grade4   grade4   grade4   grade4   grade4 {txt}{c |}
     {c LT}{hline 10}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c RT}
  1. {c |} {res} 7.15781        1        0        0        0        0 {txt}{c |}
  2. {c |} {res}2.447664        2        0        1        0        0 {txt}{c |}
  3. {c |} {res}3.824476        3        0        0        1        0 {txt}{c |}
  4. {c |} {res}14.32367        4        0        0        0        1 {txt}{c |}
  5. {c |} {res}5.517124        2        0        1        0        0 {txt}{c |}
     {c LT}{hline 10}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c RT}
  6. {c |} {res}5.032206        3        0        0        1        0 {txt}{c |}
  7. {c |} {res}4.251207        2        0        1        0        0 {txt}{c |}
  8. {c |} {res}2.801002        2        0        1        0        0 {txt}{c |}
  9. {c |} {res}15.04025        4        0        0        0        1 {txt}{c |}
 10. {c |} {res}13.28503        4        0        0        0        1 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c -}{hline 8}{c BRC}

{com}. //_99
. reg wage i.grade4##i.married

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,240
{txt}{hline 13}{c +}{hline 34}   F(7, 2232)      = {res}    38.08
{txt}       Model {c |} {res} 8110.85014         7  1158.69288   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 67922.3271     2,232  30.4311501   {txt}R-squared       ={res}    0.1067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1039
{txt}       Total {c |} {res} 76033.1772     2,239  33.9585428   {txt}Root MSE        =   {res} 5.5164

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              wage{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}grade4 {c |}
{space 10}HS Grad  {c |}{col 20}{res}{space 2} 1.321819{col 32}{space 2} .5759051{col 43}{space 1}    2.30{col 52}{space 3}0.022{col 60}{space 4} .1924532{col 73}{space 3} 2.451184
{txt}{space 8}Some Coll  {c |}{col 20}{res}{space 2} 4.439404{col 32}{space 2} .6472103{col 43}{space 1}    6.86{col 52}{space 3}0.000{col 60}{space 4} 3.170207{col 73}{space 3} 5.708601
{txt}{space 8}Coll Grad  {c |}{col 20}{res}{space 2} 5.905856{col 32}{space 2} .6363548{col 43}{space 1}    9.28{col 52}{space 3}0.000{col 60}{space 4} 4.657947{col 73}{space 3} 7.153766
{txt}{space 18} {c |}
{space 11}married {c |}
{space 10}married  {c |}{col 20}{res}{space 2}-.1704624{col 32}{space 2} .6220255{col 43}{space 1}   -0.27{col 52}{space 3}0.784{col 60}{space 4}-1.390271{col 73}{space 3} 1.049347
{txt}{space 18} {c |}
{space 4}grade4#married {c |}
{space 2}HS Grad#married  {c |}{col 20}{res}{space 2}  .267619{col 32}{space 2} .7281759{col 43}{space 1}    0.37{col 52}{space 3}0.713{col 60}{space 4}-1.160354{col 73}{space 3} 1.695592
{txt}Some Coll#married  {c |}{col 20}{res}{space 2}-1.056459{col 32}{space 2} .8208028{col 43}{space 1}   -1.29{col 52}{space 3}0.198{col 60}{space 4}-2.666076{col 73}{space 3} .5531576
{txt}Coll Grad#married  {c |}{col 20}{res}{space 2}-.9017134{col 32}{space 2} .8039499{col 43}{space 1}   -1.12{col 52}{space 3}0.262{col 60}{space 4}-2.478281{col 73}{space 3} .6748543
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 5.299313{col 32}{space 2} .4875893{col 43}{space 1}   10.87{col 52}{space 3}0.000{col 60}{space 4} 4.343137{col 73}{space 3} 6.255489
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_100
. reg wage i.grade4 i.married i.grade4#i.married

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,240
{txt}{hline 13}{c +}{hline 34}   F(7, 2232)      = {res}    38.08
{txt}       Model {c |} {res} 8110.85014         7  1158.69288   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 67922.3271     2,232  30.4311501   {txt}R-squared       ={res}    0.1067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1039
{txt}       Total {c |} {res} 76033.1772     2,239  33.9585428   {txt}Root MSE        =   {res} 5.5164

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              wage{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}grade4 {c |}
{space 10}HS Grad  {c |}{col 20}{res}{space 2} 1.321819{col 32}{space 2} .5759051{col 43}{space 1}    2.30{col 52}{space 3}0.022{col 60}{space 4} .1924532{col 73}{space 3} 2.451184
{txt}{space 8}Some Coll  {c |}{col 20}{res}{space 2} 4.439404{col 32}{space 2} .6472103{col 43}{space 1}    6.86{col 52}{space 3}0.000{col 60}{space 4} 3.170207{col 73}{space 3} 5.708601
{txt}{space 8}Coll Grad  {c |}{col 20}{res}{space 2} 5.905856{col 32}{space 2} .6363548{col 43}{space 1}    9.28{col 52}{space 3}0.000{col 60}{space 4} 4.657947{col 73}{space 3} 7.153766
{txt}{space 18} {c |}
{space 11}married {c |}
{space 10}married  {c |}{col 20}{res}{space 2}-.1704624{col 32}{space 2} .6220255{col 43}{space 1}   -0.27{col 52}{space 3}0.784{col 60}{space 4}-1.390271{col 73}{space 3} 1.049347
{txt}{space 18} {c |}
{space 4}grade4#married {c |}
{space 2}HS Grad#married  {c |}{col 20}{res}{space 2}  .267619{col 32}{space 2} .7281759{col 43}{space 1}    0.37{col 52}{space 3}0.713{col 60}{space 4}-1.160354{col 73}{space 3} 1.695592
{txt}Some Coll#married  {c |}{col 20}{res}{space 2}-1.056459{col 32}{space 2} .8208028{col 43}{space 1}   -1.29{col 52}{space 3}0.198{col 60}{space 4}-2.666076{col 73}{space 3} .5531576
{txt}Coll Grad#married  {c |}{col 20}{res}{space 2}-.9017134{col 32}{space 2} .8039499{col 43}{space 1}   -1.12{col 52}{space 3}0.262{col 60}{space 4}-2.478281{col 73}{space 3} .6748543
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 5.299313{col 32}{space 2} .4875893{col 43}{space 1}   10.87{col 52}{space 3}0.000{col 60}{space 4} 4.343137{col 73}{space 3} 6.255489
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_101
. reg wage i.grade4##c.age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,240
{txt}{hline 13}{c +}{hline 34}   F(7, 2232)      = {res}    36.60
{txt}       Model {c |} {res} 7829.76084         7  1118.53726   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 68203.4164     2,232  30.5570862   {txt}R-squared       ={res}    0.1030
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1002
{txt}       Total {c |} {res} 76033.1772     2,239  33.9585428   {txt}Root MSE        =   {res} 5.5278

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        wage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}grade4 {c |}
{space 4}HS Grad  {c |}{col 14}{res}{space 2} 1.296013{col 26}{space 2} 2.460262{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-3.528628{col 67}{space 3} 6.120654
{txt}{space 2}Some Coll  {c |}{col 14}{res}{space 2} 4.463486{col 26}{space 2} 2.764418{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.9576133{col 67}{space 3} 9.884585
{txt}{space 2}Coll Grad  {c |}{col 14}{res}{space 2} 6.507141{col 26}{space 2} 2.727232{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} 1.158965{col 67}{space 3} 11.85532
{txt}{space 12} {c |}
{space 9}age {c |}{col 14}{res}{space 2}  .014414{col 26}{space 2} .0574379{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.0982233{col 67}{space 3} .1270514
{txt}{space 12} {c |}
grade4#c.age {c |}
{space 4}HS Grad  {c |}{col 14}{res}{space 2}  .005623{col 26}{space 2} .0665171{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-.1248188{col 67}{space 3} .1360649
{txt}{space 2}Some Coll  {c |}{col 14}{res}{space 2}-.0189718{col 26}{space 2} .0750005{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.1660498{col 67}{space 3} .1281063
{txt}{space 2}Coll Grad  {c |}{col 14}{res}{space 2} -.032585{col 26}{space 2} .0738738{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}-.1774535{col 67}{space 3} .1122835
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.664681{col 26}{space 2} 2.133219{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} .4813798{col 67}{space 3} 8.847983
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_102
. reg wage c.age##c.age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,244
{txt}{hline 13}{c +}{hline 34}   F(2, 2241)      = {res}     0.53
{txt}       Model {c |} {res} 35.8383924         2  17.9191962   {txt}Prob > F        ={res}    0.5899
{txt}    Residual {c |} {res} 76059.8271     2,241  33.9401281   {txt}R-squared       ={res}    0.0005
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0004
{txt}       Total {c |} {res} 76095.6655     2,243  33.9258429   {txt}Root MSE        =   {res} 5.8258

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        wage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .2546764{col 26}{space 2} .2532736{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.2419991{col 67}{space 3} .7513518
{txt}{space 12} {c |}
{space 1}c.age#c.age {c |}{col 14}{res}{space 2}-.0037169{col 26}{space 2} .0036417{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-.0108584{col 67}{space 3} .0034247
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  3.55454{col 26}{space 2} 4.337015{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 54}{space 4}-4.950447{col 67}{space 3} 12.05953
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_103
. reg wage c.age##c.age##c.age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,244
{txt}{hline 13}{c +}{hline 34}   F(3, 2240)      = {res}     0.50
{txt}       Model {c |} {res} 50.4733111         3   16.824437   {txt}Prob > F        ={res}    0.6854
{txt}    Residual {c |} {res} 76045.1922     2,240  33.9487465   {txt}R-squared       ={res}    0.0007
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0007
{txt}       Total {c |} {res} 76095.6655     2,243  33.9258429   {txt}Root MSE        =   {res} 5.8266

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             wage{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}age {c |}{col 19}{res}{space 2}-1.199385{col 31}{space 2}  2.22906{col 42}{space 1}   -0.54{col 51}{space 3}0.591{col 59}{space 4}-5.570624{col 72}{space 3} 3.171855
{txt}{space 17} {c |}
{space 6}c.age#c.age {c |}{col 19}{res}{space 2} .0392406{col 31}{space 2}  .065528{col 42}{space 1}    0.60{col 51}{space 3}0.549{col 59}{space 4}-.0892614{col 72}{space 3} .1677426
{txt}{space 17} {c |}
c.age#c.age#c.age {c |}{col 19}{res}{space 2}-.0004146{col 31}{space 2} .0006315{col 42}{space 1}   -0.66{col 51}{space 3}0.512{col 59}{space 4} -.001653{col 72}{space 3} .0008238
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2} 19.58876{col 31}{space 2} 24.80329{col 42}{space 1}    0.79{col 51}{space 3}0.430{col 59}{space 4}-29.05107{col 72}{space 3} 68.22859
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_104
. reg wage c.age##c.age##c.age##c.age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,244
{txt}{hline 13}{c +}{hline 34}   F(4, 2239)      = {res}     0.50
{txt}       Model {c |} {res} 67.8804251         4  16.9701063   {txt}Prob > F        ={res}    0.7359
{txt}    Residual {c |} {res} 76027.7851     2,239  33.9561345   {txt}R-squared       ={res}    0.0009
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0009
{txt}       Total {c |} {res} 76095.6655     2,243  33.9258429   {txt}Root MSE        =   {res} 5.8272

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   wage{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}age {c |}{col 25}{res}{space 2} 9.148757{col 37}{space 2} 14.62392{col 48}{space 1}    0.63{col 57}{space 3}0.532{col 65}{space 4}-19.52911{col 78}{space 3} 37.82662
{txt}{space 23} {c |}
{space 12}c.age#c.age {c |}{col 25}{res}{space 2} -.428763{col 37}{space 2} .6569265{col 48}{space 1}   -0.65{col 57}{space 3}0.514{col 65}{space 4}-1.717012{col 78}{space 3} .8594857
{txt}{space 23} {c |}
{space 6}c.age#c.age#c.age {c |}{col 25}{res}{space 2} .0088427{col 37}{space 2} .0129448{col 48}{space 1}    0.68{col 57}{space 3}0.495{col 65}{space 4}-.0165425{col 78}{space 3} .0342278
{txt}{space 23} {c |}
c.age#c.age#c.age#c.age {c |}{col 25}{res}{space 2}-.0000676{col 37}{space 2} .0000945{col 48}{space 1}   -0.72{col 57}{space 3}0.474{col 65}{space 4}-.0002529{col 78}{space 3} .0001176
{txt}{space 23} {c |}
{space 18}_cons {c |}{col 25}{res}{space 2}-64.76751{col 37}{space 2} 120.4015{col 48}{space 1}   -0.54{col 57}{space 3}0.591{col 65}{space 4}-300.8777{col 78}{space 3} 171.3427
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_105
. type momkid1.csv
{res}momid,momm,momd,momy,kidbday
1,11,28,1972,1/5/1998
2,4,3,1973,4/11/2002
3,6,13,1968,5/15/1996
4,1,5,1960,1/4/2004
{txt}
{com}. import delimited using "momkid1.csv", clear
{res}{text}(5 vars, 4 obs)

{com}. list
{txt}
     {c TLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 11}{c TRC}
     {c |} {res}momid   momm   momd   momy     kidbday {txt}{c |}
     {c LT}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 11}{c RT}
  1. {c |} {res}    1     11     28   1972    1/5/1998 {txt}{c |}
  2. {c |} {res}    2      4      3   1973   4/11/2002 {txt}{c |}
  3. {c |} {res}    3      6     13   1968   5/15/1996 {txt}{c |}
  4. {c |} {res}    4      1      5   1960    1/4/2004 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 11}{c BRC}

{com}. //_106
. generate mombdate=mdy(momm, momd, momy), after(momy)
{txt}
{com}. //_107
. generate kidbdate=date(kidbday,"MDY")
{txt}
{com}. //_108
. list 
{txt}
     {c TLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 10}{c -}{hline 11}{c -}{hline 10}{c TRC}
     {c |} {res}momid   momm   momd   momy   mombdate     kidbday   kidbdate {txt}{c |}
     {c LT}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 10}{c -}{hline 11}{c -}{hline 10}{c RT}
  1. {c |} {res}    1     11     28   1972       4715    1/5/1998      13884 {txt}{c |}
  2. {c |} {res}    2      4      3   1973       4841   4/11/2002      15441 {txt}{c |}
  3. {c |} {res}    3      6     13   1968       3086   5/15/1996      13284 {txt}{c |}
  4. {c |} {res}    4      1      5   1960          4    1/4/2004      16074 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 10}{c -}{hline 11}{c -}{hline 10}{c BRC}

{com}. //_109
. format mombdate kidbdate %td
{txt}
{com}. list
{txt}
     {c TLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}momid   momm   momd   momy    mombdate     kidbday    kidbdate {txt}{c |}
     {c LT}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res}    1     11     28   1972   28nov1972    1/5/1998   05jan1998 {txt}{c |}
  2. {c |} {res}    2      4      3   1973   03apr1973   4/11/2002   11apr2002 {txt}{c |}
  3. {c |} {res}    3      6     13   1968   13jun1968   5/15/1996   15may1996 {txt}{c |}
  4. {c |} {res}    4      1      5   1960   05jan1960    1/4/2004   04jan2004 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_110
. format mombdate kidbdate %tdNN/DD/ccYY
{txt}
{com}. list
{txt}
     {c TLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 12}{c -}{hline 11}{c -}{hline 12}{c TRC}
     {c |} {res}momid   momm   momd   momy     mombdate     kidbday     kidbdate {txt}{c |}
     {c LT}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 12}{c -}{hline 11}{c -}{hline 12}{c RT}
  1. {c |} {res}    1     11     28   1972   11/28/1972    1/5/1998   01/05/1998 {txt}{c |}
  2. {c |} {res}    2      4      3   1973   04/03/1973   4/11/2002   04/11/2002 {txt}{c |}
  3. {c |} {res}    3      6     13   1968   06/13/1968   5/15/1996   05/15/1996 {txt}{c |}
  4. {c |} {res}    4      1      5   1960   01/05/1960    1/4/2004   01/04/2004 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 6}{c -}{hline 6}{c -}{hline 6}{c -}{hline 12}{c -}{hline 11}{c -}{hline 12}{c BRC}

{com}. //_111
. format mombdate kidbdate %tdDayname_Mon_DD,_ccYY
{txt}
{com}. list kidbday kidbdate
{txt}
     {c TLC}{hline 11}{c -}{hline 24}{c TRC}
     {c |} {res}  kidbday                 kidbdate {txt}{c |}
     {c LT}{hline 11}{c -}{hline 24}{c RT}
  1. {c |} {res} 1/5/1998      Monday Jan 05, 1998 {txt}{c |}
  2. {c |} {res}4/11/2002    Thursday Apr 11, 2002 {txt}{c |}
  3. {c |} {res}5/15/1996   Wednesday May 15, 1996 {txt}{c |}
  4. {c |} {res} 1/4/2004      Sunday Jan 04, 2004 {txt}{c |}
     {c BLC}{hline 11}{c -}{hline 24}{c BRC}

{com}. //_112
. generate momagediff=kidbdate-mombdate
{txt}
{com}. list mombdate kidbdate momagediff
{txt}
     {c TLC}{hline 23}{c -}{hline 24}{c -}{hline 10}{c TRC}
     {c |} {res}             mombdate                 kidbdate   momage~f {txt}{c |}
     {c LT}{hline 23}{c -}{hline 24}{c -}{hline 10}{c RT}
  1. {c |} {res} Tuesday Nov 28, 1972      Monday Jan 05, 1998       9169 {txt}{c |}
  2. {c |} {res} Tuesday Apr 03, 1973    Thursday Apr 11, 2002      10600 {txt}{c |}
  3. {c |} {res}Thursday Jun 13, 1968   Wednesday May 15, 1996      10198 {txt}{c |}
  4. {c |} {res} Tuesday Jan 05, 1960      Sunday Jan 04, 2004      16070 {txt}{c |}
     {c BLC}{hline 23}{c -}{hline 24}{c -}{hline 10}{c BRC}

{com}. //_113
. generate momagediffyr = (kidbdate-mombdate)/365.25
{txt}
{com}. list mombdate kidbdate momagediffyr
{txt}
     {c TLC}{hline 23}{c -}{hline 24}{c -}{hline 11}{c TRC}
     {c |} {res}             mombdate                 kidbdate   momaged~r {txt}{c |}
     {c LT}{hline 23}{c -}{hline 24}{c -}{hline 11}{c RT}
  1. {c |} {res} Tuesday Nov 28, 1972      Monday Jan 05, 1998   25.103354 {txt}{c |}
  2. {c |} {res} Tuesday Apr 03, 1973    Thursday Apr 11, 2002   29.021218 {txt}{c |}
  3. {c |} {res}Thursday Jun 13, 1968   Wednesday May 15, 1996   27.920602 {txt}{c |}
  4. {c |} {res} Tuesday Jan 05, 1960      Sunday Jan 04, 2004   43.997262 {txt}{c |}
     {c BLC}{hline 23}{c -}{hline 24}{c -}{hline 11}{c BRC}

{com}. //_114
. display (mdy(4,5,2005)-mdy(5,6,2000))/365.25
{res}4.9144422
{txt}
{com}. //_115
. list momid mombdate if (mombdate >= mdy(1,20,1970)) & !missing(mombdate)
{txt}
     {c TLC}{hline 7}{c -}{hline 22}{c TRC}
     {c |} {res}momid               mombdate {txt}{c |}
     {c LT}{hline 7}{c -}{hline 22}{c RT}
  1. {c |} {res}    1   Tuesday Nov 28, 1972 {txt}{c |}
  2. {c |} {res}    2   Tuesday Apr 03, 1973 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 22}{c BRC}

{com}. //_116
. gen monyear = ym(momy,momm)
{txt}
{com}. //_117
. format monyear %tmMon_ccYY
{txt}
{com}. list monyear
{txt}
     {c TLC}{hline 10}{c TRC}
     {c |} {res} monyear {txt}{c |}
     {c LT}{hline 10}{c RT}
  1. {c |} {res}Nov 1972 {txt}{c |}
  2. {c |} {res}Apr 1973 {txt}{c |}
  3. {c |} {res}Jun 1968 {txt}{c |}
  4. {c |} {res}Jan 1960 {txt}{c |}
     {c BLC}{hline 10}{c BRC}

{com}. //_118
. help dates and times
{txt}
{com}. //_119
. gen testdt = mdyhms(momm,momd,momy,runiform(1,12),runiform(0,59), runiform(0,59))
{txt}
{com}. format testdt %tc
{txt}
{com}. list mombdate testdt
{txt}
     {c TLC}{hline 23}{c -}{hline 20}{c TRC}
     {c |} {res}             mombdate               testdt {txt}{c |}
     {c LT}{hline 23}{c -}{hline 20}{c RT}
  1. {c |} {res} Tuesday Nov 28, 1972   28nov1972 08:33:12 {txt}{c |}
  2. {c |} {res} Tuesday Apr 03, 1973   03apr1973 05:26:19 {txt}{c |}
  3. {c |} {res}Thursday Jun 13, 1968   13jun1968 07:08:28 {txt}{c |}
  4. {c |} {res} Tuesday Jan 05, 1960   05jan1960 01:35:20 {txt}{c |}
     {c BLC}{hline 23}{c -}{hline 20}{c BRC}

{com}. //_120
. use "cardio2miss.dta", clear
{txt}
{com}. //_121
. egen avgpl=rowmean(pl1-pl5)
{txt}
{com}. list id pl1-pl5 avgpl
{txt}
     {c TLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c TRC}
     {c |} {res}id   pl1   pl2   pl3   pl4   pl5   avgpl {txt}{c |}
     {c LT}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c RT}
  1. {c |} {res} 1    54   115    87    86    93      87 {txt}{c |}
  2. {c |} {res} 2    92   123    88   136   125   112.8 {txt}{c |}
  3. {c |} {res} 3   105    .a    97   122   128     113 {txt}{c |}
  4. {c |} {res} 4    52   105    79   115    71    84.4 {txt}{c |}
  5. {c |} {res} 5    70   116    .a   128    52    91.5 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. //_122
. egen avgbp=rowmean(bp1-bp5)
{txt}
{com}. list id bp1-bp5 avgbp
{txt}
     {c TLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c TRC}
     {c |} {res}id   bp1   bp2   bp3   bp4   bp5   avgbp {txt}{c |}
     {c LT}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c RT}
  1. {c |} {res} 1   129    81   105    .b    .b     105 {txt}{c |}
  2. {c |} {res} 2   107    87   111    58   120    96.6 {txt}{c |}
  3. {c |} {res} 3   101    57   109    68   112    89.4 {txt}{c |}
  4. {c |} {res} 4   121   106   129    39   137   106.4 {txt}{c |}
  5. {c |} {res} 5   112    68   125    59   111      95 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c BRC}

{com}. //_123
. egen maxbp=rowmax(bp1-bp5)
{txt}
{com}. egen minbp=rowmin(bp1-bp5)
{txt}
{com}. list id bp1-bp5 avgbp maxbp minbp
{txt}
     {c TLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c TRC}
     {c |} {res}id   bp1   bp2   bp3   bp4   bp5   avgbp   maxbp   minbp {txt}{c |}
     {c LT}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c RT}
  1. {c |} {res} 1   129    81   105    .b    .b     105     129      81 {txt}{c |}
  2. {c |} {res} 2   107    87   111    58   120    96.6     120      58 {txt}{c |}
  3. {c |} {res} 3   101    57   109    68   112    89.4     112      57 {txt}{c |}
  4. {c |} {res} 4   121   106   129    39   137   106.4     137      39 {txt}{c |}
  5. {c |} {res} 5   112    68   125    59   111      95     125      59 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c BRC}

{com}. //_124
. egen missbp = rowmiss(bp?)
{txt}
{com}. //_125
. use "gasctrysmall.dta", clear
{txt}
{com}. //_126
. egen avggas = mean(gas)
{txt}
{com}. bysort ctry: egen avggas_ctry = mean(gas)
{txt}
{com}. list ctry year gas avggas avggas_ctry, sepby(ctry)
{txt}
     {c TLC}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 8}{c -}{hline 11}{c TRC}
     {c |} {res}ctry   year   gas   avggas   avggas_~y {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 8}{c -}{hline 11}{c RT}
  1. {c |} {res}   1   1974   .78    .7675        .805 {txt}{c |}
  2. {c |} {res}   1   1975   .83    .7675        .805 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 8}{c -}{hline 11}{c RT}
  3. {c |} {res}   2   1971   .69    .7675   .78333333 {txt}{c |}
  4. {c |} {res}   2   1971   .77    .7675   .78333333 {txt}{c |}
  5. {c |} {res}   2   1973   .89    .7675   .78333333 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 8}{c -}{hline 11}{c RT}
  6. {c |} {res}   3   1974   .42    .7675         .42 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 8}{c -}{hline 11}{c RT}
  7. {c |} {res}   4   1974   .82    .7675         .88 {txt}{c |}
  8. {c |} {res}   4   1975   .94    .7675         .88 {txt}{c |}
     {c BLC}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 8}{c -}{hline 11}{c BRC}

{com}. //_127
. bysort ctry: egen mingas_ctry = min(gas)
{txt}
{com}. bysort ctry: egen maxgas_ctry = max(gas)
{txt}
{com}. //_128
. bysort ctry: egen count_ctry=count(gas)
{txt}
{com}. list, sepby(ctry)
{txt}
     {c TLC}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 6}{c -}{hline 8}{c -}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}ctry   year   gas   infl   avggas   avggas_~y   mingas~y   maxgas~y   count_~y {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 6}{c -}{hline 8}{c -}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}   1   1974   .78   1.32    .7675        .805        .78        .83          2 {txt}{c |}
  2. {c |} {res}   1   1975   .83    1.4    .7675        .805        .78        .83          2 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 6}{c -}{hline 8}{c -}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}   2   1971   .69   1.15    .7675   .78333333        .69        .89          3 {txt}{c |}
  4. {c |} {res}   2   1971   .77   1.15    .7675   .78333333        .69        .89          3 {txt}{c |}
  5. {c |} {res}   2   1973   .89   1.29    .7675   .78333333        .69        .89          3 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 6}{c -}{hline 8}{c -}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res}   3   1974   .42   1.14    .7675         .42        .42        .42          1 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 6}{c -}{hline 8}{c -}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  7. {c |} {res}   4   1974   .82   1.12    .7675         .88        .82        .94          2 {txt}{c |}
  8. {c |} {res}   4   1975   .94   1.18    .7675         .88        .82        .94          2 {txt}{c |}
     {c BLC}{hline 6}{c -}{hline 6}{c -}{hline 5}{c -}{hline 6}{c -}{hline 8}{c -}{hline 11}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_129
. help egen
{txt}
{com}. //_130
. sort ctry year
{txt}
{com}. //_131
. bysort ctry: gen firstyr = year[1]
{txt}
{com}. //_132
. bysort ctry: gen lastyr = year[_N]
{txt}
{com}. //_133
. bysort ctry: gen diffgas = gas-gas[_n-1]
{txt}(4 missing values generated)

{com}. //_134
. bysort ctry: gen gasindex = gas/gas[1]*100
{txt}
{com}. //_135
. use "cardio1str.dta", clear
{txt}
{com}. //_136
. sum wt bp1 bp2 bp3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}wt {c |}{res}          0
{txt}{space 9}bp1 {c |}{res}          0
{txt}{space 9}bp2 {c |}{res}          0
{txt}{space 9}bp3 {c |}{res}          0
{txt}
{com}. //_137
. describe

{txt}Contains data from {res}cardio1str.dta
{txt}  obs:{res}             5                          
{txt} vars:{res}            11                          22 Dec 2009 19:51
{txt} size:{res}           205                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: str1    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Identification variable{p_end}
{p 0 48}{bind:wt             }{txt}{bind: str5    }{bind:{txt}%5s       }{space 1}{bind:         }{bind:  }{res}{res}Weight of person{p_end}
{p 0 48}{bind:age            }{txt}{bind: str2    }{bind:{txt}%2s       }{space 1}{bind:         }{bind:  }{res}{res}Age of person{p_end}
{p 0 48}{bind:bp1            }{txt}{bind: str3    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 1{p_end}
{p 0 48}{bind:bp2            }{txt}{bind: str3    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 2{p_end}
{p 0 48}{bind:bp3            }{txt}{bind: str3    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 3{p_end}
{p 0 48}{bind:pl1            }{txt}{bind: str3    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 1{p_end}
{p 0 48}{bind:pl2            }{txt}{bind: str2    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 2{p_end}
{p 0 48}{bind:pl3            }{txt}{bind: str3    }{bind:{txt}%3s       }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 3{p_end}
{p 0 48}{bind:income         }{txt}{bind: str10   }{bind:{txt}%10s      }{space 1}{bind:         }{bind:  }{res}{res}Income{p_end}
{p 0 48}{bind:gender         }{txt}{bind: str6    }{bind:{txt}%6s       }{space 1}{bind:         }{bind:  }{res}{res}Gender of person{p_end}
{txt}{hline}
Sorted by: 

{com}. //_138
. destring age, gen(agen)
{txt}age: all characters numeric; agen {res}generated {txt}as {res}byte
{txt}
{com}. sum age agen

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}          0
{txt}{space 8}agen {c |}{res}          5        37.4    10.83051         23         48
{txt}
{com}. drop agen
{txt}
{com}. //_139
. destring id-income, replace
{txt}id: all characters numeric; {res}replaced {txt}as {res}byte
{txt}wt: all characters numeric; {res}replaced {txt}as {res}double
{txt}age: all characters numeric; {res}replaced {txt}as {res}byte
{txt}bp1: all characters numeric; {res}replaced {txt}as {res}int
{txt}bp2: all characters numeric; {res}replaced {txt}as {res}int
{txt}bp3: all characters numeric; {res}replaced {txt}as {res}int
{txt}pl1: all characters numeric; {res}replaced {txt}as {res}int
{txt}(1 missing value generated)
{res}{txt}pl2: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(1 missing value generated)
{res}{txt}pl3: contains nonnumeric characters; no {res}replace
{txt}income: contains nonnumeric characters; no {res}replace
{txt}
{com}. //_140
. list pl3
{txt}
     {c TLC}{hline 5}{c TRC}
     {c |} {res}pl3 {txt}{c |}
     {c LT}{hline 5}{c RT}
  1. {c |} {res} 93 {txt}{c |}
  2. {c |} {res}125 {txt}{c |}
  3. {c |} {res}  X {txt}{c |}
  4. {c |} {res} 71 {txt}{c |}
  5. {c |} {res} 52 {txt}{c |}
     {c BLC}{hline 5}{c BRC}

{com}. destring pl3, replace force
{txt}pl3: contains nonnumeric characters; {res}replaced {txt}as {res}int
{txt}(1 missing value generated)
{res}{txt}
{com}. list pl3
{txt}
     {c TLC}{hline 5}{c TRC}
     {c |} {res}pl3 {txt}{c |}
     {c LT}{hline 5}{c RT}
  1. {c |} {res} 93 {txt}{c |}
  2. {c |} {res}125 {txt}{c |}
  3. {c |} {res}  . {txt}{c |}
  4. {c |} {res} 71 {txt}{c |}
  5. {c |} {res} 52 {txt}{c |}
     {c BLC}{hline 5}{c BRC}

{com}. //_141
. destring income, replace ignore("$,")
{txt}income: characters{res} $ ,{txt} removed; {res}replaced {txt}as {res}double
{txt}
{com}. list
{txt}
     {c TLC}{hline 4}{c -}{hline 7}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c TRC}
     {c |} {res}id      wt   age   bp1   bp2   bp3   pl1   pl2   pl3     income   gender {txt}{c |}
     {c LT}{hline 4}{c -}{hline 7}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  1. {c |} {res} 1   150.7    45   115    86   129    54    87    93   25308.92     male {txt}{c |}
  2. {c |} {res} 2   186.3    23   123   136   107    92    88   125   46213.31     male {txt}{c |}
  3. {c |} {res} 3   109.9    48   132   122   101   105    97     .   65234.11     male {txt}{c |}
  4. {c |} {res} 4   183.4    29   105   115   121     .    79    71   89234.23     male {txt}{c |}
  5. {c |} {res} 5   159.1    42   116   128   112    70     .    52   54989.87   female {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 7}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c BRC}

{com}. //_142
. list id gender
{txt}
     {c TLC}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}id   gender {txt}{c |}
     {c LT}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res} 1     male {txt}{c |}
  2. {c |} {res} 2     male {txt}{c |}
  3. {c |} {res} 3     male {txt}{c |}
  4. {c |} {res} 4     male {txt}{c |}
  5. {c |} {res} 5   female {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_143
. replace gender = stritrim(gender)
{txt}(0 real changes made)

{com}. encode gender, generate(gendercode)
{txt}
{com}. list gender gendercode
{txt}
     {c TLC}{hline 8}{c -}{hline 10}{c TRC}
     {c |} {res}gender   gender~e {txt}{c |}
     {c LT}{hline 8}{c -}{hline 10}{c RT}
  1. {c |} {res}  male       male {txt}{c |}
  2. {c |} {res}  male       male {txt}{c |}
  3. {c |} {res}  male       male {txt}{c |}
  4. {c |} {res}  male       male {txt}{c |}
  5. {c |} {res}female     female {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 10}{c BRC}

{com}. //_144
. tab gender gendercode, nolabel

 {txt}Gender of {c |}   Gender of person
    person {c |}         1          2 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    female {c |}{res}         1          0 {txt}{c |}{res}         1 
{txt}      male {c |}{res}         0          4 {txt}{c |}{res}         4 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}         1          4 {txt}{c |}{res}         5 

{txt}
{com}. //_145
. codebook gendercode

{txt}{hline}
{res}gendercode{right:Gender of person}
{txt}{hline}

{col 19}type:  numeric ({res}long{txt})
{ralign 22:label}:  {res:gendercode}

{col 18}range:  [{res}1{txt},{res}2{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}5

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         1{col 33}       1{col 43}{txt}female
{col 21}{res}         4{col 33}       2{col 43}{txt}male

{com}. //_146
. use "cardio3.dta", clear
{txt}
{com}. list zipcode
{txt}
     {c TLC}{hline 9}{c TRC}
     {c |} {res}zipcode {txt}{c |}
     {c LT}{hline 9}{c RT}
  1. {c |} {res}   1003 {txt}{c |}
  2. {c |} {res}  90095 {txt}{c |}
  3. {c |} {res}  43409 {txt}{c |}
  4. {c |} {res}  23219 {txt}{c |}
  5. {c |} {res}  66214 {txt}{c |}
     {c BLC}{hline 9}{c BRC}

{com}. //_147
. tostring zipcode, generate(zips)
{txt}zips generated as {res:str5}

{com}. replace zips = "0" + zips if strlen(zips) == 4
{txt}(1 real change made)

{com}. replace zips = "00" + zips if strlen(zips) == 3
{txt}(0 real changes made)

{com}. list zipcode zips
{txt}
     {c TLC}{hline 9}{c -}{hline 7}{c TRC}
     {c |} {res}zipcode    zips {txt}{c |}
     {c LT}{hline 9}{c -}{hline 7}{c RT}
  1. {c |} {res}   1003   01003 {txt}{c |}
  2. {c |} {res}  90095   90095 {txt}{c |}
  3. {c |} {res}  43409   43409 {txt}{c |}
  4. {c |} {res}  23219   23219 {txt}{c |}
  5. {c |} {res}  66214   66214 {txt}{c |}
     {c BLC}{hline 9}{c -}{hline 7}{c BRC}

{com}. //_148
. decode famhist, gen(famhists)
{txt}
{com}. list famhist famhists, nolabel
{txt}
     {c TLC}{hline 9}{c -}{hline 10}{c TRC}
     {c |} {res}famhist   famhists {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c RT}
  1. {c |} {res}      0      No HD {txt}{c |}
  2. {c |} {res}      1     Yes HD {txt}{c |}
  3. {c |} {res}      0      No HD {txt}{c |}
  4. {c |} {res}      1     Yes HD {txt}{c |}
  5. {c |} {res}      1     Yes HD {txt}{c |}
     {c BLC}{hline 9}{c -}{hline 10}{c BRC}

{com}. codebook famhist famhists

{txt}{hline}
{res}famhist{right:Family history of heart disease}
{txt}{hline}

{col 19}type:  numeric ({res}long{txt})
{ralign 22:label}:  {res:famhistl}

{col 18}range:  [{res}0{txt},{res}1{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}2{col 51}{txt}missing .:  {res}0{txt}/{res}5

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}         2{col 33}       0{col 43}{txt}No HD
{col 21}{res}         3{col 33}       1{col 43}{txt}Yes HD

{txt}{hline}
{res}famhists{right:Family history of heart disease}
{txt}{hline}

{col 19}type:  string ({res}str6{txt})

{col 10}unique values:  {res}2{col 51}{txt}missing "":  {res}0{txt}/{res}5

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         2{col 33}"No HD"
{col 21}         3{col 33}"Yes HD"

{txt}{col 16}warning:  variable has embedded blanks

{com}. //_149
. use "cardio2.dta", clear
{txt}
{com}. describe

{txt}Contains data from {res}cardio2.dta
{txt}  obs:{res}             5                          
{txt} vars:{res}            12                          22 Dec 2009 19:51
{txt} size:{res}           100                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Identification variable{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Age of person{p_end}
{p 0 48}{bind:pl1            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 1{p_end}
{p 0 48}{bind:bp1            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 1{p_end}
{p 0 48}{bind:pl2            }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 2{p_end}
{p 0 48}{bind:bp2            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 2{p_end}
{p 0 48}{bind:pl3            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 3{p_end}
{p 0 48}{bind:bp3            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 3{p_end}
{p 0 48}{bind:pl4            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 4{p_end}
{p 0 48}{bind:bp4            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 4{p_end}
{p 0 48}{bind:pl5            }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 5{p_end}
{p 0 48}{bind:bp5            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 5{p_end}
{txt}{hline}
Sorted by: 

{com}. //_150
. rename age age_yrs
{res}{txt}
{com}. //_151
. rename pl? pulse? 
{res}{txt}
{com}. //_152
. describe

{txt}Contains data from {res}cardio2.dta
{txt}  obs:{res}             5                          
{txt} vars:{res}            12                          22 Dec 2009 19:51
{txt} size:{res}           100                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Identification variable{p_end}
{p 0 48}{bind:age_yrs        }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Age of person{p_end}
{p 0 48}{bind:pulse1         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 1{p_end}
{p 0 48}{bind:bp1            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 1{p_end}
{p 0 48}{bind:pulse2         }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 2{p_end}
{p 0 48}{bind:bp2            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 2{p_end}
{p 0 48}{bind:pulse3         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 3{p_end}
{p 0 48}{bind:bp3            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 3{p_end}
{p 0 48}{bind:pulse4         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 4{p_end}
{p 0 48}{bind:bp4            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 4{p_end}
{p 0 48}{bind:pulse5         }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 5{p_end}
{p 0 48}{bind:bp5            }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 5{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_153
. rename (bp1 bp2 bp3 bp4 bp5) (bpress1 bpress2 bpress3 bpress4 bpress5)
{res}{txt}
{com}. describe

{txt}Contains data from {res}cardio2.dta
{txt}  obs:{res}             5                          
{txt} vars:{res}            12                          22 Dec 2009 19:51
{txt} size:{res}           100                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Identification variable{p_end}
{p 0 48}{bind:age_yrs        }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Age of person{p_end}
{p 0 48}{bind:pulse1         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 1{p_end}
{p 0 48}{bind:bpress1        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 1{p_end}
{p 0 48}{bind:pulse2         }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 2{p_end}
{p 0 48}{bind:bpress2        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 2{p_end}
{p 0 48}{bind:pulse3         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 3{p_end}
{p 0 48}{bind:bpress3        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 3{p_end}
{p 0 48}{bind:pulse4         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 4{p_end}
{p 0 48}{bind:bpress4        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 4{p_end}
{p 0 48}{bind:pulse5         }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 5{p_end}
{p 0 48}{bind:bpress5        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 5{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_154
. order id age_yrs bp* pul*
{txt}
{com}. //_155
. order pul* bp*, after(age_yrs) 
{txt}
{com}. //_156
. order bp*, before(pulse1)
{txt}
{com}. //_157
. gen age2=age_yrs*age_yrs, after(age_yrs)
{txt}
{com}. //_158
. order _all, alphabetic
{txt}
{com}. describe

{txt}Contains data from {res}cardio2.dta
{txt}  obs:{res}             5                          
{txt} vars:{res}            13                          22 Dec 2009 19:51
{txt} size:{res}           140                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:age2           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age_yrs        }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Age of person{p_end}
{p 0 48}{bind:bpress1        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 1{p_end}
{p 0 48}{bind:bpress2        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 2{p_end}
{p 0 48}{bind:bpress3        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 3{p_end}
{p 0 48}{bind:bpress4        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 4{p_end}
{p 0 48}{bind:bpress5        }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP: Trial 5{p_end}
{p 0 48}{bind:id             }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Identification variable{p_end}
{p 0 48}{bind:pulse1         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 1{p_end}
{p 0 48}{bind:pulse2         }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 2{p_end}
{p 0 48}{bind:pulse3         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 3{p_end}
{p 0 48}{bind:pulse4         }{txt}{bind: int     }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 4{p_end}
{p 0 48}{bind:pulse5         }{txt}{bind: byte    }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}Pulse: Trial 5{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_159
. order bpress5 bpress1-bpress4, after(age2)
{txt}
{com}. order bp*, sequential
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week4_fe_re.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Mar 2024, 19:05:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}