{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week1intro.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Aug 2023, 20:44:51
{txt}
{com}. //_1
. clear
{txt}
{com}. set more off
{txt}
{com}. //_2
. cd "/Users/Sam/Desktop/Econ 645/Data/Mitchell"
{res}/Users/Sam/Desktop/Econ 645/Data/Mitchell
{txt}
{com}. //_3
. use wws.dta, clear
{txt}(Working Women Survey)

{com}. summarize age wage hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}      2,246    36.25111    5.437983         21         83
{txt}{space 8}wage {c |}{res}      2,246    288.2885    9595.692          0     380000
{txt}{space 7}hours {c |}{res}      2,242    37.21811    10.50914          1         80
{txt}
{com}. tabulate married

    {txt}married {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        804       35.80       35.80
{txt}          1 {c |}{res}      1,442       64.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00
{txt}
{com}. //_4
. type example1.do
{res}use wws2, clear
summarize age wage hours
tabulate married
{txt}
{com}. //_5
. do example1.do
{txt}
{com}. use wws2, clear
{txt}(Working Women Survey w/fixes)

{com}. summarize age wage hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}      2,246    36.22707    5.337859         21         48
{txt}{space 8}wage {c |}{res}      2,244    7.796781     5.82459          0   40.74659
{txt}{space 7}hours {c |}{res}      2,242    37.21811    10.50914          1         80
{txt}
{com}. tabulate married

    {txt}married {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        804       35.80       35.80
{txt}          1 {c |}{res}      1,442       64.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. //_6
. doedit 
{txt}
{com}. //_7
. type example2.do
{res}log using example2
use wws2, clear
summarize age wage hours
tabulate married
log close
{txt}
{com}. //_8
. use wws2, clear
{txt}(Working Women Survey w/fixes)

{com}. summarize age wage hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}      2,246    36.22707    5.337859         21         48
{txt}{space 8}wage {c |}{res}      2,244    7.796781     5.82459          0   40.74659
{txt}{space 7}hours {c |}{res}      2,242    37.21811    10.50914          1         80
{txt}
{com}. tabulate married

    {txt}married {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        804       35.80       35.80
{txt}          1 {c |}{res}      1,442       64.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00
{txt}
{com}. //_9
. use wws2, clear
{txt}(Working Women Survey w/fixes)

{com}. summarize age wage hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}      2,246    36.22707    5.337859         21         48
{txt}{space 8}wage {c |}{res}      2,244    7.796781     5.82459          0   40.74659
{txt}{space 7}hours {c |}{res}      2,242    37.21811    10.50914          1         80
{txt}
{com}. tabulate married

    {txt}married {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        804       35.80       35.80
{txt}          1 {c |}{res}      1,442       64.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week1intro.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Aug 2023, 20:44:51
{txt}{.-}
{smcl}
{txt}{sf}{ul off}