{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week8_LDV1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Oct 2024, 21:05:02
{txt}
{com}. //_1
. clear
{txt}
{com}. set more off
{txt}
{com}. //_2
. cd "/Users/Sam/Desktop/Econ 645/Data/Wooldridge"
{res}/Users/Sam/Desktop/Econ 645/Data/Wooldridge
{txt}
{com}. //_3
. use mroz.dta, clear
{txt}
{com}. //_4
. tabulate inlf

       {txt}inlf {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        325       43.16       43.16
{txt}          1 {c |}{res}        428       56.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        753      100.00
{txt}
{com}. //_5
. est clear
{txt}
{com}. //_6
. eststo Logit: logit inlf nwifeinc educ exper expersq kidslt6 kidsge6

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:-422.78042}  
Iteration 2:{space 3}log likelihood = {res:-421.73851}  
Iteration 3:{space 3}log likelihood = {res:-421.73502}  
Iteration 4:{space 3}log likelihood = {res:-421.73502}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}       753
{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}    186.28
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-421.73502{txt}{col 49}Pseudo R2{col 67}= {res}    0.1809

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        inlf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0301171{col 26}{space 2} .0082431{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.0462734{col 67}{space 3}-.0139609
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .2520038{col 26}{space 2} .0425492{col 37}{space 1}    5.92{col 46}{space 3}0.000{col 54}{space 4}  .168609{col 67}{space 3} .3353987
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .2057387{col 26}{space 2} .0310518{col 37}{space 1}    6.63{col 46}{space 3}0.000{col 54}{space 4} .1448784{col 67}{space 3}  .266599
{txt}{space 5}expersq {c |}{col 14}{res}{space 2} -.003913{col 26}{space 2} .0009994{col 37}{space 1}   -3.92{col 46}{space 3}0.000{col 54}{space 4}-.0058718{col 67}{space 3}-.0019541
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.9175126{col 26}{space 2} .1742458{col 37}{space 1}   -5.27{col 46}{space 3}0.000{col 54}{space 4}-1.259028{col 67}{space 3}-.5759971
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .2226164{col 26}{space 2} .0683456{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .0886616{col 67}{space 3} .3565713
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.739707{col 26}{space 2}  .543217{col 37}{space 1}   -6.88{col 46}{space 3}0.000{col 54}{space 4}-4.804392{col 67}{space 3}-2.675021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_7
. eststo Probit: probit inlf nwifeinc educ exper expersq kidslt6 kidsge6

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:-422.36847}  
Iteration 2:{space 3}log likelihood = {res:-421.80202}  
Iteration 3:{space 3}log likelihood = {res:-421.80161}  
Iteration 4:{space 3}log likelihood = {res:-421.80161}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}       753
{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}    186.14
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-421.80161{txt}{col 49}Pseudo R2{col 67}= {res}    0.1808

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        inlf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2} -.017188{col 26}{space 2}   .00474{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0264782{col 67}{space 3}-.0078978
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .1501412{col 26}{space 2}   .02471{col 37}{space 1}    6.08{col 46}{space 3}0.000{col 54}{space 4} .1017105{col 67}{space 3} .1985719
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .1240105{col 26}{space 2} .0183233{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .0880975{col 67}{space 3} .1599236
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0023694{col 26}{space 2} .0005913{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-.0035284{col 67}{space 3}-.0012103
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.5543317{col 26}{space 2} .1038244{col 37}{space 1}   -5.34{col 46}{space 3}0.000{col 54}{space 4}-.7578238{col 67}{space 3}-.3508395
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .1307901{col 26}{space 2} .0399186{col 37}{space 1}    3.28{col 46}{space 3}0.001{col 54}{space 4} .0525511{col 67}{space 3} .2090292
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.244553{col 26}{space 2} .3146254{col 37}{space 1}   -7.13{col 46}{space 3}0.000{col 54}{space 4}-2.861207{col 67}{space 3}-1.627899
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. esttab Logit Probit, mtitle
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                    Logit          Probit   
{txt}{hline 44}
{res}inlf                                        {txt}
{txt}nwifeinc    {res}      -0.0301***      -0.0172***{txt}
            {res} {ralign 12:{txt:(}-3.65{txt:)}}    {ralign 12:{txt:(}-3.63{txt:)}}   {txt}

{txt}educ        {res}        0.252***        0.150***{txt}
            {res} {ralign 12:{txt:(}5.92{txt:)}}    {ralign 12:{txt:(}6.08{txt:)}}   {txt}

{txt}exper       {res}        0.206***        0.124***{txt}
            {res} {ralign 12:{txt:(}6.63{txt:)}}    {ralign 12:{txt:(}6.77{txt:)}}   {txt}

{txt}expersq     {res}     -0.00391***     -0.00237***{txt}
            {res} {ralign 12:{txt:(}-3.92{txt:)}}    {ralign 12:{txt:(}-4.01{txt:)}}   {txt}

{txt}kidslt6     {res}       -0.918***       -0.554***{txt}
            {res} {ralign 12:{txt:(}-5.27{txt:)}}    {ralign 12:{txt:(}-5.34{txt:)}}   {txt}

{txt}kidsge6     {res}        0.223**         0.131** {txt}
            {res} {ralign 12:{txt:(}3.26{txt:)}}    {ralign 12:{txt:(}3.28{txt:)}}   {txt}

{txt}_cons       {res}       -3.740***       -2.245***{txt}
            {res} {ralign 12:{txt:(}-6.88{txt:)}}    {ralign 12:{txt:(}-7.13{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          753             753   {txt}
{txt}{hline 44}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_9
. est clear
{txt}
{com}. //_10
. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo LPM: margins, dydx(*) post 
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0034052{col 26}{space 2} .0014485{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0062488{col 67}{space 3}-.0005616
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0379953{col 26}{space 2}  .007376{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4}  .023515{col 67}{space 3} .0524756
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0394924{col 26}{space 2} .0056727{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} .0283561{col 67}{space 3} .0506287
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005963{col 26}{space 2} .0001848{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0009591{col 67}{space 3}-.0002335
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0160908{col 26}{space 2} .0024847{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0209686{col 67}{space 3} -.011213
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0130122{col 26}{space 2}  .013196{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.0128935{col 67}{space 3} .0389179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_11
. quietly logit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Logit: margins, dydx(*) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0038118{col 26}{space 2} .0014824{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0067172{col 67}{space 3}-.0009064
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0394965{col 26}{space 2} .0072947{col 37}{space 1}    5.41{col 46}{space 3}0.000{col 54}{space 4} .0251992{col 67}{space 3} .0537939
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0367641{col 26}{space 2}   .00515{col 37}{space 1}    7.14{col 46}{space 3}0.000{col 54}{space 4} .0266702{col 67}{space 3}  .046858
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005633{col 26}{space 2} .0001774{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.0009109{col 67}{space 3}-.0002156
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0157194{col 26}{space 2} .0023808{col 37}{space 1}   -6.60{col 46}{space 3}0.000{col 54}{space 4}-.0203856{col 67}{space 3}-.0110532
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2577537{col 26}{space 2} .0319416{col 37}{space 1}   -8.07{col 46}{space 3}0.000{col 54}{space 4}-.3203581{col 67}{space 3}-.1951492
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0107348{col 26}{space 2}  .013333{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-.0153974{col 67}{space 3} .0368671
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_12
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Probit: margins, dydx(*) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0036162{col 26}{space 2} .0014414{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0064413{col 67}{space 3}-.0007911
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0393703{col 26}{space 2} .0072216{col 37}{space 1}    5.45{col 46}{space 3}0.000{col 54}{space 4} .0252161{col 67}{space 3} .0535244
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0370974{col 26}{space 2} .0051522{col 37}{space 1}    7.20{col 46}{space 3}0.000{col 54}{space 4} .0269993{col 67}{space 3} .0471956
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005675{col 26}{space 2} .0001771{col 37}{space 1}   -3.20{col 46}{space 3}0.001{col 54}{space 4}-.0009146{col 67}{space 3}-.0002204
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0158957{col 26}{space 2} .0023587{col 37}{space 1}   -6.74{col 46}{space 3}0.000{col 54}{space 4}-.0205186{col 67}{space 3}-.0112728
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2611542{col 26}{space 2} .0318597{col 37}{space 1}   -8.20{col 46}{space 3}0.000{col 54}{space 4}-.3235982{col 67}{space 3}-.1987103
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0108287{col 26}{space 2} .0130584{col 37}{space 1}    0.83{col 46}{space 3}0.407{col 54}{space 4}-.0147654{col 67}{space 3} .0364227
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_13
. esttab LPM Logit Probit, mtitle 
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}                      LPM           Logit          Probit   
{txt}{hline 60}
{txt}nwifeinc    {res}     -0.00341*       -0.00381*       -0.00362*  {txt}
            {res} {ralign 12:{txt:(}-2.35{txt:)}}    {ralign 12:{txt:(}-2.57{txt:)}}    {ralign 12:{txt:(}-2.51{txt:)}}   {txt}

{txt}educ        {res}       0.0380***       0.0395***       0.0394***{txt}
            {res} {ralign 12:{txt:(}5.15{txt:)}}    {ralign 12:{txt:(}5.41{txt:)}}    {ralign 12:{txt:(}5.45{txt:)}}   {txt}

{txt}exper       {res}       0.0395***       0.0368***       0.0371***{txt}
            {res} {ralign 12:{txt:(}6.96{txt:)}}    {ralign 12:{txt:(}7.14{txt:)}}    {ralign 12:{txt:(}7.20{txt:)}}   {txt}

{txt}expersq     {res}    -0.000596**     -0.000563**     -0.000568** {txt}
            {res} {ralign 12:{txt:(}-3.23{txt:)}}    {ralign 12:{txt:(}-3.18{txt:)}}    {ralign 12:{txt:(}-3.20{txt:)}}   {txt}

{txt}age         {res}      -0.0161***      -0.0157***      -0.0159***{txt}
            {res} {ralign 12:{txt:(}-6.48{txt:)}}    {ralign 12:{txt:(}-6.60{txt:)}}    {ralign 12:{txt:(}-6.74{txt:)}}   {txt}

{txt}kidslt6     {res}       -0.262***       -0.258***       -0.261***{txt}
            {res} {ralign 12:{txt:(}-7.81{txt:)}}    {ralign 12:{txt:(}-8.07{txt:)}}    {ralign 12:{txt:(}-8.20{txt:)}}   {txt}

{txt}kidsge6     {res}       0.0130          0.0107          0.0108   {txt}
            {res} {ralign 12:{txt:(}0.99{txt:)}}    {ralign 12:{txt:(}0.81{txt:)}}    {ralign 12:{txt:(}0.83{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}          753             753             753   {txt}
{txt}{hline 60}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_14
. est clear
{txt}
{com}. //_15
. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo LPM: margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}178.0385 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0034052{col 26}{space 2} .0014485{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0062488{col 67}{space 3}-.0005616
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0379953{col 26}{space 2}  .007376{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4}  .023515{col 67}{space 3} .0524756
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0394924{col 26}{space 2} .0056727{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} .0283561{col 67}{space 3} .0506287
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005963{col 26}{space 2} .0001848{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0009591{col 67}{space 3}-.0002335
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0160908{col 26}{space 2} .0024847{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0209686{col 67}{space 3} -.011213
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0130122{col 26}{space 2}  .013196{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.0128935{col 67}{space 3} .0389179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_16
. quietly logit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Logit: margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}178.0385 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0051901{col 26}{space 2} .0020482{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-.0092045{col 67}{space 3}-.0011756
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0537773{col 26}{space 2} .0105608{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} .0330785{col 67}{space 3} .0744761
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0500569{col 26}{space 2} .0078247{col 37}{space 1}    6.40{col 46}{space 3}0.000{col 54}{space 4} .0347209{col 67}{space 3}  .065393
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0007669{col 26}{space 2} .0002477{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.0012524{col 67}{space 3}-.0002815
{txt}{space 9}age {c |}{col 14}{res}{space 2} -.021403{col 26}{space 2} .0035398{col 37}{space 1}   -6.05{col 46}{space 3}0.000{col 54}{space 4}-.0283408{col 67}{space 3}-.0144652
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.3509498{col 26}{space 2} .0496395{col 37}{space 1}   -7.07{col 46}{space 3}0.000{col 54}{space 4}-.4482414{col 67}{space 3}-.2536583
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0146162{col 26}{space 2} .0181884{col 37}{space 1}    0.80{col 46}{space 3}0.422{col 54}{space 4}-.0210324{col 67}{space 3} .0502649
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_17
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Probit: margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}178.0385 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0046962{col 26}{space 2} .0018903{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0084012{col 67}{space 3}-.0009913
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0511287{col 26}{space 2} .0098592{col 37}{space 1}    5.19{col 46}{space 3}0.000{col 54}{space 4} .0318051{col 67}{space 3} .0704523
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0481771{col 26}{space 2} .0073278{col 37}{space 1}    6.57{col 46}{space 3}0.000{col 54}{space 4} .0338149{col 67}{space 3} .0625392
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0007371{col 26}{space 2} .0002347{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4} -.001197{col 67}{space 3}-.0002771
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0206432{col 26}{space 2} .0033079{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.0271265{col 67}{space 3}-.0141598
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.3391514{col 26}{space 2} .0463581{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.4300117{col 67}{space 3}-.2482911
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0140628{col 26}{space 2} .0169852{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 54}{space 4}-.0192275{col 67}{space 3} .0473531
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_18
. esttab LPM Logit Probit, mtitle 
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}                      LPM           Logit          Probit   
{txt}{hline 60}
{txt}nwifeinc    {res}     -0.00341*       -0.00519*       -0.00470*  {txt}
            {res} {ralign 12:{txt:(}-2.35{txt:)}}    {ralign 12:{txt:(}-2.53{txt:)}}    {ralign 12:{txt:(}-2.48{txt:)}}   {txt}

{txt}educ        {res}       0.0380***       0.0538***       0.0511***{txt}
            {res} {ralign 12:{txt:(}5.15{txt:)}}    {ralign 12:{txt:(}5.09{txt:)}}    {ralign 12:{txt:(}5.19{txt:)}}   {txt}

{txt}exper       {res}       0.0395***       0.0501***       0.0482***{txt}
            {res} {ralign 12:{txt:(}6.96{txt:)}}    {ralign 12:{txt:(}6.40{txt:)}}    {ralign 12:{txt:(}6.57{txt:)}}   {txt}

{txt}expersq     {res}    -0.000596**     -0.000767**     -0.000737** {txt}
            {res} {ralign 12:{txt:(}-3.23{txt:)}}    {ralign 12:{txt:(}-3.10{txt:)}}    {ralign 12:{txt:(}-3.14{txt:)}}   {txt}

{txt}age         {res}      -0.0161***      -0.0214***      -0.0206***{txt}
            {res} {ralign 12:{txt:(}-6.48{txt:)}}    {ralign 12:{txt:(}-6.05{txt:)}}    {ralign 12:{txt:(}-6.24{txt:)}}   {txt}

{txt}kidslt6     {res}       -0.262***       -0.351***       -0.339***{txt}
            {res} {ralign 12:{txt:(}-7.81{txt:)}}    {ralign 12:{txt:(}-7.07{txt:)}}    {ralign 12:{txt:(}-7.32{txt:)}}   {txt}

{txt}kidsge6     {res}       0.0130          0.0146          0.0141   {txt}
            {res} {ralign 12:{txt:(}0.99{txt:)}}    {ralign 12:{txt:(}0.80{txt:)}}    {ralign 12:{txt:(}0.83{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}          753             753             753   {txt}
{txt}{hline 60}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_19
. est clear
{txt}
{com}. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo lpm: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1015504{col 26}{space 2}  .091955{col 37}{space 1}    1.10{col 46}{space 3}0.270{col 54}{space 4}-.0789714{col 67}{space 3} .2820723
{txt}{space 10}2  {c |}{col 14}{res}{space 2}  .177541{col 26}{space 2} .0774562{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0254827{col 67}{space 3} .3295993
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2535316{col 26}{space 2} .0630748{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .1297062{col 67}{space 3} .3773571
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .3295222{col 26}{space 2} .0489147{col 37}{space 1}    6.74{col 46}{space 3}0.000{col 54}{space 4} .2334952{col 67}{space 3} .4255492
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .4055128{col 26}{space 2} .0352435{col 37}{space 1}   11.51{col 46}{space 3}0.000{col 54}{space 4} .3363244{col 67}{space 3} .4747013
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .4815034{col 26}{space 2} .0229524{col 37}{space 1}   20.98{col 46}{space 3}0.000{col 54}{space 4} .4364444{col 67}{space 3} .5265625
{txt}{space 10}7  {c |}{col 14}{res}{space 2}  .557494{col 26}{space 2} .0157087{col 37}{space 1}   35.49{col 46}{space 3}0.000{col 54}{space 4} .5266554{col 67}{space 3} .5883327
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .6334846{col 26}{space 2}  .020049{col 37}{space 1}   31.60{col 46}{space 3}0.000{col 54}{space 4} .5941254{col 67}{space 3} .6728439
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .7094753{col 26}{space 2} .0315024{col 37}{space 1}   22.52{col 46}{space 3}0.000{col 54}{space 4} .6476311{col 67}{space 3} .7713194
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .7854659{col 26}{space 2} .0449232{col 37}{space 1}   17.48{col 46}{space 3}0.000{col 54}{space 4} .6972748{col 67}{space 3} .8736569
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .8614565{col 26}{space 2} .0589832{col 37}{space 1}   14.61{col 46}{space 3}0.000{col 54}{space 4} .7456633{col 67}{space 3} .9772496
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_20
. quietly logit inlf nwifeinc educ exper expersq kidslt6 kidsge6
{txt}
{com}. eststo logit1: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0862997{col 26}{space 2} .0378791{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .0120581{col 67}{space 3} .1605413
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .1307839{col 26}{space 2}   .04457{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0434283{col 67}{space 3} .2181396
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1911164{col 26}{space 2} .0475215{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4}  .097976{col 67}{space 3} .2842567
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .2675469{col 26}{space 2} .0448132{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .1797146{col 67}{space 3} .3553791
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .3575117{col 26}{space 2} .0362904{col 37}{space 1}    9.85{col 46}{space 3}0.000{col 54}{space 4} .2863838{col 67}{space 3} .4286396
{txt}{space 10}6  {c |}{col 14}{res}{space 2}  .455911{col 26}{space 2}  .024513{col 37}{space 1}   18.60{col 46}{space 3}0.000{col 54}{space 4} .4078663{col 67}{space 3} .5039556
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .5562468{col 26}{space 2} .0165243{col 37}{space 1}   33.66{col 46}{space 3}0.000{col 54}{space 4} .5238597{col 67}{space 3} .5886338
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .6519779{col 26}{space 2} .0204676{col 37}{space 1}   31.85{col 46}{space 3}0.000{col 54}{space 4} .6118622{col 67}{space 3} .6920936
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .7376484{col 26}{space 2} .0281232{col 37}{space 1}   26.23{col 46}{space 3}0.000{col 54}{space 4} .6825279{col 67}{space 3} .7927688
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .8096698{col 26}{space 2} .0325919{col 37}{space 1}   24.84{col 46}{space 3}0.000{col 54}{space 4} .7457909{col 67}{space 3} .8735486
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .8666826{col 26}{space 2} .0327653{col 37}{space 1}   26.45{col 46}{space 3}0.000{col 54}{space 4} .8024638{col 67}{space 3} .9309015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_21
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo probit1: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1315922{col 26}{space 2}  .055059{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .0236785{col 67}{space 3} .2395059
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .1833441{col 26}{space 2} .0570249{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0715773{col 67}{space 3} .2951109
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2455272{col 26}{space 2} .0543798{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} .1389447{col 67}{space 3} .3521097
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .3168216{col 26}{space 2} .0470756{col 37}{space 1}    6.73{col 46}{space 3}0.000{col 54}{space 4} .2245552{col 67}{space 3}  .409088
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .3949415{col 26}{space 2} .0360827{col 37}{space 1}   10.95{col 46}{space 3}0.000{col 54}{space 4} .3242206{col 67}{space 3} .4656623
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .4768675{col 26}{space 2} .0237722{col 37}{space 1}   20.06{col 46}{space 3}0.000{col 54}{space 4} .4302749{col 67}{space 3} .5234602
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .5592018{col 26}{space 2} .0159547{col 37}{space 1}   35.05{col 46}{space 3}0.000{col 54}{space 4} .5279311{col 67}{space 3} .5904724
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .6385748{col 26}{space 2} .0200316{col 37}{space 1}   31.88{col 46}{space 3}0.000{col 54}{space 4} .5993136{col 67}{space 3}  .677836
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .7120285{col 26}{space 2} .0288142{col 37}{space 1}   24.71{col 46}{space 3}0.000{col 54}{space 4} .6555538{col 67}{space 3} .7685032
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .7773109{col 26}{space 2} .0357596{col 37}{space 1}   21.74{col 46}{space 3}0.000{col 54}{space 4} .7072234{col 67}{space 3} .8473984
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .8330432{col 26}{space 2} .0391944{col 37}{space 1}   21.25{col 46}{space 3}0.000{col 54}{space 4} .7562235{col 67}{space 3} .9098629
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_22
. coefplot lpm logit1, at recast(line) ciopts(recast(rline) lpattern(dash))
{res}{txt}
{com}. coefplot lpm probit1, at recast(line) ciopts(recast(rline) lpattern(dash))
{res}{txt}
{com}. coefplot logit1 probit1, at recast(line) ciopts(recast(rline) lpattern(dash))
{res}{txt}
{com}. //_23
. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. margins, dydx(kidslt6) at(educ=(0(2)20))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:kidslt6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}kidslt6      {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_24
. quietly logit inlf nwifeinc educ exper expersq kidslt6 kidsge6
{txt}
{com}. margins, dydx(kidslt6) at(educ=(0(2)20))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:kidslt6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}kidslt6      {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0677567{col 26}{space 2} .0262236{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.1191539{col 67}{space 3}-.0163594
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0949468{col 26}{space 2} .0281434{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.1501069{col 67}{space 3}-.0397867
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1248173{col 26}{space 2} .0285395{col 37}{space 1}   -4.37{col 46}{space 3}0.000{col 54}{space 4}-.1807537{col 67}{space 3}-.0688808
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.1526688{col 26}{space 2} .0293293{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.2101531{col 67}{space 3}-.0951844
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.1732958{col 26}{space 2} .0313347{col 37}{space 1}   -5.53{col 46}{space 3}0.000{col 54}{space 4}-.2347106{col 67}{space 3} -.111881
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.1829484{col 26}{space 2} .0327734{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.2471831{col 67}{space 3}-.1187137
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.1803418{col 26}{space 2} .0319215{col 37}{space 1}   -5.65{col 46}{space 3}0.000{col 54}{space 4}-.2429069{col 67}{space 3}-.1177768
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.1665232{col 26}{space 2} .0289231{col 37}{space 1}   -5.76{col 46}{space 3}0.000{col 54}{space 4}-.2232115{col 67}{space 3}-.1098349
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.1442912{col 26}{space 2} .0254362{col 37}{space 1}   -5.67{col 46}{space 3}0.000{col 54}{space 4}-.1941452{col 67}{space 3}-.0944372
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.1175221{col 26}{space 2} .0231237{col 37}{space 1}   -5.08{col 46}{space 3}0.000{col 54}{space 4}-.1628437{col 67}{space 3}-.0722005
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0902871{col 26}{space 2} .0218973{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-.1332051{col 67}{space 3}-.0473691
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_logitinlf.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_logitinlf.png written in PNG format)

{com}. //_25
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. margins, dydx(kidslt6) at(educ=(0(2)20))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:kidslt6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}kidslt6      {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} -.153748{col 26}{space 2} .0455045{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-.2429352{col 67}{space 3}-.0645607
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.1893831{col 26}{space 2} .0408614{col 37}{space 1}   -4.63{col 46}{space 3}0.000{col 54}{space 4}-.2694699{col 67}{space 3}-.1092962
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.2223621{col 26}{space 2} .0360335{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-.2929864{col 67}{space 3}-.1517377
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.2492771{col 26}{space 2}  .033371{col 37}{space 1}   -7.47{col 46}{space 3}0.000{col 54}{space 4}-.3146829{col 67}{space 3}-.1838712
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.2672253{col 26}{space 2} .0331963{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-.3322889{col 67}{space 3}-.2021617
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.2743121{col 26}{space 2} .0335951{col 37}{space 1}   -8.17{col 46}{space 3}0.000{col 54}{space 4}-.3401572{col 67}{space 3} -.208467
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.2699501{col 26}{space 2}  .032832{col 37}{space 1}   -8.22{col 46}{space 3}0.000{col 54}{space 4}-.3342997{col 67}{space 3}-.2056006
{txt}{space 10}8  {c |}{col 14}{res}{space 2} -.254902{col 26}{space 2}  .030869{col 37}{space 1}   -8.26{col 46}{space 3}0.000{col 54}{space 4}-.3154042{col 67}{space 3}-.1943998
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.2310833{col 26}{space 2} .0292123{col 37}{space 1}   -7.91{col 46}{space 3}0.000{col 54}{space 4}-.2883384{col 67}{space 3}-.1738282
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.2011899{col 26}{space 2} .0295232{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.2590542{col 67}{space 3}-.1433256
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.1682404{col 26}{space 2} .0317255{col 37}{space 1}   -5.30{col 46}{space 3}0.000{col 54}{space 4}-.2304211{col 67}{space 3}-.1060596
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_26
. use "/Users/Sam/Desktop/Econ 645/Data/CPS/mlogit_example.dta", clear
{txt}
{com}. //_27
. mlogit laborforce i.educat exp exp2 i.race_ethnicity i.female i.metroarea i.union i.marital i.hryear4

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-31774.039}  
Iteration 1:{space 3}log likelihood = {res:-22975.759}  
Iteration 2:{space 3}log likelihood = {res:-22620.368}  
Iteration 3:{space 3}log likelihood = {res:-22573.244}  
Iteration 4:{space 3}log likelihood = {res:-22565.789}  
Iteration 5:{space 3}log likelihood = {res:-22564.343}  
Iteration 6:{space 3}log likelihood = {res:-22564.014}  
Iteration 7:{space 3}log likelihood = {res:-22563.941}  
Iteration 8:{space 3}log likelihood = {res:-22563.925}  
Iteration 9:{space 3}log likelihood = {res:-22563.922}  
Iteration 10:{space 2}log likelihood = {res:-22563.922}  
Iteration 11:{space 2}log likelihood = {res:-22563.922}  
Iteration 12:{space 2}log likelihood = {res:-22563.922}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}    41,599
{txt}{col 49}LR chi2({res}38{txt}){col 67}= {res}  18420.23
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-22563.922{txt}{col 49}Pseudo R2{col 67}= {res}    0.2899

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         laborforcestatus{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Employed                 {col 27}{txt}{c |}  (base outcome)
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Unemployed                {txt}{c |}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2}-.2279524{col 39}{space 2} .1119685{col 50}{space 1}   -2.04{col 59}{space 3}0.042{col 67}{space 4}-.4474066{col 80}{space 3}-.0084982
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.4312492{col 39}{space 2} .1303621{col 50}{space 1}   -3.31{col 59}{space 3}0.001{col 67}{space 4}-.6867542{col 80}{space 3}-.1757442
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.6931682{col 39}{space 2}  .165487{col 50}{space 1}   -4.19{col 59}{space 3}0.000{col 67}{space 4}-1.017517{col 80}{space 3}-.3688197
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.6706784{col 39}{space 2} .1331892{col 50}{space 1}   -5.04{col 59}{space 3}0.000{col 67}{space 4}-.9317245{col 80}{space 3}-.4096323
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-1.063383{col 39}{space 2} .1745188{col 50}{space 1}   -6.09{col 59}{space 3}0.000{col 67}{space 4}-1.405433{col 80}{space 3}-.7213323
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2}-.0291051{col 39}{space 2} .0088759{col 50}{space 1}   -3.28{col 59}{space 3}0.001{col 67}{space 4}-.0465016{col 80}{space 3}-.0117087
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2} .0002524{col 39}{space 2} .0001575{col 50}{space 1}    1.60{col 59}{space 3}0.109{col 67}{space 4}-.0000562{col 80}{space 3} .0005611
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2} -.813795{col 39}{space 2} .3012644{col 50}{space 1}   -2.70{col 59}{space 3}0.007{col 67}{space 4}-1.404262{col 80}{space 3}-.2233275
{txt}{space 19}Black  {c |}{col 27}{res}{space 2}-.3951124{col 39}{space 2} .2756281{col 50}{space 1}   -1.43{col 59}{space 3}0.152{col 67}{space 4}-.9353337{col 80}{space 3} .1451088
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2}-.6504449{col 39}{space 2} .2691511{col 50}{space 1}   -2.42{col 59}{space 3}0.016{col 67}{space 4}-1.177971{col 80}{space 3}-.1229184
{txt}{space 19}White  {c |}{col 27}{res}{space 2}-.7855686{col 39}{space 2} .2616547{col 50}{space 1}   -3.00{col 59}{space 3}0.003{col 67}{space 4}-1.298402{col 80}{space 3}-.2727347
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2}-.4798449{col 39}{space 2} .3366208{col 50}{space 1}   -1.43{col 59}{space 3}0.154{col 67}{space 4} -1.13961{col 80}{space 3} .1799197
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2}-.0004137{col 39}{space 2} .0721979{col 50}{space 1}   -0.01{col 59}{space 3}0.995{col 67}{space 4} -.141919{col 80}{space 3} .1410915
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2}-.1010417{col 39}{space 2}  .097797{col 50}{space 1}   -1.03{col 59}{space 3}0.302{col 67}{space 4}-.2927204{col 80}{space 3} .0906369
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2} .0635435{col 39}{space 2}  .346152{col 50}{space 1}    0.18{col 59}{space 3}0.854{col 67}{space 4} -.614902{col 80}{space 3}  .741989
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2}-19.66515{col 39}{space 2} 2339.277{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-4604.564{col 80}{space 3} 4565.234
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2} .6132556{col 39}{space 2} .1175463{col 50}{space 1}    5.22{col 59}{space 3}0.000{col 67}{space 4} .3828691{col 80}{space 3}  .843642
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} .7526873{col 39}{space 2} .0988405{col 50}{space 1}    7.62{col 59}{space 3}0.000{col 67}{space 4} .5589634{col 80}{space 3} .9464112
{txt}{space 25} {c |}
{space 18}hryear4 {c |}
{space 20}2024  {c |}{col 27}{res}{space 2} .0228376{col 39}{space 2}  .071126{col 50}{space 1}    0.32{col 59}{space 3}0.748{col 67}{space 4}-.1165667{col 80}{space 3} .1622419
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-2.023219{col 39}{space 2} .3012462{col 50}{space 1}   -6.72{col 59}{space 3}0.000{col 67}{space 4}-2.613651{col 80}{space 3}-1.432787
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}NILF                      {txt}{c |}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2}-.7898216{col 39}{space 2} .0425444{col 50}{space 1}  -18.56{col 59}{space 3}0.000{col 67}{space 4}-.8732071{col 80}{space 3}-.7064361
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.8941042{col 39}{space 2} .0479568{col 50}{space 1}  -18.64{col 59}{space 3}0.000{col 67}{space 4}-.9880978{col 80}{space 3}-.8001105
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-1.143176{col 39}{space 2} .0559087{col 50}{space 1}  -20.45{col 59}{space 3}0.000{col 67}{space 4}-1.252755{col 80}{space 3}-1.033597
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-1.493236{col 39}{space 2} .0488335{col 50}{space 1}  -30.58{col 59}{space 3}0.000{col 67}{space 4}-1.588948{col 80}{space 3}-1.397524
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-1.746904{col 39}{space 2} .0561914{col 50}{space 1}  -31.09{col 59}{space 3}0.000{col 67}{space 4}-1.857038{col 80}{space 3}-1.636771
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2}-.1490983{col 39}{space 2}  .003087{col 50}{space 1}  -48.30{col 59}{space 3}0.000{col 67}{space 4}-.1551487{col 80}{space 3} -.143048
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2} .0031412{col 39}{space 2} .0000469{col 50}{space 1}   66.92{col 59}{space 3}0.000{col 67}{space 4} .0030492{col 80}{space 3} .0032332
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2}-.1995846{col 39}{space 2} .1336975{col 50}{space 1}   -1.49{col 59}{space 3}0.135{col 67}{space 4}-.4616269{col 80}{space 3} .0624578
{txt}{space 19}Black  {c |}{col 27}{res}{space 2}-.1053158{col 39}{space 2} .1293382{col 50}{space 1}   -0.81{col 59}{space 3}0.415{col 67}{space 4} -.358814{col 80}{space 3} .1481824
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2}-.4785722{col 39}{space 2} .1270357{col 50}{space 1}   -3.77{col 59}{space 3}0.000{col 67}{space 4}-.7275575{col 80}{space 3}-.2295869
{txt}{space 19}White  {c |}{col 27}{res}{space 2}-.3378929{col 39}{space 2} .1237786{col 50}{space 1}   -2.73{col 59}{space 3}0.006{col 67}{space 4}-.5804944{col 80}{space 3}-.0952913
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2}-.1802636{col 39}{space 2} .1537778{col 50}{space 1}   -1.17{col 59}{space 3}0.241{col 67}{space 4}-.4816625{col 80}{space 3} .1211354
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2} .5781835{col 39}{space 2} .0258942{col 50}{space 1}   22.33{col 59}{space 3}0.000{col 67}{space 4} .5274318{col 80}{space 3} .6289351
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2}-.0069684{col 39}{space 2} .0328081{col 50}{space 1}   -0.21{col 59}{space 3}0.832{col 67}{space 4}-.0712712{col 80}{space 3} .0573344
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2}-.0021328{col 39}{space 2} .1282129{col 50}{space 1}   -0.02{col 59}{space 3}0.987{col 67}{space 4}-.2534254{col 80}{space 3} .2491598
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2}-20.25621{col 39}{space 2} 566.9973{col 50}{space 1}   -0.04{col 59}{space 3}0.972{col 67}{space 4} -1131.55{col 80}{space 3} 1091.038
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2}-.0531382{col 39}{space 2} .0373157{col 50}{space 1}   -1.42{col 59}{space 3}0.154{col 67}{space 4}-.1262757{col 80}{space 3} .0199993
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} .1464745{col 39}{space 2} .0379587{col 50}{space 1}    3.86{col 59}{space 3}0.000{col 67}{space 4} .0720769{col 80}{space 3} .2208722
{txt}{space 25} {c |}
{space 18}hryear4 {c |}
{space 20}2024  {c |}{col 27}{res}{space 2}-.0398405{col 39}{space 2} .0253899{col 50}{space 1}   -1.57{col 59}{space 3}0.117{col 67}{space 4}-.0896037{col 80}{space 3} .0099228
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2} 1.072448{col 39}{space 2} .1365064{col 50}{space 1}    7.86{col 59}{space 3}0.000{col 67}{space 4} .8049003{col 80}{space 3} 1.339996
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 2044 observations completely determined.{txt}  Standard errors questionable.{p_end}

{com}. //_28
. quietly mlogit laborforce i.educat exp exp2 i.race_ethnicity i.female i.metroarea i.union i.marital i.hryear4
{txt}
{com}. estimates store unrestricted
{txt}
{com}. //_29
. quietly mlogit laborforce i.educat exp exp2 i.race_ethnicity i.female i.metroarea i.union i.marital if laborforce !=2
{txt}
{com}. estimate store restricted
{txt}
{com}. //_30
. hausman restricted unrestricted, alleqs constant

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:2}) does not equal the number of coefficients being tested ({result:19}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17} restricted {col 30}unrestricted{col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 6}educat {c |}
{space 10}2  {c |}{res}{col 18}-.7860864{col 31}-.7898216{col 47} .0037352{col 63} .0035785
{txt}{space 10}3  {c |}{res}{col 18}  -.89149{col 31}-.8941042{col 47} .0026142{col 63} .0032032
{txt}{space 10}4  {c |}{res}{col 18}-1.140012{col 31}-1.143176{col 47}  .003164{col 63}  .003669
{txt}{space 10}5  {c |}{res}{col 18}-1.486705{col 31}-1.493236{col 47} .0065306{col 63} .0036976
{txt}{space 10}6  {c |}{res}{col 18}-1.737118{col 31}-1.746904{col 47} .0097867{col 63} .0035815
{txt}{space 9}exp {c |}{res}{col 18}-.1486206{col 31}-.1490983{col 47} .0004777{col 63} .0002218
{txt}{space 8}exp2 {c |}{res}{col 18} .0031335{col 31} .0031412{col 47}-7.78e-06{col 63} 2.91e-06
{txt}race_ethni~y {c |}
{space 10}2  {c |}{res}{col 18}-.1712505{col 31}-.1995846{col 47} .0283341{col 63} .0120289
{txt}{space 10}3  {c |}{res}{col 18}-.0717454{col 31}-.1053158{col 47} .0335704{col 63} .0121412
{txt}{space 10}4  {c |}{res}{col 18}-.4427331{col 31}-.4785722{col 47} .0358391{col 63} .0115676
{txt}{space 10}5  {c |}{res}{col 18}-.3060009{col 31}-.3378929{col 47}  .031892{col 63} .0117006
{txt}{space 10}6  {c |}{res}{col 18}-.1491388{col 31}-.1802636{col 47} .0311247{col 63} .0136923
{txt}{space 4}1.female {c |}{res}{col 18} .5793374{col 31} .5781835{col 47} .0011539{col 63} .0018992
{txt}{space 3}metroarea {c |}
{space 10}2  {c |}{res}{col 18}-.0070074{col 31}-.0069684{col 47} -.000039{col 63}  .002025
{txt}{space 10}3  {c |}{res}{col 18}-.0064057{col 31}-.0021328{col 47}-.0042729{col 63} .0112617
{txt}{space 5}1.union {c |}{res}{col 18}-20.20846{col 31}-20.25621{col 47} .0477553{col 63}        .
{txt}{space 5}marital {c |}
{space 10}2  {c |}{res}{col 18}-.0524486{col 31}-.0531382{col 47} .0006896{col 63} .0022895
{txt}{space 10}3  {c |}{res}{col 18} .1495841{col 31} .1464745{col 47} .0031096{col 63} .0023193
{txt}{space 7}_cons {c |}{res}{col 18}  1.00979{col 31} 1.072448{col 47}-.0626578{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from mlogit}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from mlogit}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:2})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}      8.92
{txt}{col 17}Prob>chi2 =  {res}    0.0116
{txt}{col 17}(V_b-V_B is not positive definite)

{com}. //_31
. quietly mlogit laborforce i.educat exp exp2 i.race_ethnicity i.female i.metroarea i.union i.marital, base(1)
{txt}
{com}. margins, atmeans predict(outcome(1))
{res}
{txt}Adjusted predictions{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Employed), predict(outcome(1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.educat}{space 8}{txt:=} {space 3}.1261088 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.educat}{space 8}{txt:=} {space 4}.286954 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.educat}{space 8}{txt:=} {space 3}.1488497 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.educat}{space 8}{txt:=} {space 3}.0969254 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.educat}{space 8}{txt:=} {space 3}.2079617 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.educat}{space 8}{txt:=} {space 3}.1332003 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp}{space 13}{txt:=} {space 3}32.89247 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp2}{space 12}{txt:=} {space 3}1467.595 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.race_eth~y}{space 4}{txt:=} {space 3}.0098079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.race_eth~y}{space 4}{txt:=} {space 3}.0622611 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.race_eth~y}{space 4}{txt:=} {space 3}.0931032 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.race_eth~y}{space 4}{txt:=} {space 3}.1487776 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.race_eth~y}{space 4}{txt:=} {space 3}.6685738 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.race_eth~y}{space 4}{txt:=} {space 3}.0174764 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.female}{space 8}{txt:=} {space 3}.4804923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.female}{space 8}{txt:=} {space 3}.5195077 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.metroarea}{space 5}{txt:=} {space 3}.8000673 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.metroarea}{space 5}{txt:=} {space 3}.1904132 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.metroarea}{space 5}{txt:=} {space 3}.0095195 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.union}{space 9}{txt:=} {space 3}.9508642 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.union}{space 9}{txt:=} {space 3}.0491358 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.marital}{space 7}{txt:=} {space 3}.5163586 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.marital}{space 7}{txt:=} {space 3}.1819515 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.marital}{space 7}{txt:=} {space 3}.3016899 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .7684672{col 26}{space 2} 4.830264{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-8.698677{col 67}{space 3} 10.23561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins, atmeans predict(outcome(2))
{res}
{txt}Adjusted predictions{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Unemployed), predict(outcome(2))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.educat}{space 8}{txt:=} {space 3}.1261088 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.educat}{space 8}{txt:=} {space 4}.286954 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.educat}{space 8}{txt:=} {space 3}.1488497 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.educat}{space 8}{txt:=} {space 3}.0969254 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.educat}{space 8}{txt:=} {space 3}.2079617 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.educat}{space 8}{txt:=} {space 3}.1332003 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp}{space 13}{txt:=} {space 3}32.89247 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp2}{space 12}{txt:=} {space 3}1467.595 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.race_eth~y}{space 4}{txt:=} {space 3}.0098079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.race_eth~y}{space 4}{txt:=} {space 3}.0622611 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.race_eth~y}{space 4}{txt:=} {space 3}.0931032 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.race_eth~y}{space 4}{txt:=} {space 3}.1487776 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.race_eth~y}{space 4}{txt:=} {space 3}.6685738 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.race_eth~y}{space 4}{txt:=} {space 3}.0174764 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.female}{space 8}{txt:=} {space 3}.4804923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.female}{space 8}{txt:=} {space 3}.5195077 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.metroarea}{space 5}{txt:=} {space 3}.8000673 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.metroarea}{space 5}{txt:=} {space 3}.1904132 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.metroarea}{space 5}{txt:=} {space 3}.0095195 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.union}{space 9}{txt:=} {space 3}.9508642 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.union}{space 9}{txt:=} {space 3}.0491358 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.marital}{space 7}{txt:=} {space 3}.5163586 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.marital}{space 7}{txt:=} {space 3}.1819515 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.marital}{space 7}{txt:=} {space 3}.3016899 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0090578{col 26}{space 2}  1.03352{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-2.016605{col 67}{space 3}  2.03472
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins, atmeans predict(outcome(3))
{res}
{txt}Adjusted predictions{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==NILF), predict(outcome(3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.educat}{space 8}{txt:=} {space 3}.1261088 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.educat}{space 8}{txt:=} {space 4}.286954 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.educat}{space 8}{txt:=} {space 3}.1488497 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.educat}{space 8}{txt:=} {space 3}.0969254 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.educat}{space 8}{txt:=} {space 3}.2079617 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.educat}{space 8}{txt:=} {space 3}.1332003 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp}{space 13}{txt:=} {space 3}32.89247 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp2}{space 12}{txt:=} {space 3}1467.595 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.race_eth~y}{space 4}{txt:=} {space 3}.0098079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.race_eth~y}{space 4}{txt:=} {space 3}.0622611 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.race_eth~y}{space 4}{txt:=} {space 3}.0931032 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.race_eth~y}{space 4}{txt:=} {space 3}.1487776 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.race_eth~y}{space 4}{txt:=} {space 3}.6685738 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.race_eth~y}{space 4}{txt:=} {space 3}.0174764 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.female}{space 8}{txt:=} {space 3}.4804923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.female}{space 8}{txt:=} {space 3}.5195077 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.metroarea}{space 5}{txt:=} {space 3}.8000673 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.metroarea}{space 5}{txt:=} {space 3}.1904132 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.metroarea}{space 5}{txt:=} {space 3}.0095195 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.union}{space 9}{txt:=} {space 3}.9508642 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.union}{space 9}{txt:=} {space 3}.0491358 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.marital}{space 7}{txt:=} {space 3}.5163586 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.marital}{space 7}{txt:=} {space 3}.1819515 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.marital}{space 7}{txt:=} {space 3}.3016899 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2224751{col 26}{space 2} 4.825216{col 37}{space 1}    0.05{col 46}{space 3}0.963{col 54}{space 4}-9.234774{col 67}{space 3} 9.679725
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_32
. margins, dydx(*) predict(outcome(1))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Employed), predict(outcome(1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat exp exp2 2.race_ethnicity 3.race_ethnicity 4.race_ethnicity 5.race_ethnicity 6.race_ethnicity 1.female 2.metroarea 3.metroarea 1.union 2.marital 3.marital}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2} .1309012{col 39}{space 2} .0072675{col 50}{space 1}   18.01{col 59}{space 3}0.000{col 67}{space 4} .1166572{col 80}{space 3} .1451452
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2} .1499942{col 39}{space 2} .0080928{col 50}{space 1}   18.53{col 59}{space 3}0.000{col 67}{space 4} .1341326{col 80}{space 3} .1658558
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2} .1911979{col 39}{space 2} .0091537{col 50}{space 1}   20.89{col 59}{space 3}0.000{col 67}{space 4} .1732569{col 80}{space 3} .2091389
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2} .2407492{col 39}{space 2} .0078942{col 50}{space 1}   30.50{col 59}{space 3}0.000{col 67}{space 4} .2252768{col 80}{space 3} .2562215
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2} .2789487{col 39}{space 2}  .008527{col 50}{space 1}   32.71{col 59}{space 3}0.000{col 67}{space 4} .2622362{col 80}{space 3} .2956613
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2} .0219808{col 39}{space 2} .0004288{col 50}{space 1}   51.26{col 59}{space 3}0.000{col 67}{space 4} .0211403{col 80}{space 3} .0228213
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2}-.0004585{col 39}{space 2} 5.91e-06{col 50}{space 1}  -77.62{col 59}{space 3}0.000{col 67}{space 4}  -.00047{col 80}{space 3}-.0004469
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2} .0417403{col 39}{space 2} .0212777{col 50}{space 1}    1.96{col 59}{space 3}0.050{col 67}{space 4} .0000368{col 80}{space 3} .0834438
{txt}{space 19}Black  {c |}{col 27}{res}{space 2} .0224391{col 39}{space 2} .0206352{col 50}{space 1}    1.09{col 59}{space 3}0.277{col 67}{space 4}-.0180052{col 80}{space 3} .0628834
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2} .0802357{col 39}{space 2} .0202145{col 50}{space 1}    3.97{col 59}{space 3}0.000{col 67}{space 4} .0406159{col 80}{space 3} .1198555
{txt}{space 19}White  {c |}{col 27}{res}{space 2} .0618266{col 39}{space 2} .0197636{col 50}{space 1}    3.13{col 59}{space 3}0.002{col 67}{space 4} .0230907{col 80}{space 3} .1005625
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2} .0348149{col 39}{space 2}  .024377{col 50}{space 1}    1.43{col 59}{space 3}0.153{col 67}{space 4}-.0129632{col 80}{space 3}  .082593
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2}-.0839096{col 39}{space 2} .0039186{col 50}{space 1}  -21.41{col 59}{space 3}0.000{col 67}{space 4}-.0915899{col 80}{space 3}-.0762292
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2} .0022776{col 39}{space 2} .0050425{col 50}{space 1}    0.45{col 59}{space 3}0.652{col 67}{space 4}-.0076056{col 80}{space 3} .0121607
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2}-.0007629{col 39}{space 2} .0197304{col 50}{space 1}   -0.04{col 59}{space 3}0.969{col 67}{space 4}-.0394337{col 80}{space 3} .0379079
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2} .4414329{col 39}{space 2} .0020464{col 50}{space 1}  215.71{col 59}{space 3}0.000{col 67}{space 4} .4374219{col 80}{space 3} .4454438
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2} .0001626{col 39}{space 2} .0057357{col 50}{space 1}    0.03{col 59}{space 3}0.977{col 67}{space 4}-.0110791{col 80}{space 3} .0114043
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} -.030733{col 39}{space 2}  .005813{col 50}{space 1}   -5.29{col 59}{space 3}0.000{col 67}{space 4}-.0421263{col 80}{space 3}-.0193397
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. margins, dydx(*) predict(outcome(2))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Unemployed), predict(outcome(2))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat exp exp2 2.race_ethnicity 3.race_ethnicity 4.race_ethnicity 5.race_ethnicity 6.race_ethnicity 1.female 2.metroarea 3.metroarea 1.union 2.marital 3.marital}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2} .0021475{col 39}{space 2} .0023962{col 50}{space 1}    0.90{col 59}{space 3}0.370{col 67}{space 4} -.002549{col 80}{space 3}  .006844
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.0014486{col 39}{space 2} .0026367{col 50}{space 1}   -0.55{col 59}{space 3}0.583{col 67}{space 4}-.0066165{col 80}{space 3} .0037194
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.0048071{col 39}{space 2} .0030039{col 50}{space 1}   -1.60{col 59}{space 3}0.110{col 67}{space 4}-.0106946{col 80}{space 3} .0010805
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.0028255{col 39}{space 2} .0026516{col 50}{space 1}   -1.07{col 59}{space 3}0.287{col 67}{space 4}-.0080226{col 80}{space 3} .0023715
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-.0081376{col 39}{space 2} .0028311{col 50}{space 1}   -2.87{col 59}{space 3}0.004{col 67}{space 4}-.0136864{col 80}{space 3}-.0025888
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2} .0004047{col 39}{space 2} .0001592{col 50}{space 1}    2.54{col 59}{space 3}0.011{col 67}{space 4} .0000928{col 80}{space 3} .0007167
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2}-.0000155{col 39}{space 2} 2.78e-06{col 50}{space 1}   -5.57{col 59}{space 3}0.000{col 67}{space 4}-.0000209{col 80}{space 3}  -.00001
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2}-.0176565{col 39}{space 2} .0086621{col 50}{space 1}   -2.04{col 59}{space 3}0.042{col 67}{space 4} -.034634{col 80}{space 3}-.0006791
{txt}{space 19}Black  {c |}{col 27}{res}{space 2}-.0099588{col 39}{space 2} .0085704{col 50}{space 1}   -1.16{col 59}{space 3}0.245{col 67}{space 4}-.0267565{col 80}{space 3} .0068389
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2}-.0128404{col 39}{space 2} .0084135{col 50}{space 1}   -1.53{col 59}{space 3}0.127{col 67}{space 4}-.0293307{col 80}{space 3} .0036498
{txt}{space 19}White  {c |}{col 27}{res}{space 2}-.0163498{col 39}{space 2} .0082939{col 50}{space 1}   -1.97{col 59}{space 3}0.049{col 67}{space 4}-.0326055{col 80}{space 3}-.0000942
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2}-.0112902{col 39}{space 2} .0095517{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-.0300113{col 80}{space 3} .0074308
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2}-.0037756{col 39}{space 2} .0013734{col 50}{space 1}   -2.75{col 59}{space 3}0.006{col 67}{space 4}-.0064674{col 80}{space 3}-.0010838
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2}-.0018498{col 39}{space 2} .0017658{col 50}{space 1}   -1.05{col 59}{space 3}0.295{col 67}{space 4}-.0053107{col 80}{space 3} .0016111
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2} .0012508{col 39}{space 2} .0071177{col 50}{space 1}    0.18{col 59}{space 3}0.861{col 67}{space 4}-.0126997{col 80}{space 3} .0152012
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2}-.0210849{col 39}{space 2} .0007187{col 50}{space 1}  -29.34{col 59}{space 3}0.000{col 67}{space 4}-.0224935{col 80}{space 3}-.0196762
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2} .0110753{col 39}{space 2} .0024351{col 50}{space 1}    4.55{col 59}{space 3}0.000{col 67}{space 4} .0063027{col 80}{space 3} .0158479
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} .0129138{col 39}{space 2} .0018379{col 50}{space 1}    7.03{col 59}{space 3}0.000{col 67}{space 4} .0093115{col 80}{space 3} .0165161
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. margins, dydx(*) predict(outcome(3))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==NILF), predict(outcome(3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat exp exp2 2.race_ethnicity 3.race_ethnicity 4.race_ethnicity 5.race_ethnicity 6.race_ethnicity 1.female 2.metroarea 3.metroarea 1.union 2.marital 3.marital}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2}-.1330487{col 39}{space 2} .0071954{col 50}{space 1}  -18.49{col 59}{space 3}0.000{col 67}{space 4}-.1471514{col 80}{space 3} -.118946
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.1485456{col 39}{space 2} .0079934{col 50}{space 1}  -18.58{col 59}{space 3}0.000{col 67}{space 4}-.1642124{col 80}{space 3}-.1328789
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.1863908{col 39}{space 2} .0090294{col 50}{space 1}  -20.64{col 59}{space 3}0.000{col 67}{space 4}-.2040881{col 80}{space 3}-.1686934
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.2379236{col 39}{space 2} .0077818{col 50}{space 1}  -30.57{col 59}{space 3}0.000{col 67}{space 4}-.2531757{col 80}{space 3}-.2226716
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-.2708111{col 39}{space 2} .0083689{col 50}{space 1}  -32.36{col 59}{space 3}0.000{col 67}{space 4}-.2872139{col 80}{space 3}-.2544084
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2}-.0223855{col 39}{space 2} .0004141{col 50}{space 1}  -54.06{col 59}{space 3}0.000{col 67}{space 4}-.0231971{col 80}{space 3}-.0215739
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2} .0004739{col 39}{space 2} 5.54e-06{col 50}{space 1}   85.61{col 59}{space 3}0.000{col 67}{space 4} .0004631{col 80}{space 3} .0004848
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2}-.0240837{col 39}{space 2} .0207242{col 50}{space 1}   -1.16{col 59}{space 3}0.245{col 67}{space 4}-.0647024{col 80}{space 3} .0165349
{txt}{space 19}Black  {c |}{col 27}{res}{space 2}-.0124803{col 39}{space 2} .0200649{col 50}{space 1}   -0.62{col 59}{space 3}0.534{col 67}{space 4}-.0518068{col 80}{space 3} .0268463
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2}-.0673952{col 39}{space 2}   .01964{col 50}{space 1}   -3.43{col 59}{space 3}0.001{col 67}{space 4}-.1058889{col 80}{space 3}-.0289016
{txt}{space 19}White  {c |}{col 27}{res}{space 2}-.0454768{col 39}{space 2} .0191993{col 50}{space 1}   -2.37{col 59}{space 3}0.018{col 67}{space 4}-.0831067{col 80}{space 3}-.0078468
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2}-.0235247{col 39}{space 2} .0237295{col 50}{space 1}   -0.99{col 59}{space 3}0.322{col 67}{space 4}-.0700337{col 80}{space 3} .0229843
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2} .0876852{col 39}{space 2} .0038386{col 50}{space 1}   22.84{col 59}{space 3}0.000{col 67}{space 4} .0801616{col 80}{space 3} .0952088
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2}-.0004278{col 39}{space 2} .0049292{col 50}{space 1}   -0.09{col 59}{space 3}0.931{col 67}{space 4}-.0100888{col 80}{space 3} .0092332
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2}-.0004879{col 39}{space 2} .0192391{col 50}{space 1}   -0.03{col 59}{space 3}0.980{col 67}{space 4}-.0381959{col 80}{space 3} .0372201
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2} -.420348{col 39}{space 2} .0020016{col 50}{space 1} -210.01{col 59}{space 3}0.000{col 67}{space 4} -.424271{col 80}{space 3}-.4164251
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2}-.0112379{col 39}{space 2} .0055186{col 50}{space 1}   -2.04{col 59}{space 3}0.042{col 67}{space 4}-.0220542{col 80}{space 3}-.0004216
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} .0178192{col 39}{space 2} .0057407{col 50}{space 1}    3.10{col 59}{space 3}0.002{col 67}{space 4} .0065676{col 80}{space 3} .0290707
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. //_33
. margins, dydx(*) atmeans predict(outcome(1))
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Employed), predict(outcome(1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat exp exp2 2.race_ethnicity 3.race_ethnicity 4.race_ethnicity 5.race_ethnicity 6.race_ethnicity 1.female 2.metroarea 3.metroarea 1.union 2.marital 3.marital}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.educat}{space 8}{txt:=} {space 3}.1261088 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.educat}{space 8}{txt:=} {space 4}.286954 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.educat}{space 8}{txt:=} {space 3}.1488497 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.educat}{space 8}{txt:=} {space 3}.0969254 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.educat}{space 8}{txt:=} {space 3}.2079617 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.educat}{space 8}{txt:=} {space 3}.1332003 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp}{space 13}{txt:=} {space 3}32.89247 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp2}{space 12}{txt:=} {space 3}1467.595 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.race_eth~y}{space 4}{txt:=} {space 3}.0098079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.race_eth~y}{space 4}{txt:=} {space 3}.0622611 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.race_eth~y}{space 4}{txt:=} {space 3}.0931032 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.race_eth~y}{space 4}{txt:=} {space 3}.1487776 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.race_eth~y}{space 4}{txt:=} {space 3}.6685738 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.race_eth~y}{space 4}{txt:=} {space 3}.0174764 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.female}{space 8}{txt:=} {space 3}.4804923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.female}{space 8}{txt:=} {space 3}.5195077 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.metroarea}{space 5}{txt:=} {space 3}.8000673 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.metroarea}{space 5}{txt:=} {space 3}.1904132 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.metroarea}{space 5}{txt:=} {space 3}.0095195 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.union}{space 9}{txt:=} {space 3}.9508642 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.union}{space 9}{txt:=} {space 3}.0491358 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.marital}{space 7}{txt:=} {space 3}.5163586 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.marital}{space 7}{txt:=} {space 3}.1819515 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.marital}{space 7}{txt:=} {space 3}.3016899 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2} .1755775{col 39}{space 2} 1.437386{col 50}{space 1}    0.12{col 59}{space 3}0.903{col 67}{space 4}-2.641647{col 80}{space 3} 2.992802
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}  .196493{col 39}{space 2}  1.66501{col 50}{space 1}    0.12{col 59}{space 3}0.906{col 67}{space 4}-3.066867{col 80}{space 3} 3.459853
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}  .240734{col 39}{space 2} 2.297249{col 50}{space 1}    0.10{col 59}{space 3}0.917{col 67}{space 4} -4.26179{col 80}{space 3} 4.743258
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2} .2905963{col 39}{space 2} 3.204011{col 50}{space 1}    0.09{col 59}{space 3}0.928{col 67}{space 4} -5.98915{col 80}{space 3} 6.570342
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2} .3223929{col 39}{space 2} 3.782688{col 50}{space 1}    0.09{col 59}{space 3}0.932{col 67}{space 4} -7.09154{col 80}{space 3} 7.736326
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2} .0256925{col 39}{space 2} .3928606{col 50}{space 1}    0.07{col 59}{space 3}0.948{col 67}{space 4}-.7443001{col 80}{space 3} .7956851
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2}-.0005388{col 39}{space 2} .0083342{col 50}{space 1}   -0.06{col 59}{space 3}0.948{col 67}{space 4}-.0168735{col 80}{space 3} .0157959
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2} .0449909{col 39}{space 2} .7906855{col 50}{space 1}    0.06{col 59}{space 3}0.955{col 67}{space 4}-1.504724{col 80}{space 3} 1.594706
{txt}{space 19}Black  {c |}{col 27}{res}{space 2} .0244574{col 39}{space 2} .4314249{col 50}{space 1}    0.06{col 59}{space 3}0.955{col 67}{space 4}-.8211199{col 80}{space 3} .8700347
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2} .0912758{col 39}{space 2} 1.237833{col 50}{space 1}    0.07{col 59}{space 3}0.941{col 67}{space 4}-2.334832{col 80}{space 3} 2.517383
{txt}{space 19}White  {c |}{col 27}{res}{space 2}   .06928{col 39}{space 2} .9827052{col 50}{space 1}    0.07{col 59}{space 3}0.944{col 67}{space 4}-1.856787{col 80}{space 3} 1.995347
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2} .0392659{col 39}{space 2} .5722016{col 50}{space 1}    0.07{col 59}{space 3}0.945{col 67}{space 4}-1.082229{col 80}{space 3} 1.160761
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2}-.0981776{col 39}{space 2} 1.521079{col 50}{space 1}   -0.06{col 59}{space 3}0.949{col 67}{space 4}-3.079437{col 80}{space 3} 2.883082
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2} .0018837{col 39}{space 2} .0756332{col 50}{space 1}    0.02{col 59}{space 3}0.980{col 67}{space 4}-.1463546{col 80}{space 3}  .150122
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2}-.0003745{col 39}{space 2} .0562184{col 50}{space 1}   -0.01{col 59}{space 3}0.995{col 67}{space 4}-.1105606{col 80}{space 3} .1098116
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2}  .448807{col 39}{space 2} .0032032{col 50}{space 1}  140.11{col 59}{space 3}0.000{col 67}{space 4} .4425288{col 80}{space 3} .4550853
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2} .0044561{col 39}{space 2} .5402485{col 50}{space 1}    0.01{col 59}{space 3}0.993{col 67}{space 4}-1.054411{col 80}{space 3} 1.063324
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2}-.0309979{col 39}{space 2} .6401718{col 50}{space 1}   -0.05{col 59}{space 3}0.961{col 67}{space 4}-1.285712{col 80}{space 3} 1.223716
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. margins, dydx(*) atmeans predict(outcome(2))
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Unemployed), predict(outcome(2))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat exp exp2 2.race_ethnicity 3.race_ethnicity 4.race_ethnicity 5.race_ethnicity 6.race_ethnicity 1.female 2.metroarea 3.metroarea 1.union 2.marital 3.marital}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.educat}{space 8}{txt:=} {space 3}.1261088 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.educat}{space 8}{txt:=} {space 4}.286954 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.educat}{space 8}{txt:=} {space 3}.1488497 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.educat}{space 8}{txt:=} {space 3}.0969254 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.educat}{space 8}{txt:=} {space 3}.2079617 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.educat}{space 8}{txt:=} {space 3}.1332003 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp}{space 13}{txt:=} {space 3}32.89247 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp2}{space 12}{txt:=} {space 3}1467.595 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.race_eth~y}{space 4}{txt:=} {space 3}.0098079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.race_eth~y}{space 4}{txt:=} {space 3}.0622611 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.race_eth~y}{space 4}{txt:=} {space 3}.0931032 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.race_eth~y}{space 4}{txt:=} {space 3}.1487776 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.race_eth~y}{space 4}{txt:=} {space 3}.6685738 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.race_eth~y}{space 4}{txt:=} {space 3}.0174764 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.female}{space 8}{txt:=} {space 3}.4804923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.female}{space 8}{txt:=} {space 3}.5195077 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.metroarea}{space 5}{txt:=} {space 3}.8000673 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.metroarea}{space 5}{txt:=} {space 3}.1904132 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.metroarea}{space 5}{txt:=} {space 3}.0095195 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.union}{space 9}{txt:=} {space 3}.9508642 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.union}{space 9}{txt:=} {space 3}.0491358 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.marital}{space 7}{txt:=} {space 3}.5163586 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.marital}{space 7}{txt:=} {space 3}.1819515 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.marital}{space 7}{txt:=} {space 3}.3016899 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2} .0005216{col 39}{space 2} .0755305{col 50}{space 1}    0.01{col 59}{space 3}0.994{col 67}{space 4}-.1475154{col 80}{space 3} .1485587
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.0012432{col 39}{space 2} .1546272{col 50}{space 1}   -0.01{col 59}{space 3}0.994{col 67}{space 4}-.3043069{col 80}{space 3} .3018206
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.0029475{col 39}{space 2} .3436986{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-.6765844{col 80}{space 3} .6706894
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.0022892{col 39}{space 2} .2747643{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-.5408173{col 80}{space 3} .5362389
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-.0047363{col 39}{space 2} .5466531{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-1.076157{col 80}{space 3} 1.066684
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2} .0000394{col 39}{space 2} .0076697{col 50}{space 1}    0.01{col 59}{space 3}0.996{col 67}{space 4} -.014993{col 80}{space 3} .0150718
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2}-4.07e-06{col 39}{space 2} .0004725{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-.0009301{col 80}{space 3}  .000922
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2}-.0089668{col 39}{space 2} 1.008282{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-1.985164{col 80}{space 3}  1.96723
{txt}{space 19}Black  {c |}{col 27}{res}{space 2}-.0051358{col 39}{space 2} .5753938{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-1.132887{col 80}{space 3} 1.122615
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2}-.0069558{col 39}{space 2} .7820821{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-1.539809{col 80}{space 3} 1.525897
{txt}{space 19}White  {c |}{col 27}{res}{space 2}-.0084662{col 39}{space 2} .9520543{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-1.874458{col 80}{space 3} 1.857526
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2}-.0058748{col 39}{space 2} .6589403{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-1.297374{col 80}{space 3} 1.285625
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2}-.0011625{col 39}{space 2} .1324367{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-.2607337{col 80}{space 3} .2584087
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2}-.0008667{col 39}{space 2} .0980645{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-.1930696{col 80}{space 3} .1913361
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2} .0005835{col 39}{space 2} .0659971{col 50}{space 1}    0.01{col 59}{space 3}0.993{col 67}{space 4}-.1287684{col 80}{space 3} .1299354
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2} -.017075{col 39}{space 2} .0009387{col 50}{space 1}  -18.19{col 59}{space 3}0.000{col 67}{space 4}-.0189148{col 80}{space 3}-.0152352
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2} .0055891{col 39}{space 2}  .631376{col 50}{space 1}    0.01{col 59}{space 3}0.993{col 67}{space 4}-1.231885{col 80}{space 3} 1.243063
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} .0067698{col 39}{space 2} .7645739{col 50}{space 1}    0.01{col 59}{space 3}0.993{col 67}{space 4}-1.491768{col 80}{space 3} 1.505307
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. margins, dydx(*) atmeans predict(outcome(3))
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==NILF), predict(outcome(3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat exp exp2 2.race_ethnicity 3.race_ethnicity 4.race_ethnicity 5.race_ethnicity 6.race_ethnicity 1.female 2.metroarea 3.metroarea 1.union 2.marital 3.marital}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.educat}{space 8}{txt:=} {space 3}.1261088 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.educat}{space 8}{txt:=} {space 4}.286954 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.educat}{space 8}{txt:=} {space 3}.1488497 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.educat}{space 8}{txt:=} {space 3}.0969254 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.educat}{space 8}{txt:=} {space 3}.2079617 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.educat}{space 8}{txt:=} {space 3}.1332003 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp}{space 13}{txt:=} {space 3}32.89247 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exp2}{space 12}{txt:=} {space 3}1467.595 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.race_eth~y}{space 4}{txt:=} {space 3}.0098079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.race_eth~y}{space 4}{txt:=} {space 3}.0622611 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.race_eth~y}{space 4}{txt:=} {space 3}.0931032 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:4.race_eth~y}{space 4}{txt:=} {space 3}.1487776 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:5.race_eth~y}{space 4}{txt:=} {space 3}.6685738 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:6.race_eth~y}{space 4}{txt:=} {space 3}.0174764 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.female}{space 8}{txt:=} {space 3}.4804923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.female}{space 8}{txt:=} {space 3}.5195077 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.metroarea}{space 5}{txt:=} {space 3}.8000673 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.metroarea}{space 5}{txt:=} {space 3}.1904132 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.metroarea}{space 5}{txt:=} {space 3}.0095195 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.union}{space 9}{txt:=} {space 3}.9508642 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.union}{space 9}{txt:=} {space 3}.0491358 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:1.marital}{space 7}{txt:=} {space 3}.5163586 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.marital}{space 7}{txt:=} {space 3}.1819515 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:3.marital}{space 7}{txt:=} {space 3}.3016899 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2}-.1760991{col 39}{space 2} 1.475242{col 50}{space 1}   -0.12{col 59}{space 3}0.905{col 67}{space 4} -3.06752{col 80}{space 3} 2.715321
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.1952498{col 39}{space 2} 1.746298{col 50}{space 1}   -0.11{col 59}{space 3}0.911{col 67}{space 4}-3.617932{col 80}{space 3} 3.227432
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.2377865{col 39}{space 2} 2.409215{col 50}{space 1}   -0.10{col 59}{space 3}0.921{col 67}{space 4}-4.959762{col 80}{space 3} 4.484189
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.2883071{col 39}{space 2} 3.317729{col 50}{space 1}   -0.09{col 59}{space 3}0.931{col 67}{space 4}-6.790936{col 80}{space 3} 6.214322
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-.3176566{col 39}{space 2} 3.916079{col 50}{space 1}   -0.08{col 59}{space 3}0.935{col 67}{space 4}-7.993031{col 80}{space 3} 7.357718
{txt}{space 25} {c |}
{space 22}exp {c |}{col 27}{res}{space 2}-.0257319{col 39}{space 2} .3987801{col 50}{space 1}   -0.06{col 59}{space 3}0.949{col 67}{space 4}-.8073266{col 80}{space 3} .7558628
{txt}{space 21}exp2 {c |}{col 27}{res}{space 2} .0005428{col 39}{space 2} .0084077{col 50}{space 1}    0.06{col 59}{space 3}0.949{col 67}{space 4}-.0159359{col 80}{space 3} .0170216
{txt}{space 25} {c |}
{space 11}race_ethnicity {c |}
{space 2}Asian/Pacific Islander  {c |}{col 27}{res}{space 2}-.0360241{col 39}{space 2} .5758254{col 50}{space 1}   -0.06{col 59}{space 3}0.950{col 67}{space 4}-1.164621{col 80}{space 3} 1.092573
{txt}{space 19}Black  {c |}{col 27}{res}{space 2}-.0193216{col 39}{space 2} .3135138{col 50}{space 1}   -0.06{col 59}{space 3}0.951{col 67}{space 4}-.6337973{col 80}{space 3} .5951541
{txt}{space 9}Hispanic/Latino  {c |}{col 27}{res}{space 2}  -.08432{col 39}{space 2} 1.269837{col 50}{space 1}   -0.07{col 59}{space 3}0.947{col 67}{space 4}-2.573155{col 80}{space 3} 2.404515
{txt}{space 19}White  {c |}{col 27}{res}{space 2}-.0608138{col 39}{space 2} .9093883{col 50}{space 1}   -0.07{col 59}{space 3}0.947{col 67}{space 4}-1.843182{col 80}{space 3} 1.721554
{txt}{space 13}Multiracial  {c |}{col 27}{res}{space 2}-.0333911{col 39}{space 2}   .49753{col 50}{space 1}   -0.07{col 59}{space 3}0.946{col 67}{space 4}-1.008532{col 80}{space 3} .9417497
{txt}{space 25} {c |}
{space 19}female {c |}
{space 18}Female  {c |}{col 27}{res}{space 2} .0993401{col 39}{space 2} 1.526768{col 50}{space 1}    0.07{col 59}{space 3}0.948{col 67}{space 4} -2.89307{col 80}{space 3} 3.091751
{txt}{space 25} {c |}
{space 16}metroarea {c |}
{space 11}Nonmetro Area  {c |}{col 27}{res}{space 2} -.001017{col 39}{space 2} .0285739{col 50}{space 1}   -0.04{col 59}{space 3}0.972{col 67}{space 4}-.0570207{col 80}{space 3} .0549868
{txt}{space 10}Not Identified  {c |}{col 27}{res}{space 2}-.0002091{col 39}{space 2} .0267367{col 50}{space 1}   -0.01{col 59}{space 3}0.994{col 67}{space 4} -.052612{col 80}{space 3} .0521939
{txt}{space 25} {c |}
{space 20}union {c |}
{space 19}Union  {c |}{col 27}{res}{space 2} -.431732{col 39}{space 2} .0031813{col 50}{space 1} -135.71{col 59}{space 3}0.000{col 67}{space 4}-.4379673{col 80}{space 3}-.4254967
{txt}{space 25} {c |}
{space 18}marital {c |}
{space 4}Divorced/Sep/Widowed  {c |}{col 27}{res}{space 2}-.0100452{col 39}{space 2} .2043758{col 50}{space 1}   -0.05{col 59}{space 3}0.961{col 67}{space 4}-.4106144{col 80}{space 3}  .390524
{txt}{space 11}Never Married  {c |}{col 27}{res}{space 2} .0242282{col 39}{space 2}  .419673{col 50}{space 1}    0.06{col 59}{space 3}0.954{col 67}{space 4}-.7983157{col 80}{space 3}  .846772
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. //_34
. quietly mlogit laborforce i.educat exp exp2 i.race_ethnicity i.female i.metroarea i.union i.marital, base(1)
{txt}
{com}. //_35
. margins, dydx(educat) predict(outcome(1))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Employed), predict(outcome(1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2} .1309012{col 39}{space 2} .0072675{col 50}{space 1}   18.01{col 59}{space 3}0.000{col 67}{space 4} .1166572{col 80}{space 3} .1451452
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2} .1499942{col 39}{space 2} .0080928{col 50}{space 1}   18.53{col 59}{space 3}0.000{col 67}{space 4} .1341326{col 80}{space 3} .1658558
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2} .1911979{col 39}{space 2} .0091537{col 50}{space 1}   20.89{col 59}{space 3}0.000{col 67}{space 4} .1732569{col 80}{space 3} .2091389
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2} .2407492{col 39}{space 2} .0078942{col 50}{space 1}   30.50{col 59}{space 3}0.000{col 67}{space 4} .2252768{col 80}{space 3} .2562215
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2} .2789487{col 39}{space 2}  .008527{col 50}{space 1}   32.71{col 59}{space 3}0.000{col 67}{space 4} .2622362{col 80}{space 3} .2956613
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. marginsplot, allsimplelabels horizontal recast(scatter) name(Employed) yscale(reverse) ytitle("Effect on Pr(Employed)") ///
> xtitle("Average Marginal Effects") xline(0) xlabel(-.3(.05).3)

{text}{p 2 6 2}Variables that uniquely identify margins: _deriv{p_end}
{res}{txt}
{com}. //_36
. margins, dydx(educat) predict(outcome(2))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Unemployed), predict(outcome(2))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2} .0021475{col 39}{space 2} .0023962{col 50}{space 1}    0.90{col 59}{space 3}0.370{col 67}{space 4} -.002549{col 80}{space 3}  .006844
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.0014486{col 39}{space 2} .0026367{col 50}{space 1}   -0.55{col 59}{space 3}0.583{col 67}{space 4}-.0066165{col 80}{space 3} .0037194
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.0048071{col 39}{space 2} .0030039{col 50}{space 1}   -1.60{col 59}{space 3}0.110{col 67}{space 4}-.0106946{col 80}{space 3} .0010805
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.0028255{col 39}{space 2} .0026516{col 50}{space 1}   -1.07{col 59}{space 3}0.287{col 67}{space 4}-.0080226{col 80}{space 3} .0023715
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-.0081376{col 39}{space 2} .0028311{col 50}{space 1}   -2.87{col 59}{space 3}0.004{col 67}{space 4}-.0136864{col 80}{space 3}-.0025888
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. marginsplot, allsimplelabels horizontal recast(scatter) name(Unemployed) yscale(reverse) ytitle("Effect on Pr(Unemployed)") ///
> xtitle("Average Marginal Effects") xline(0) xlabel(-.3(.05).3)

{text}{p 2 6 2}Variables that uniquely identify margins: _deriv{p_end}
{res}{txt}
{com}. //_37
. margins, dydx(educat) predict(outcome(3))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==NILF), predict(outcome(3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.educat 3.educat 4.educat 5.educat 6.educat}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   Std. Err.{col 51}      z{col 59}   P>|z|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}educat {c |}
{space 21}HSD  {c |}{col 27}{res}{space 2}-.1330487{col 39}{space 2} .0071954{col 50}{space 1}  -18.49{col 59}{space 3}0.000{col 67}{space 4}-.1471514{col 80}{space 3} -.118946
{txt}{space 12}Some College  {c |}{col 27}{res}{space 2}-.1485456{col 39}{space 2} .0079934{col 50}{space 1}  -18.58{col 59}{space 3}0.000{col 67}{space 4}-.1642124{col 80}{space 3}-.1328789
{txt}{space 11}AA/Vocational  {c |}{col 27}{res}{space 2}-.1863908{col 39}{space 2} .0090294{col 50}{space 1}  -20.64{col 59}{space 3}0.000{col 67}{space 4}-.2040881{col 80}{space 3}-.1686934
{txt}{space 19}BS/BA  {c |}{col 27}{res}{space 2}-.2379236{col 39}{space 2} .0077818{col 50}{space 1}  -30.57{col 59}{space 3}0.000{col 67}{space 4}-.2531757{col 80}{space 3}-.2226716
{txt}Graduate or Professional  {c |}{col 27}{res}{space 2}-.2708111{col 39}{space 2} .0083689{col 50}{space 1}  -32.36{col 59}{space 3}0.000{col 67}{space 4}-.2872139{col 80}{space 3}-.2544084
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. marginsplot, allsimplelabels horizontal recast(scatter) name(NILF) yscale(reverse) ytitle("Effect on Pr(NILF)") ///
> xtitle("Average Marginal Effects") xline(0) xlabel(-.3(.05).3)

{text}{p 2 6 2}Variables that uniquely identify margins: _deriv{p_end}
{res}{txt}
{com}. //_38
. graph combine Employed Unemployed NILF, ycommon title("AME of Education") ///
> note("Source: Current Population Survey; 2 is HSD, 3 is Some College, 4 is AA, 5 is BA/BS, and 6 is Graduate Degree")
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_mnlmeducation.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_mnlmeducation.png written in PNG format)

{com}. //_39
. graph drop Employed Unemployed NILF
{txt}
{com}. //_40
. margins, dydx(exp) at(exp=(0(2)60)) predict(outcome(1)) 
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==Employed), predict(outcome(1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:exp}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:12._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}22}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:13._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}24}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:14._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}26}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:15._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}28}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:16._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}30}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:17._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}32}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:18._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}34}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:19._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}36}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:20._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}38}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:21._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}40}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:22._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}42}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:23._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}44}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:24._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}46}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:25._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}48}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:26._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}50}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:27._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}52}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:28._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}54}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:29._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}56}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:30._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}58}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:31._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}exp          {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0119199{col 26}{space 2} .0001127{col 37}{space 1}  105.73{col 46}{space 3}0.000{col 54}{space 4} .0116989{col 67}{space 3} .0121408
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0130781{col 26}{space 2} .0001155{col 37}{space 1}  113.28{col 46}{space 3}0.000{col 54}{space 4} .0128519{col 67}{space 3} .0133044
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .013976{col 26}{space 2} .0001461{col 37}{space 1}   95.64{col 46}{space 3}0.000{col 54}{space 4} .0136896{col 67}{space 3} .0142625
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0145643{col 26}{space 2} .0001796{col 37}{space 1}   81.10{col 46}{space 3}0.000{col 54}{space 4} .0142123{col 67}{space 3} .0149163
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0148298{col 26}{space 2} .0002035{col 37}{space 1}   72.86{col 46}{space 3}0.000{col 54}{space 4} .0144308{col 67}{space 3} .0152287
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0147942{col 26}{space 2}  .000215{col 37}{space 1}   68.83{col 46}{space 3}0.000{col 54}{space 4} .0143729{col 67}{space 3} .0152155
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0145067{col 26}{space 2} .0002152{col 37}{space 1}   67.40{col 46}{space 3}0.000{col 54}{space 4} .0140849{col 67}{space 3} .0149285
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0140316{col 26}{space 2} .0002075{col 37}{space 1}   67.61{col 46}{space 3}0.000{col 54}{space 4} .0136249{col 67}{space 3} .0144384
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0134367{col 26}{space 2} .0001953{col 37}{space 1}   68.81{col 46}{space 3}0.000{col 54}{space 4}  .013054{col 67}{space 3} .0138195
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0127838{col 26}{space 2} .0001811{col 37}{space 1}   70.60{col 46}{space 3}0.000{col 54}{space 4} .0124289{col 67}{space 3} .0131387
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0121231{col 26}{space 2} .0001667{col 37}{space 1}   72.73{col 46}{space 3}0.000{col 54}{space 4} .0117965{col 67}{space 3} .0124498
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0114913{col 26}{space 2}  .000153{col 37}{space 1}   75.12{col 46}{space 3}0.000{col 54}{space 4} .0111915{col 67}{space 3} .0117912
{txt}{space 9}13  {c |}{col 14}{res}{space 2} .0109121{col 26}{space 2} .0001403{col 37}{space 1}   77.76{col 46}{space 3}0.000{col 54}{space 4} .0106371{col 67}{space 3} .0111872
{txt}{space 9}14  {c |}{col 14}{res}{space 2} .0103981{col 26}{space 2} .0001289{col 37}{space 1}   80.69{col 46}{space 3}0.000{col 54}{space 4} .0101455{col 67}{space 3} .0106507
{txt}{space 9}15  {c |}{col 14}{res}{space 2} .0099532{col 26}{space 2} .0001186{col 37}{space 1}   83.95{col 46}{space 3}0.000{col 54}{space 4} .0097208{col 67}{space 3} .0101855
{txt}{space 9}16  {c |}{col 14}{res}{space 2} .0095751{col 26}{space 2} .0001094{col 37}{space 1}   87.52{col 46}{space 3}0.000{col 54}{space 4} .0093606{col 67}{space 3} .0097895
{txt}{space 9}17  {c |}{col 14}{res}{space 2} .0092574{col 26}{space 2} .0001014{col 37}{space 1}   91.30{col 46}{space 3}0.000{col 54}{space 4} .0090586{col 67}{space 3} .0094561
{txt}{space 9}18  {c |}{col 14}{res}{space 2} .0089913{col 26}{space 2} .0000945{col 37}{space 1}   95.12{col 46}{space 3}0.000{col 54}{space 4}  .008806{col 67}{space 3} .0091766
{txt}{space 9}19  {c |}{col 14}{res}{space 2} .0087672{col 26}{space 2} .0000887{col 37}{space 1}   98.80{col 46}{space 3}0.000{col 54}{space 4} .0085933{col 67}{space 3} .0089411
{txt}{space 9}20  {c |}{col 14}{res}{space 2} .0085751{col 26}{space 2} .0000839{col 37}{space 1}  102.22{col 46}{space 3}0.000{col 54}{space 4} .0084107{col 67}{space 3} .0087395
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .0084059{col 26}{space 2} .0000798{col 37}{space 1}  105.34{col 46}{space 3}0.000{col 54}{space 4} .0082495{col 67}{space 3} .0085623
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .0082513{col 26}{space 2} .0000762{col 37}{space 1}  108.24{col 46}{space 3}0.000{col 54}{space 4} .0081019{col 67}{space 3} .0084007
{txt}{space 9}23  {c |}{col 14}{res}{space 2} .0081038{col 26}{space 2} .0000729{col 37}{space 1}  111.13{col 46}{space 3}0.000{col 54}{space 4} .0079609{col 67}{space 3} .0082468
{txt}{space 9}24  {c |}{col 14}{res}{space 2} .0079576{col 26}{space 2} .0000697{col 37}{space 1}  114.23{col 46}{space 3}0.000{col 54}{space 4}  .007821{col 67}{space 3} .0080941
{txt}{space 9}25  {c |}{col 14}{res}{space 2} .0078075{col 26}{space 2} .0000663{col 37}{space 1}  117.83{col 46}{space 3}0.000{col 54}{space 4} .0076776{col 67}{space 3} .0079373
{txt}{space 9}26  {c |}{col 14}{res}{space 2} .0076498{col 26}{space 2} .0000626{col 37}{space 1}  122.19{col 46}{space 3}0.000{col 54}{space 4} .0075271{col 67}{space 3} .0077725
{txt}{space 9}27  {c |}{col 14}{res}{space 2} .0074817{col 26}{space 2} .0000586{col 37}{space 1}  127.62{col 46}{space 3}0.000{col 54}{space 4} .0073668{col 67}{space 3} .0075967
{txt}{space 9}28  {c |}{col 14}{res}{space 2} .0073016{col 26}{space 2} .0000543{col 37}{space 1}  134.46{col 46}{space 3}0.000{col 54}{space 4} .0071952{col 67}{space 3} .0074081
{txt}{space 9}29  {c |}{col 14}{res}{space 2} .0071087{col 26}{space 2} .0000497{col 37}{space 1}  143.16{col 46}{space 3}0.000{col 54}{space 4} .0070113{col 67}{space 3}  .007206
{txt}{space 9}30  {c |}{col 14}{res}{space 2} .0069031{col 26}{space 2} .0000447{col 37}{space 1}  154.27{col 46}{space 3}0.000{col 54}{space 4} .0068154{col 67}{space 3} .0069908
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .0066862{col 26}{space 2} .0000397{col 37}{space 1}  168.35{col 46}{space 3}0.000{col 54}{space 4} .0066084{col 67}{space 3} .0067641
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, allsimplelabels name(Employed) ytitle("Effect on Pr(Employed)") xtitle("Average Marginal Effects")

{text}{p 2 6 2}Variables that uniquely identify margins: exp{p_end}
{res}{txt}
{com}. //_41
. margins, dydx(exp) at(exp=(0(2)60)) predict(outcome(3))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}    41,599
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(laborforcestatus==NILF), predict(outcome(3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:exp}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:12._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}22}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:13._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}24}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:14._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}26}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:15._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}28}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:16._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}30}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:17._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}32}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:18._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}34}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:19._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}36}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:20._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}38}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:21._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}40}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:22._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}42}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:23._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}44}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:24._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}46}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:25._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}48}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:26._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}50}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:27._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}52}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:28._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}54}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:29._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}56}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:30._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}58}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:31._at}:{space 1}{res:{txt:exp}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}exp          {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0125848{col 26}{space 2} .0001155{col 37}{space 1} -108.97{col 46}{space 3}0.000{col 54}{space 4}-.0128111{col 67}{space 3}-.0123584
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0137412{col 26}{space 2} .0001266{col 37}{space 1} -108.55{col 46}{space 3}0.000{col 54}{space 4}-.0139893{col 67}{space 3} -.013493
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0146118{col 26}{space 2}  .000159{col 37}{space 1}  -91.88{col 46}{space 3}0.000{col 54}{space 4}-.0149235{col 67}{space 3}-.0143001
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0151489{col 26}{space 2} .0001885{col 37}{space 1}  -80.35{col 46}{space 3}0.000{col 54}{space 4}-.0155185{col 67}{space 3}-.0147794
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0153436{col 26}{space 2} .0002048{col 37}{space 1}  -74.91{col 46}{space 3}0.000{col 54}{space 4} -.015745{col 67}{space 3}-.0149421
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0152237{col 26}{space 2} .0002061{col 37}{space 1}  -73.87{col 46}{space 3}0.000{col 54}{space 4}-.0156276{col 67}{space 3}-.0148198
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0148454{col 26}{space 2} .0001949{col 37}{space 1}  -76.17{col 46}{space 3}0.000{col 54}{space 4}-.0152274{col 67}{space 3}-.0144634
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0142796{col 26}{space 2} .0001756{col 37}{space 1}  -81.30{col 46}{space 3}0.000{col 54}{space 4}-.0146238{col 67}{space 3}-.0139353
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0135992{col 26}{space 2} .0001528{col 37}{space 1}  -89.00{col 46}{space 3}0.000{col 54}{space 4}-.0138986{col 67}{space 3}-.0132997
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0128695{col 26}{space 2} .0001299{col 37}{space 1}  -99.06{col 46}{space 3}0.000{col 54}{space 4}-.0131241{col 67}{space 3}-.0126148
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0121426{col 26}{space 2} .0001093{col 37}{space 1} -111.07{col 46}{space 3}0.000{col 54}{space 4}-.0123569{col 67}{space 3}-.0119284
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0114558{col 26}{space 2} .0000922{col 37}{space 1} -124.29{col 46}{space 3}0.000{col 54}{space 4}-.0116365{col 67}{space 3}-.0112752
{txt}{space 9}13  {c |}{col 14}{res}{space 2}-.0108322{col 26}{space 2} .0000787{col 37}{space 1} -137.62{col 46}{space 3}0.000{col 54}{space 4}-.0109865{col 67}{space 3}-.0106779
{txt}{space 9}14  {c |}{col 14}{res}{space 2}-.0102833{col 26}{space 2} .0000686{col 37}{space 1} -149.81{col 46}{space 3}0.000{col 54}{space 4}-.0104178{col 67}{space 3}-.0101487
{txt}{space 9}15  {c |}{col 14}{res}{space 2}-.0098117{col 26}{space 2} .0000614{col 37}{space 1} -159.70{col 46}{space 3}0.000{col 54}{space 4}-.0099321{col 67}{space 3}-.0096913
{txt}{space 9}16  {c |}{col 14}{res}{space 2}-.0094137{col 26}{space 2} .0000566{col 37}{space 1} -166.42{col 46}{space 3}0.000{col 54}{space 4}-.0095246{col 67}{space 3}-.0093028
{txt}{space 9}17  {c |}{col 14}{res}{space 2}-.0090816{col 26}{space 2} .0000536{col 37}{space 1} -169.49{col 46}{space 3}0.000{col 54}{space 4}-.0091866{col 67}{space 3}-.0089766
{txt}{space 9}18  {c |}{col 14}{res}{space 2}-.0088055{col 26}{space 2} .0000521{col 37}{space 1} -169.01{col 46}{space 3}0.000{col 54}{space 4}-.0089076{col 67}{space 3}-.0087033
{txt}{space 9}19  {c |}{col 14}{res}{space 2}-.0085745{col 26}{space 2} .0000517{col 37}{space 1} -165.70{col 46}{space 3}0.000{col 54}{space 4}-.0086759{col 67}{space 3}-.0084731
{txt}{space 9}20  {c |}{col 14}{res}{space 2} -.008378{col 26}{space 2} .0000521{col 37}{space 1} -160.73{col 46}{space 3}0.000{col 54}{space 4}-.0084802{col 67}{space 3}-.0082759
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0082063{col 26}{space 2} .0000528{col 37}{space 1} -155.31{col 46}{space 3}0.000{col 54}{space 4}-.0083098{col 67}{space 3}-.0081027
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-.0080503{col 26}{space 2} .0000535{col 37}{space 1} -150.38{col 46}{space 3}0.000{col 54}{space 4}-.0081552{col 67}{space 3}-.0079453
{txt}{space 9}23  {c |}{col 14}{res}{space 2}-.0079024{col 26}{space 2} .0000539{col 37}{space 1} -146.55{col 46}{space 3}0.000{col 54}{space 4}-.0080081{col 67}{space 3}-.0077967
{txt}{space 9}24  {c |}{col 14}{res}{space 2}-.0077563{col 26}{space 2} .0000538{col 37}{space 1} -144.13{col 46}{space 3}0.000{col 54}{space 4}-.0078617{col 67}{space 3}-.0076508
{txt}{space 9}25  {c |}{col 14}{res}{space 2}-.0076067{col 26}{space 2} .0000531{col 37}{space 1} -143.27{col 46}{space 3}0.000{col 54}{space 4}-.0077108{col 67}{space 3}-.0075027
{txt}{space 9}26  {c |}{col 14}{res}{space 2}-.0074499{col 26}{space 2} .0000517{col 37}{space 1} -144.07{col 46}{space 3}0.000{col 54}{space 4}-.0075512{col 67}{space 3}-.0073485
{txt}{space 9}27  {c |}{col 14}{res}{space 2}-.0072829{col 26}{space 2} .0000497{col 37}{space 1} -146.60{col 46}{space 3}0.000{col 54}{space 4}-.0073802{col 67}{space 3}-.0071855
{txt}{space 9}28  {c |}{col 14}{res}{space 2} -.007104{col 26}{space 2}  .000047{col 37}{space 1} -151.07{col 46}{space 3}0.000{col 54}{space 4}-.0071962{col 67}{space 3}-.0070118
{txt}{space 9}29  {c |}{col 14}{res}{space 2}-.0069124{col 26}{space 2} .0000438{col 37}{space 1} -157.78{col 46}{space 3}0.000{col 54}{space 4}-.0069983{col 67}{space 3}-.0068266
{txt}{space 9}30  {c |}{col 14}{res}{space 2}-.0067085{col 26}{space 2} .0000401{col 37}{space 1} -167.14{col 46}{space 3}0.000{col 54}{space 4}-.0067872{col 67}{space 3}-.0066298
{txt}{space 9}31  {c |}{col 14}{res}{space 2}-.0064935{col 26}{space 2} .0000362{col 37}{space 1} -179.60{col 46}{space 3}0.000{col 54}{space 4}-.0065643{col 67}{space 3}-.0064226
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_42
. marginsplot, allsimplelabels name(NILF) ytitle("Effect on Pr(NILF)") xtitle("Average Marginal Effects")

{text}{p 2 6 2}Variables that uniquely identify margins: exp{p_end}
{res}{txt}
{com}. graph combine Employed NILF, ycommon title("AME of Potential Experience") 
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_mnlmexp.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_mnlmexp.png written in PNG format)

{com}. //_43
. graph drop Employed NILF
{txt}
{com}. //_44
. est clear
{txt}
{com}. eststo mnlm: quietly mlogit laborforce i.educat exp exp2 i.race_ethnicity i.female i.metroarea i.union i.marital
{txt}
{com}. //_45
. eststo Employed: quietly margins, dydx(educat) predict(outcome(1)) post
{txt}
{com}. estimates restore mnlm
{txt}(results {stata estimates replay mnlm:mnlm} are active now)

{com}. eststo Unemployed: quietly margins, dydx(educat) predict(outcome(2)) post
{txt}
{com}. estimates restore mnlm
{txt}(results {stata estimates replay mnlm:mnlm} are active now)

{com}. eststo NILF: quietly margins, dydx(educat) predict(outcome(3)) post 
{txt}
{com}. //_46
. coefplot Employed Unemployed NILF, ///
> recast(bar) barw(0.15) vertical ///
> ciopts(recast(rcap) color(gs8)) citop ///
> xlab(1 "High School" 2 "Some College" 3 "Associates" 4 "Bachelor" 5 "Graduate") ///
> ytitle("Average Marginal Effect") ///
> xtitle("High Level of Education Attained") ///
> title("MNLM: Probability of Labor Force Status", size(*0.7))    ///
> subtitle("By Education Relative to High School Dropout")    ///
> caption("Source: Current Population Survey", size(*0.75)) ///
> name(coefplot3)
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_mnlmcoefplot.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_mnlmcoefplot.png written in PNG format)

{com}. //_47
. graph drop coefplot3
{txt}
{com}. //_48
. use mroz.dta, clear
{txt}
{com}. //_49
. sum hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}hours {c |}{res}        753    740.5764    871.3142          0       4950
{txt}
{com}. tab hours if hours == 0

      {txt}hours {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        325      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        325      100.00
{txt}
{com}. //_50
. tabstat hours, by(inlf) stat(mean median sd)

{txt}Summary for variables: hours
{col 6}by categories of: inlf 

{ralign 8:inlf} {...}
{c |}      mean       p50        sd
{hline 9}{c +}{hline 30}
{ralign 8:0} {...}
{c |}{...}
 {res}        0         0         0
{txt}{ralign 8:1} {...}
{c |}{...}
 {res}  1302.93    1365.5  776.2744
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} 740.5764       288  871.3142
{txt}{hline 9}{c BT}{hline 30}

{com}. //_51
. histogram hours
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}183.33333{txt})
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_hourhist.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_hourhist.png written in PNG format)

{com}. //_52
. sum hours if hours > 0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}hours {c |}{res}        428     1302.93    776.2744         12       4950
{txt}
{com}. //_53
. est clear
{txt}
{com}. eststo OLS: reg hours nwifeinc educ exper expersq age kidslt6 kidsge6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(7, 745)       = {res}    38.50
{txt}       Model {c |} {res}  151647606         7  21663943.7   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  419262118       745  562767.944   {txt}R-squared       ={res}    0.2656
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2587
{txt}       Total {c |} {res}  570909724       752  759188.463   {txt}Root MSE        =   {res} 750.18

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       hours{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-3.446636{col 26}{space 2}    2.544{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-8.440898{col 67}{space 3} 1.547626
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 28.76112{col 26}{space 2} 12.95459{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} 3.329283{col 67}{space 3} 54.19297
{txt}{space 7}exper {c |}{col 14}{res}{space 2} 65.67251{col 26}{space 2} 9.962983{col 37}{space 1}    6.59{col 46}{space 3}0.000{col 54}{space 4} 46.11365{col 67}{space 3} 85.23138
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.7004939{col 26}{space 2} .3245501{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-1.337635{col 67}{space 3}-.0633524
{txt}{space 9}age {c |}{col 14}{res}{space 2}-30.51163{col 26}{space 2} 4.363868{col 37}{space 1}   -6.99{col 46}{space 3}0.000{col 54}{space 4}-39.07858{col 67}{space 3}-21.94469
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-442.0899{col 26}{space 2}  58.8466{col 37}{space 1}   -7.51{col 46}{space 3}0.000{col 54}{space 4}-557.6148{col 67}{space 3} -326.565
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-32.77923{col 26}{space 2} 23.17622{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4} -78.2777{col 67}{space 3} 12.71924
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1330.482{col 26}{space 2} 270.7846{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} 798.8906{col 67}{space 3} 1862.074
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 740.5764{col 26}{space 2} 27.33803{col 37}{space 1}   27.09{col 46}{space 3}0.000{col 54}{space 4} 686.9076{col 67}{space 3} 794.2451
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_54
. eststo TOBIT: tobit hours nwifeinc educ exper expersq age kidslt6 kidsge6, ll(0)
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}       753
{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}    271.59
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-3819.0946{txt}{col 49}Pseudo R2{col 67}= {res}    0.0343

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       hours{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-8.814243{col 26}{space 2} 4.459096{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-17.56811{col 67}{space 3}-.0603724
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 80.64561{col 26}{space 2} 21.58322{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} 38.27453{col 67}{space 3} 123.0167
{txt}{space 7}exper {c |}{col 14}{res}{space 2} 131.5643{col 26}{space 2} 17.27938{col 37}{space 1}    7.61{col 46}{space 3}0.000{col 54}{space 4} 97.64231{col 67}{space 3} 165.4863
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.864158{col 26}{space 2} .5376615{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-2.919667{col 67}{space 3}-.8086479
{txt}{space 9}age {c |}{col 14}{res}{space 2}-54.40501{col 26}{space 2} 7.418496{col 37}{space 1}   -7.33{col 46}{space 3}0.000{col 54}{space 4}-68.96862{col 67}{space 3} -39.8414
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-894.0217{col 26}{space 2} 111.8779{col 37}{space 1}   -7.99{col 46}{space 3}0.000{col 54}{space 4}-1113.655{col 67}{space 3}-674.3887
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}  -16.218{col 26}{space 2} 38.64136{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-92.07675{col 67}{space 3} 59.64075
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 965.3053{col 26}{space 2} 446.4358{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} 88.88528{col 67}{space 3} 1841.725
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      /sigma {c |}{col 14}{res}{space 2} 1122.022{col 26}{space 2} 41.57903{col 54}{space 4} 1040.396{col 67}{space 3} 1203.647
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}           325{txt}  left-censored observations at hours <= {res}0
           428{txt}     uncensored observations
{res}             0{txt} right-censored observations

{com}. quietly sum exper
{txt}
{com}. local exp2=r(mean)^2
{txt}
{com}. //_55
. margins, dydx(*) predict(ystar(0,.)) at(expersq=`exp2')
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours*|hours>0), predict(ystar(0,.))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:expersq}{space 9}{txt:=} {space 3}113.0141}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-5.223903{col 26}{space 2} 2.639553{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-10.39733{col 67}{space 3}-.0504745
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 47.79592{col 26}{space 2}  12.7368{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} 22.83224{col 67}{space 3}  72.7596
{txt}{space 7}exper {c |}{col 14}{res}{space 2}  77.9737{col 26}{space 2} 9.900685{col 37}{space 1}    7.88{col 46}{space 3}0.000{col 54}{space 4} 58.56872{col 67}{space 3} 97.37869
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.104823{col 26}{space 2}  .316282{col 37}{space 1}   -3.49{col 46}{space 3}0.000{col 54}{space 4}-1.724724{col 67}{space 3}-.4849218
{txt}{space 9}age {c |}{col 14}{res}{space 2}-32.24401{col 26}{space 2} 4.348403{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4}-40.76672{col 67}{space 3}-23.72129
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-529.8564{col 26}{space 2} 65.40462{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-658.0471{col 67}{space 3}-401.6657
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-9.611857{col 26}{space 2} 22.90535{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-54.50553{col 67}{space 3} 35.28181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_56
. margins, dydx(*) predict(ystar(0,.)) at(expersq=`exp2')
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours*|hours>0), predict(ystar(0,.))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:expersq}{space 9}{txt:=} {space 3}113.0141}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-5.223903{col 26}{space 2} 2.639553{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-10.39733{col 67}{space 3}-.0504745
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 47.79592{col 26}{space 2}  12.7368{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} 22.83224{col 67}{space 3}  72.7596
{txt}{space 7}exper {c |}{col 14}{res}{space 2}  77.9737{col 26}{space 2} 9.900685{col 37}{space 1}    7.88{col 46}{space 3}0.000{col 54}{space 4} 58.56872{col 67}{space 3} 97.37869
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.104823{col 26}{space 2}  .316282{col 37}{space 1}   -3.49{col 46}{space 3}0.000{col 54}{space 4}-1.724724{col 67}{space 3}-.4849218
{txt}{space 9}age {c |}{col 14}{res}{space 2}-32.24401{col 26}{space 2} 4.348403{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4}-40.76672{col 67}{space 3}-23.72129
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-529.8564{col 26}{space 2} 65.40462{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-658.0471{col 67}{space 3}-401.6657
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-9.611857{col 26}{space 2} 22.90535{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-54.50553{col 67}{space 3} 35.28181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_57
. margins, dydx(*) predict(ystar(0,.)) at(expersq=`exp2') atmeans
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours*|hours>0), predict(ystar(0,.))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}113.0141}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-5.687381{col 26}{space 2} 2.877882{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-11.32793{col 67}{space 3}-.0468358
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 52.03649{col 26}{space 2} 13.82013{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 24.94954{col 67}{space 3} 79.12345
{txt}{space 7}exper {c |}{col 14}{res}{space 2} 84.89173{col 26}{space 2} 12.39757{col 37}{space 1}    6.85{col 46}{space 3}0.000{col 54}{space 4} 60.59293{col 67}{space 3} 109.1905
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.202846{col 26}{space 2} .3666136{col 37}{space 1}   -3.28{col 46}{space 3}0.001{col 54}{space 4}-1.921395{col 67}{space 3}-.4842964
{txt}{space 9}age {c |}{col 14}{res}{space 2}-35.10478{col 26}{space 2} 4.669466{col 37}{space 1}   -7.52{col 46}{space 3}0.000{col 54}{space 4}-44.25676{col 67}{space 3}-25.95279
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-576.8666{col 26}{space 2} 70.92986{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-715.8866{col 67}{space 3}-437.8466
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-10.46465{col 26}{space 2} 24.93972{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-59.34561{col 67}{space 3} 38.41632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_58
. esttab OLS TOBIT, mtitle
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS           TOBIT   
{txt}{hline 44}
{res}main                                        {txt}
{txt}nwifeinc    {res}       -3.447          -8.814*  {txt}
            {res} {ralign 12:{txt:(}-1.35{txt:)}}    {ralign 12:{txt:(}-1.98{txt:)}}   {txt}

{txt}educ        {res}        28.76*          80.65***{txt}
            {res} {ralign 12:{txt:(}2.22{txt:)}}    {ralign 12:{txt:(}3.74{txt:)}}   {txt}

{txt}exper       {res}        65.67***        131.6***{txt}
            {res} {ralign 12:{txt:(}6.59{txt:)}}    {ralign 12:{txt:(}7.61{txt:)}}   {txt}

{txt}expersq     {res}       -0.700*         -1.864***{txt}
            {res} {ralign 12:{txt:(}-2.16{txt:)}}    {ralign 12:{txt:(}-3.47{txt:)}}   {txt}

{txt}age         {res}       -30.51***       -54.41***{txt}
            {res} {ralign 12:{txt:(}-6.99{txt:)}}    {ralign 12:{txt:(}-7.33{txt:)}}   {txt}

{txt}kidslt6     {res}       -442.1***       -894.0***{txt}
            {res} {ralign 12:{txt:(}-7.51{txt:)}}    {ralign 12:{txt:(}-7.99{txt:)}}   {txt}

{txt}kidsge6     {res}       -32.78          -16.22   {txt}
            {res} {ralign 12:{txt:(}-1.41{txt:)}}    {ralign 12:{txt:(}-0.42{txt:)}}   {txt}

{txt}_cons       {res}       1330.5***        965.3*  {txt}
            {res} {ralign 12:{txt:(}4.91{txt:)}}    {ralign 12:{txt:(}2.16{txt:)}}   {txt}
{hline 44}
{res}sigma                                       {txt}
{txt}_cons       {res}                       1122.0***{txt}
            {res}                 {ralign 12:{txt:(}26.99{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          753             753   {txt}
{txt}{hline 44}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_59
. est clear
{txt}
{com}. //_60
. quietly reg hours nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo OLS: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 387.1927{col 26}{space 2} 161.5017{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4}    70.14{col 67}{space 3} 704.2453
{txt}{space 10}2  {c |}{col 14}{res}{space 2} 444.7149{col 26}{space 2} 136.0372{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} 177.6531{col 67}{space 3} 711.7767
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 502.2372{col 26}{space 2}  110.779{col 37}{space 1}    4.53{col 46}{space 3}0.000{col 54}{space 4}  284.761{col 67}{space 3} 719.7133
{txt}{space 10}4  {c |}{col 14}{res}{space 2} 559.7594{col 26}{space 2}  85.9094{col 37}{space 1}    6.52{col 46}{space 3}0.000{col 54}{space 4} 391.1061{col 67}{space 3} 728.4127
{txt}{space 10}5  {c |}{col 14}{res}{space 2} 617.2817{col 26}{space 2} 61.89861{col 37}{space 1}    9.97{col 46}{space 3}0.000{col 54}{space 4} 495.7652{col 67}{space 3} 738.7981
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 674.8039{col 26}{space 2} 40.31156{col 37}{space 1}   16.74{col 46}{space 3}0.000{col 54}{space 4} 595.6661{col 67}{space 3} 753.9417
{txt}{space 10}7  {c |}{col 14}{res}{space 2} 732.3262{col 26}{space 2} 27.58943{col 37}{space 1}   26.54{col 46}{space 3}0.000{col 54}{space 4} 678.1639{col 67}{space 3} 786.4884
{txt}{space 10}8  {c |}{col 14}{res}{space 2} 789.8484{col 26}{space 2} 35.21225{col 37}{space 1}   22.43{col 46}{space 3}0.000{col 54}{space 4} 720.7214{col 67}{space 3} 858.9754
{txt}{space 10}9  {c |}{col 14}{res}{space 2} 847.3707{col 26}{space 2}  55.3281{col 37}{space 1}   15.32{col 46}{space 3}0.000{col 54}{space 4} 738.7531{col 67}{space 3} 955.9882
{txt}{space 9}10  {c |}{col 14}{res}{space 2} 904.8929{col 26}{space 2} 78.89908{col 37}{space 1}   11.47{col 46}{space 3}0.000{col 54}{space 4} 750.0019{col 67}{space 3} 1059.784
{txt}{space 9}11  {c |}{col 14}{res}{space 2} 962.4152{col 26}{space 2}  103.593{col 37}{space 1}    9.29{col 46}{space 3}0.000{col 54}{space 4} 759.0463{col 67}{space 3} 1165.784
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_61
. quietly tobit hours nwifeinc educ exper expersq age kidslt6 kidsge6, ll(0)
{txt}
{com}. eststo Tobit: margins, at(educ=(0(2)20)) predict(e(0,6000)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours|0<hours<6000), predict(e(0,6000))}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 727.4644{col 26}{space 2} 76.74259{col 37}{space 1}    9.48{col 46}{space 3}0.000{col 54}{space 4} 577.0517{col 67}{space 3} 877.8772
{txt}{space 10}2  {c |}{col 14}{res}{space 2} 773.4964{col 26}{space 2} 71.05237{col 37}{space 1}   10.89{col 46}{space 3}0.000{col 54}{space 4} 634.2364{col 67}{space 3} 912.7565
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 823.5401{col 26}{space 2} 63.95927{col 37}{space 1}   12.88{col 46}{space 3}0.000{col 54}{space 4} 698.1822{col 67}{space 3} 948.8979
{txt}{space 10}4  {c |}{col 14}{res}{space 2} 877.8933{col 26}{space 2} 55.47809{col 37}{space 1}   15.82{col 46}{space 3}0.000{col 54}{space 4} 769.1582{col 67}{space 3} 986.6283
{txt}{space 10}5  {c |}{col 14}{res}{space 2} 936.8485{col 26}{space 2} 45.95104{col 37}{space 1}   20.39{col 46}{space 3}0.000{col 54}{space 4} 846.7861{col 67}{space 3} 1026.911
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 1000.685{col 26}{space 2} 36.67591{col 37}{space 1}   27.28{col 46}{space 3}0.000{col 54}{space 4} 928.8013{col 67}{space 3} 1072.568
{txt}{space 10}7  {c |}{col 14}{res}{space 2} 1069.659{col 26}{space 2} 31.51807{col 37}{space 1}   33.94{col 46}{space 3}0.000{col 54}{space 4} 1007.885{col 67}{space 3} 1131.433
{txt}{space 10}8  {c |}{col 14}{res}{space 2} 1143.997{col 26}{space 2} 36.60999{col 37}{space 1}   31.25{col 46}{space 3}0.000{col 54}{space 4} 1072.242{col 67}{space 3} 1215.751
{txt}{space 10}9  {c |}{col 14}{res}{space 2} 1223.883{col 26}{space 2} 52.37388{col 37}{space 1}   23.37{col 46}{space 3}0.000{col 54}{space 4} 1121.232{col 67}{space 3} 1326.534
{txt}{space 9}10  {c |}{col 14}{res}{space 2} 1309.452{col 26}{space 2} 75.03347{col 37}{space 1}   17.45{col 46}{space 3}0.000{col 54}{space 4}  1162.39{col 67}{space 3} 1456.515
{txt}{space 9}11  {c |}{col 14}{res}{space 2} 1400.783{col 26}{space 2} 102.4283{col 37}{space 1}   13.68{col 46}{space 3}0.000{col 54}{space 4} 1200.027{col 67}{space 3} 1601.539
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_62
. coefplot (OLS, ciopts(recast(rline) lpattern(solid))) ///
> (Tobit, ciopts(recast(rline) lpattern(dash))), at recast(line)
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_tobitols.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_tobitols.png written in PNG format)

{com}. //_63
. cd "/Users/Sam/Desktop/Econ 645/Data/Mitchell"
{res}/Users/Sam/Desktop/Econ 645/Data/Mitchell
{txt}
{com}. //_64
. use wws2, clear
{txt}(Working Women Survey w/fixes)

{com}. tabulate married, summarize(wage)

            {txt}{c |}       Summary of hourly wage
    married {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          0 {c |}  {res} 8.0920006    6.354849         804
  {txt}        1 {c |}  {res} 7.6319496   5.5017864       1,440
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 7.7967807   5.8245895       2,244
{txt}
{com}. //_65
. bysort married: summarize wage

{txt}{hline}
-> married = 0

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}        804    8.092001    6.354849          0   40.19808

{txt}{hline}
-> married = 1

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}      1,440     7.63195    5.501786   1.004952   40.74659

{txt}
{com}. //_66
. correlate wage age if married == 0
{txt}(obs=804)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.0185   1.0000

{txt}
{com}. correlate wage age if married == 1
{txt}(obs=1,440)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}   0.0049   1.0000

{txt}
{com}. //_67
. bysort married: correlate wage age

{txt}{hline}
-> married = 0
(obs=804)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.0185   1.0000


{txt}{hline}
-> married = 1
(obs=1,440)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}   0.0049   1.0000


{txt}
{com}. //_68
. bysort race: correlate wage age

{txt}{hline}
-> race = 1
(obs=1,637)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}   0.0017   1.0000


{txt}{hline}
-> race = 2
(obs=581)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.0331   1.0000


{txt}{hline}
-> race = 3
(obs=26)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.2194   1.0000


{txt}
{com}. //_69
. use tv1, clear
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c BRC}

{com}. //_70
. bysort kidid: egen avgtv = mean(tv)
{txt}
{com}. sort kidid
{txt}
{com}. list kidid tv avgtv, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 7}{c TRC}
     {c |} {res}kidid   tv   avgtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  1. {c |} {res}    1    1       2 {txt}{c |}
  2. {c |} {res}    1    3       2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  3. {c |} {res}    2    8       8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  4. {c |} {res}    3    2     3.5 {txt}{c |}
  5. {c |} {res}    3    5     3.5 {txt}{c |}
  6. {c |} {res}    3    1     3.5 {txt}{c |}
  7. {c |} {res}    3    6     3.5 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  8. {c |} {res}    4    7       4 {txt}{c |}
  9. {c |} {res}    4    1       4 {txt}{c |}
 10. {c |} {res}    4    4       4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 7}{c BRC}

{com}. //_71
. bysort kidid: egen sdtv = sd(tv)
{txt}(1 missing value generated)

{com}. //_72
. generate ztv = (tv-avgtv)/sdtv
{txt}(1 missing value generated)

{com}. //_73
. list 
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   avgtv        sdtv          ztv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       2   1.4142136   -.70710678 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       2   1.4142136    .70710678 {txt}{c |}
  3. {c |} {res}    2   16jan2002        1   58    8     1       8           .            . {txt}{c |}
  4. {c |} {res}    3   18jan2002        0   60    2     0     3.5   2.3804761   -.63012604 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1     3.5   2.3804761    .63012604 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c RT}
  6. {c |} {res}    3   21jan2002        0   66    1     1     3.5   2.3804761   -1.0502101 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0     3.5   2.3804761    1.0502101 {txt}{c |}
  8. {c |} {res}    4   10jan2002        1   62    7     0       4           3            1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       4           3           -1 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       4           3            0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c BRC}

{com}. //_74
. bysort kidid: egen vac_total = total(vac)
{txt}
{com}. bysort kidid: egen vac_sd = sd(vac)
{txt}(1 missing value generated)

{com}. bysort kidid: egen vac_min = min(vac)
{txt}
{com}. bysort kidid: egen vac_max = max(vac)
{txt}
{com}. list kidid vac*, sepby(kidid) abb(10)
{txt}
     {c TLC}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c TRC}
     {c |} {res}kidid   vac   vac_total      vac_sd   vac_min   vac_max {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  1. {c |} {res}    1     1           2           0         1         1 {txt}{c |}
  2. {c |} {res}    1     1           2           0         1         1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  3. {c |} {res}    2     1           1           .         1         1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  4. {c |} {res}    3     0           2   .57735027         0         1 {txt}{c |}
  5. {c |} {res}    3     1           2   .57735027         0         1 {txt}{c |}
  6. {c |} {res}    3     1           2   .57735027         0         1 {txt}{c |}
  7. {c |} {res}    3     0           2   .57735027         0         1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  8. {c |} {res}    4     0           0           0         0         0 {txt}{c |}
  9. {c |} {res}    4     0           0           0         0         0 {txt}{c |}
 10. {c |} {res}    4     0           0           0         0         0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c BRC}

{com}. //_75
. generate tvlo = (tv < 4) if !missing(tv)
{txt}
{com}. //_76
. bysort kidid: egen tvlocnt = count(tvlo)
{txt}
{com}. bysort kidid: egen tvlototal = total(tvlo)
{txt}
{com}. bysort kidid: egen tvlosum = sum(tvlo)
{txt}
{com}. bysort kidid: gen tvlosum2 = sum(tvlo)
{txt}
{com}. bysort kidid: egen tvlosame = sd(tvlo)
{txt}(1 missing value generated)

{com}. bysort kidid: egen tvloall = min(tvlo)
{txt}
{com}. bysort kidid: egen tvloever = max(tvlo)
{txt}
{com}. list kidid tv tvlo*, sepby(kidid) abb(20)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tvlo   tvlocnt   tvlototal   tvlosum   tvlosum2    tvlosame   tvloall   tvloever {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1      1         2           2         2          1           0         1          1 {txt}{c |}
  2. {c |} {res}    1    3      1         2           2         2          2           0         1          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8      0         1           0         0          0           .         0          0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2      1         4           2         2          1   .57735027         0          1 {txt}{c |}
  5. {c |} {res}    3    5      0         4           2         2          1   .57735027         0          1 {txt}{c |}
  6. {c |} {res}    3    1      1         4           2         2          2   .57735027         0          1 {txt}{c |}
  7. {c |} {res}    3    6      0         4           2         2          2   .57735027         0          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7      0         3           1         1          0   .57735027         0          1 {txt}{c |}
  9. {c |} {res}    4    1      1         3           1         1          1   .57735027         0          1 {txt}{c |}
 10. {c |} {res}    4    4      0         3           1         1          1   .57735027         0          1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c BRC}

{com}. //_77
. help egen
{txt}
{com}. //_78
. use tv1, clear
{txt}
{com}. //_79
. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c BRC}

{com}. //_80
. display tv[1]
{res}1
{txt}
{com}. //_81
. display "kid: " kidid[1] ", Date: " dt[1] ", Sex: " female[1] ", TV Hours: " tv[1]
{res}kid: 1, Date: 15347, Sex: 1, TV Hours: 1
{txt}
{com}. //_82
. display tv[2]
{res}3
{txt}
{com}. //_83
. display tv[2]-tv[1]
{res}2
{txt}
{com}. //_84
. help system variables
{txt}
{com}. //_85
. use tv1, clear
{txt}
{com}. //_86
. bysort kidid: gen tv_1ob = tv[1]
{txt}
{com}. list kidid tv tv_1ob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}kidid   tv   tv_1ob {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res}    1    1        1 {txt}{c |}
  2. {c |} {res}    1    3        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  3. {c |} {res}    2    8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  4. {c |} {res}    3    2        2 {txt}{c |}
  5. {c |} {res}    3    5        2 {txt}{c |}
  6. {c |} {res}    3    1        2 {txt}{c |}
  7. {c |} {res}    3    6        2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  8. {c |} {res}    4    7        7 {txt}{c |}
  9. {c |} {res}    4    1        7 {txt}{c |}
 10. {c |} {res}    4    4        7 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_87
. bysort kidid: gen tv_lastob = tv[_N]
{txt}
{com}. list kidid tv tv_lastob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_las~b {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          3 {txt}{c |}
  2. {c |} {res}    1    3          3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          6 {txt}{c |}
  5. {c |} {res}    3    5          6 {txt}{c |}
  6. {c |} {res}    3    1          6 {txt}{c |}
  7. {c |} {res}    3    6          6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          4 {txt}{c |}
  9. {c |} {res}    4    1          4 {txt}{c |}
 10. {c |} {res}    4    4          4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_88
. bysort kidid: gen tv_2tolastob = tv[_N-1]
{txt}(1 missing value generated)

{com}. list kidid tv tv_2tolastob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_2to~b {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          1 {txt}{c |}
  2. {c |} {res}    1    3          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          1 {txt}{c |}
  5. {c |} {res}    3    5          1 {txt}{c |}
  6. {c |} {res}    3    1          1 {txt}{c |}
  7. {c |} {res}    3    6          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          1 {txt}{c |}
  9. {c |} {res}    4    1          1 {txt}{c |}
 10. {c |} {res}    4    4          1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_89
. bysort kidid: gen tv_lagob = tv[_n-1]
{txt}(4 missing values generated)

{com}. list kidid tv tv_lagob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_lagob {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          . {txt}{c |}
  2. {c |} {res}    1    3          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          . {txt}{c |}
  5. {c |} {res}    3    5          2 {txt}{c |}
  6. {c |} {res}    3    1          5 {txt}{c |}
  7. {c |} {res}    3    6          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          . {txt}{c |}
  9. {c |} {res}    4    1          7 {txt}{c |}
 10. {c |} {res}    4    4          1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_90
. bysort kidid: gen tv_leadob = tv[_n+1]
{txt}(4 missing values generated)

{com}. list kidid tv tv_leadob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_lea~b {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          3 {txt}{c |}
  2. {c |} {res}    1    3          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          5 {txt}{c |}
  5. {c |} {res}    3    5          1 {txt}{c |}
  6. {c |} {res}    3    1          6 {txt}{c |}
  7. {c |} {res}    3    6          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          1 {txt}{c |}
  9. {c |} {res}    4    1          4 {txt}{c |}
 10. {c |} {res}    4    4          . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_91
. use tv1, clear
{txt}
{com}. //_92
. bysort kidid (dt): gen tv_1ob1 = tv[1]
{txt}
{com}. bysort kidid dt: gen tv_1ob2 = tv[1]
{txt}
{com}. //_93
. list kidid tv tv_1ob*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c TRC}
     {c |} {res}kidid   tv   tv_1ob1   tv_1ob2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  1. {c |} {res}    1    1         1         1 {txt}{c |}
  2. {c |} {res}    1    3         1         3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  3. {c |} {res}    2    8         8         8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  4. {c |} {res}    3    2         2         2 {txt}{c |}
  5. {c |} {res}    3    5         2         5 {txt}{c |}
  6. {c |} {res}    3    1         2         1 {txt}{c |}
  7. {c |} {res}    3    6         2         6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  8. {c |} {res}    4    7         7         7 {txt}{c |}
  9. {c |} {res}    4    1         7         1 {txt}{c |}
 10. {c |} {res}    4    4         7         4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c BRC}

{com}. //_94
. bysort kidid (dt): gen tv_lastob1 = tv[_N]
{txt}
{com}. bysort kidid dt: gen tv_lastob2 = tv[_N]
{txt}
{com}. //_95
. list kidid tv tv_lastob*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_las~1   tv_las~2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          3          1 {txt}{c |}
  2. {c |} {res}    1    3          3          3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          8          8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          6          2 {txt}{c |}
  5. {c |} {res}    3    5          6          5 {txt}{c |}
  6. {c |} {res}    3    1          6          1 {txt}{c |}
  7. {c |} {res}    3    6          6          6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          4          7 {txt}{c |}
  9. {c |} {res}    4    1          4          1 {txt}{c |}
 10. {c |} {res}    4    4          4          4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_96
. bysort kidid (dt): gen tv_lagob1 = tv[_n-1]
{txt}(4 missing values generated)

{com}. bysort kidid dt: gen tv_lagob2 = tv[_n-1]
{txt}(10 missing values generated)

{com}. //_97
. list kidid tv tv_lagob*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_lag~1   tv_lag~2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          .          . {txt}{c |}
  2. {c |} {res}    1    3          1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          .          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          .          . {txt}{c |}
  5. {c |} {res}    3    5          2          . {txt}{c |}
  6. {c |} {res}    3    1          5          . {txt}{c |}
  7. {c |} {res}    3    6          1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          .          . {txt}{c |}
  9. {c |} {res}    4    1          7          . {txt}{c |}
 10. {c |} {res}    4    4          1          . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_98
. use tv1, clear
{txt}
{com}. //_99
. bysort kidid (dt): generate tvdfp = tv - tv[_n-1]
{txt}(4 missing values generated)

{com}. //_100
. bysort kidid (dt): generate tvdfs = tv - tv[_n+1]
{txt}(4 missing values generated)

{com}. //_101
. bysort kidid (dt): generate tvdff = tv - tv[1]
{txt}
{com}. //_102
. bysort kidid (dt): generate tvdfl = tv - tv[_N]
{txt}
{com}. //_103
. bysort kidid (dt): generate tv3avg = (tv[_n-1] + tv[_n] + tv[_n+1])/3
{txt}(7 missing values generated)

{com}. //_104
. list kidid dt tvd* tv3avg
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c TRC}
     {c |} {res}kidid          dt   tvdfp   tvdfs   tvdff   tvdfl      tv3avg {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c RT}
  1. {c |} {res}    1   07jan2002       .      -2       0      -2           . {txt}{c |}
  2. {c |} {res}    1   08jan2002       2       .       2       0           . {txt}{c |}
  3. {c |} {res}    2   16jan2002       .       .       0       0           . {txt}{c |}
  4. {c |} {res}    3   18jan2002       .      -3       0      -4           . {txt}{c |}
  5. {c |} {res}    3   19jan2002       3       4       3      -1   2.6666667 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c RT}
  6. {c |} {res}    3   21jan2002      -4      -5      -1      -5           4 {txt}{c |}
  7. {c |} {res}    3   22jan2002       5       .       4       0           . {txt}{c |}
  8. {c |} {res}    4   10jan2002       .       6       0       3           . {txt}{c |}
  9. {c |} {res}    4   11jan2002      -6      -3      -6      -3           4 {txt}{c |}
 10. {c |} {res}    4   13jan2002       3       .      -3       0           . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c BRC}

{com}. //_105
. import excel using "cpi_1993_2023.xlsx", cellrange(A12:P42) firstrow clear
{res}{txt}
{com}. keep Year Annual
{txt}
{com}. //_106
. gen rebase93 = Annual/Annual[1]*100
{txt}
{com}. //_107
. gen rebase22 = Annual/Annual[_N]*100
{txt}
{com}. //_108
. gen rebase12 = Annual/Annual[_N-10]*100
{txt}
{com}. list
{txt}
     {c TLC}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}Year    Annual    rebase93    rebase22    rebase12 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res}1993     144.5         100   49.375545   62.937185 {txt}{c |}
  2. {c |} {res}1994     148.2   102.56055   50.639832   64.548725 {txt}{c |}
  3. {c |} {res}1995     152.4   105.46713   52.074969   66.378041 {txt}{c |}
  4. {c |} {res}1996     156.9   108.58131   53.612616   68.338023 {txt}{c |}
  5. {c |} {res}1997     160.5   111.07266   54.842733   69.906008 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}1998       163   112.80277   55.696981   70.994887 {txt}{c |}
  7. {c |} {res}1999     166.6   115.29412   56.927098   72.562872 {txt}{c |}
  8. {c |} {res}2000     172.2   119.16955   58.840614    75.00196 {txt}{c |}
  9. {c |} {res}2001     177.1   122.56055   60.514941   77.136162 {txt}{c |}
 10. {c |} {res}2002     179.9   124.49827   61.471699   78.355706 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 11. {c |} {res}2003       184   127.33564   62.872666   80.141467 {txt}{c |}
 12. {c |} {res}2004     188.9   130.72664   64.546992   82.275669 {txt}{c |}
 13. {c |} {res}2005     195.3   135.15571   66.733868   85.063199 {txt}{c |}
 14. {c |} {res}2006     201.6   139.51557   68.886573   87.807173 {txt}{c |}
 15. {c |} {res}2007   207.342   143.48927    70.84861   90.308109 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 16. {c |} {res}2008   215.303   148.99862   73.568878   93.775534 {txt}{c |}
 17. {c |} {res}2009   214.537   148.46851   73.307136   93.441902 {txt}{c |}
 18. {c |} {res}2010   218.056   150.90381   74.509576   94.974607 {txt}{c |}
 19. {c |} {res}2011   224.939   155.66713   76.861492   97.972508 {txt}{c |}
 20. {c |} {res}2012   229.594   158.88858   78.452102         100 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 21. {c |} {res}2013   232.957   161.21592   79.601237   101.46476 {txt}{c |}
 22. {c |} {res}2014   236.736   163.83114   80.892518   103.11071 {txt}{c |}
 23. {c |} {res}2015   237.017   164.02561   80.988536    103.2331 {txt}{c |}
 24. {c |} {res}2016   240.007   166.09481   82.010217    104.5354 {txt}{c |}
 25. {c |} {res}2017    245.12   169.63322   83.757325   106.76237 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 26. {c |} {res}2018   251.107   173.77647   85.803079   109.37002 {txt}{c |}
 27. {c |} {res}2019   255.657   176.92526    87.35781   111.35178 {txt}{c |}
 28. {c |} {res}2020   258.811   179.10796    88.43553   112.72551 {txt}{c |}
 29. {c |} {res}2021    270.97   187.52249   92.590251   118.02138 {txt}{c |}
 30. {c |} {res}2022   292.655   202.52941         100   127.46631 {txt}{c |}
     {c BLC}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_109
. graph twoway line Annual Year || line rebase93 Year || ///
> line rebase22 Year, yline(100) ///
> legend(order(1 "100=1982" 2 "100=1993" 3 "100=2022"))
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_bls.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_bls.png written in PNG format)

{com}. //_110
. use tv1, clear
{txt}
{com}. //_111
. generate tvrunsum = sum(tv)
{txt}
{com}. //_112
. bysort kidid (dt): generate bytvrunsum=sum(tv)
{txt}
{com}. //_113
. bysort kidid (dt): egen bytvsum=total(tv)
{txt}
{com}. //_114
. egen tvsum = total(tv)
{txt}
{com}. //_115
. bysort kidid (dt): generate bytvrunavg=sum(tv)/_n
{txt}
{com}. //_116
. bysort kidid (dt): egen bytvavg = mean(tv)
{txt}
{com}. //_117
. list kidid tv tv* by*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c TRC}
     {c |} {res}kidid   tv   tv   tvrunsum   tvsum   bytvru~m   bytvsum   bytvrun~g   bytvavg {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  1. {c |} {res}    1    1    1          1      38          1         4           1         2 {txt}{c |}
  2. {c |} {res}    1    3    3          4      38          4         4           2         2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  3. {c |} {res}    2    8    8         12      38          8         8           8         8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  4. {c |} {res}    3    2    2         14      38          2        14           2       3.5 {txt}{c |}
  5. {c |} {res}    3    5    5         19      38          7        14         3.5       3.5 {txt}{c |}
  6. {c |} {res}    3    1    1         20      38          8        14   2.6666667       3.5 {txt}{c |}
  7. {c |} {res}    3    6    6         26      38         14        14         3.5       3.5 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  8. {c |} {res}    4    7    7         33      38          7        12           7         4 {txt}{c |}
  9. {c |} {res}    4    1    1         34      38          8        12           4         4 {txt}{c |}
 10. {c |} {res}    4    4    4         38      38         12        12           4         4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c BRC}

{com}. //_118
. use tv1, clear
{txt}
{com}. //_119
. bysort kidid (dt): generate idcount=_N
{txt}
{com}. //_120
. bysort kidid (dt): egen idcount_nomiss = count(tv)
{txt}
{com}. //_121
. bysort kidid (dt): gen idruncount = _n
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   idcount   idcoun~s   idrunc~t {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1         2          2          1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1         2          2          2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1         1          1          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0         4          4          1 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1         4          4          2 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1         4          4          3 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0         4          4          4 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0         3          3          1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0         3          3          2 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0         3          3          3 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_122
. use tv1, clear
{txt}
{com}. //_123
. bysort kidid (dt): generate singleob = (_N==1)
{txt}
{com}. //_124
. bysort kidid (dt): generate firstob = (_n==1)
{txt}
{com}. //_125
. bysort kidid (dt): generate lastob = (_n==_N)
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   singleob   firstob   lastob {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1          0         1        0 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1          0         0        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1          1         1        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0          0         1        0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1          0         0        0 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1          0         0        0 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0          0         0        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0          0         1        0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0          0         0        0 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0          0         0        1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c BRC}

{com}. //_126
. use tv1, clear
{txt}
{com}. //_127
. bysort kidid (dt): generate vacstart=(vac==1) & (vac[_n-1]==0)
{txt}
{com}. bysort kidid (dt): generate vacend=(vac==1) & (vac[_n+1]==0)
{txt}
{com}. list kidid dt vac*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   vac   vacstart   vacend {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002     1          0        0 {txt}{c |}
  2. {c |} {res}    1   08jan2002     1          0        0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002     1          0        0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002     0          0        0 {txt}{c |}
  5. {c |} {res}    3   19jan2002     1          1        0 {txt}{c |}
  6. {c |} {res}    3   21jan2002     1          0        1 {txt}{c |}
  7. {c |} {res}    3   22jan2002     0          0        0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002     0          0        0 {txt}{c |}
  9. {c |} {res}    4   11jan2002     0          0        0 {txt}{c |}
 10. {c |} {res}    4   13jan2002     0          0        0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c BRC}

{com}. //_128
. use tv2, clear
{txt}
{com}. sort kidid dt
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0    .    .     . {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    .     1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    .     . {txt}{c |}
 10. {c |} {res}    4   13jan2002        1    .    4     0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c BRC}

{com}. //_129
. generate tvimp1 = tv
{txt}(3 missing values generated)

{com}. bysort kidid (dt): replace tvimp1 = tv[_n-1] if missing(tv)
{txt}(2 real changes made)

{com}. //_130
. list kidid dt tv tvimp1, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   tv   tvimp1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002    1        1 {txt}{c |}
  2. {c |} {res}    1   08jan2002    3        3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002    8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002    2        2 {txt}{c |}
  5. {c |} {res}    3   19jan2002    .        2 {txt}{c |}
  6. {c |} {res}    3   21jan2002    .        . {txt}{c |}
  7. {c |} {res}    3   22jan2002    6        6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002    7        7 {txt}{c |}
  9. {c |} {res}    4   11jan2002    .        7 {txt}{c |}
 10. {c |} {res}    4   13jan2002    4        4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_131
. generate tvimp2 = tvimp1
{txt}(1 missing value generated)

{com}. bysort kidid (dt): replace tvimp2 = tvimp2[_n-1] if missing(tvimp2)
{txt}(1 real change made)

{com}. list kidid tv tvimp*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}kidid   tv   tvimp1   tvimp2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  1. {c |} {res}    1    1        1        1 {txt}{c |}
  2. {c |} {res}    1    3        3        3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  3. {c |} {res}    2    8        8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  4. {c |} {res}    3    2        2        2 {txt}{c |}
  5. {c |} {res}    3    .        2        2 {txt}{c |}
  6. {c |} {res}    3    .        .        2 {txt}{c |}
  7. {c |} {res}    3    6        6        6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  8. {c |} {res}    4    7        7        7 {txt}{c |}
  9. {c |} {res}    4    .        7        7 {txt}{c |}
 10. {c |} {res}    4    4        4        4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c BRC}

{com}. //_132
. generate tvimp3=tv
{txt}(3 missing values generated)

{com}. //_133
. bysort kidid (dt): replace tvimp3 = (tv[_n-1]+tv[_n+1])/2 if missing(tv)
{txt}(1 real change made)

{com}. list kidid tv tvimp3, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}kidid   tv   tvimp3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res}    1    1        1 {txt}{c |}
  2. {c |} {res}    1    3        3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  3. {c |} {res}    2    8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  4. {c |} {res}    3    2        2 {txt}{c |}
  5. {c |} {res}    3    .        . {txt}{c |}
  6. {c |} {res}    3    .        . {txt}{c |}
  7. {c |} {res}    3    6        6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  8. {c |} {res}    4    7        7 {txt}{c |}
  9. {c |} {res}    4    .      5.5 {txt}{c |}
 10. {c |} {res}    4    4        4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_134
. bysort kidid (dt): replace tvimp3 = ((tvimp3[4]-tvimp3[1])/3)+tvimp3[_n-1] if missing(tvimp3) & kidid==3
{txt}(2 real changes made)

{com}. list kidid tv tvimp3, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 11}{c TRC}
     {c |} {res}kidid   tv      tvimp3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  1. {c |} {res}    1    1           1 {txt}{c |}
  2. {c |} {res}    1    3           3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  3. {c |} {res}    2    8           8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  4. {c |} {res}    3    2           2 {txt}{c |}
  5. {c |} {res}    3    .   3.3333333 {txt}{c |}
  6. {c |} {res}    3    .   4.6666667 {txt}{c |}
  7. {c |} {res}    3    6           6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  8. {c |} {res}    4    7           7 {txt}{c |}
  9. {c |} {res}    4    .         5.5 {txt}{c |}
 10. {c |} {res}    4    4           4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 11}{c BRC}

{com}. //_135
. use tv1, clear
{txt}
{com}. bysort kidid (dt): generate tvchange = tv[_n]-tv[_n-1]
{txt}(4 missing values generated)

{com}. bysort kidid (dt): generate tvchangerate = ((tv[_n]-tv[_n-1])/tv[_n-1])
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   tvchange   tvchange~e {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1          .            . {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1          2            2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1          .            . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0          .            . {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1          3          1.5 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1         -4          -.8 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0          5            5 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0          .            . {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0         -6   -.85714286 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0          3            3 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c BRC}

{com}. //_136
. gen tvchangeid=(tvchange <= -2) if !missing(tvchange)
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   tvchange   tvchange~e   tvchan~d {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1          .            .          . {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1          2            2          0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1          .            .          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0          .            .          . {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1          3          1.5          0 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1         -4          -.8          1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0          5            5          0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0          .            .          . {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0         -6   -.85714286          1 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0          3            3          0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c BRC}

{com}. //_137
. use tv1, clear
{txt}
{com}. bysort kidid (dt): generate ltv = tv[_n-1]
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   ltv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1     . {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1     . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0     . {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1     2 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1     5 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0     . {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0     7 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0     1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c BRC}

{com}. //_138
. use tv1, clear
{txt}
{com}. sort kidid dt
{txt}
{com}. //_139
. tsset kidid dt, daily delta(1)
{res}{txt}{col 8}panel variable:  {res}kidid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dt, 07jan2002 to 22jan2002, but with gaps
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. //_140
. generate lagtv = L.tv
{txt}(6 missing values generated)

{com}. //_141
. generate leadtv = F.tv
{txt}(6 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   lagtv   leadtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       .        3 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1       .        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0       .        5 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1       2        . {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1       .        6 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0       .        1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       7        . {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       .        . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c BRC}

{com}. //_142
. use tv1, clear
{txt}
{com}. sort kidid dt
{txt}
{com}. //_143
. xtset kidid dt, daily delta(1)
{res}{txt}{col 8}panel variable:  {res}kidid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dt, 07jan2002 to 22jan2002, but with gaps
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. //_144
. generate lagtv = l.tv
{txt}(6 missing values generated)

{com}. //_145
. generate leadtv = f.tv
{txt}(6 missing values generated)

{com}. //_146
. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   lagtv   leadtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       .        3 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1       .        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0       .        5 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1       2        . {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1       .        6 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0       .        1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       7        . {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       .        . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c BRC}

{com}. //_147
. bysort kidid (dt): gen bylagtv=tv[_n-1]
{txt}(4 missing values generated)

{com}. bysort kidid (dt): gen byleadtv=tv[_n+1]
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   lagtv   leadtv   bylagtv   byleadtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       .        3         .          3 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       1        .         1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1       .        .         .          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0       .        5         .          5 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1       2        .         2          1 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1       .        6         5          6 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0       1        .         1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0       .        1         .          1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       7        .         7          4 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       .        .         1          . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c BRC}

{com}. //_148
. use "/Users/Sam/Desktop/Econ 645/Data/CPS/jun23pub.dta",replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week8_LDV1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Oct 2024, 21:08:15
{txt}{.-}
{smcl}
{txt}{sf}{ul off}