{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week8_LDV1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Oct 2023, 16:50:41
{txt}
{com}. //_1
. clear
{txt}
{com}. set more off
{txt}
{com}. //_2
. cd "/Users/Sam/Desktop/Econ 645/Data/Wooldridge"
{res}/Users/Sam/Desktop/Econ 645/Data/Wooldridge
{txt}
{com}. //_3
. use mroz.dta, clear
{txt}
{com}. //_4
. tabulate inlf

       {txt}inlf {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        325       43.16       43.16
{txt}          1 {c |}{res}        428       56.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        753      100.00
{txt}
{com}. //_5
. est clear
{txt}
{com}. //_6
. eststo Logit: logit inlf nwifeinc educ exper expersq kidslt6 kidsge6

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:-422.78042}  
Iteration 2:{space 3}log likelihood = {res:-421.73851}  
Iteration 3:{space 3}log likelihood = {res:-421.73502}  
Iteration 4:{space 3}log likelihood = {res:-421.73502}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}       753
{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}    186.28
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-421.73502{txt}{col 49}Pseudo R2{col 67}= {res}    0.1809

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        inlf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0301171{col 26}{space 2} .0082431{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.0462734{col 67}{space 3}-.0139609
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .2520038{col 26}{space 2} .0425492{col 37}{space 1}    5.92{col 46}{space 3}0.000{col 54}{space 4}  .168609{col 67}{space 3} .3353987
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .2057387{col 26}{space 2} .0310518{col 37}{space 1}    6.63{col 46}{space 3}0.000{col 54}{space 4} .1448784{col 67}{space 3}  .266599
{txt}{space 5}expersq {c |}{col 14}{res}{space 2} -.003913{col 26}{space 2} .0009994{col 37}{space 1}   -3.92{col 46}{space 3}0.000{col 54}{space 4}-.0058718{col 67}{space 3}-.0019541
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.9175126{col 26}{space 2} .1742458{col 37}{space 1}   -5.27{col 46}{space 3}0.000{col 54}{space 4}-1.259028{col 67}{space 3}-.5759971
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .2226164{col 26}{space 2} .0683456{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .0886616{col 67}{space 3} .3565713
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.739707{col 26}{space 2}  .543217{col 37}{space 1}   -6.88{col 46}{space 3}0.000{col 54}{space 4}-4.804392{col 67}{space 3}-2.675021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_7
. eststo Probit: probit inlf nwifeinc educ exper expersq kidslt6 kidsge6

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:-422.36847}  
Iteration 2:{space 3}log likelihood = {res:-421.80202}  
Iteration 3:{space 3}log likelihood = {res:-421.80161}  
Iteration 4:{space 3}log likelihood = {res:-421.80161}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}       753
{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}    186.14
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-421.80161{txt}{col 49}Pseudo R2{col 67}= {res}    0.1808

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        inlf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2} -.017188{col 26}{space 2}   .00474{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0264782{col 67}{space 3}-.0078978
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .1501412{col 26}{space 2}   .02471{col 37}{space 1}    6.08{col 46}{space 3}0.000{col 54}{space 4} .1017105{col 67}{space 3} .1985719
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .1240105{col 26}{space 2} .0183233{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .0880975{col 67}{space 3} .1599236
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0023694{col 26}{space 2} .0005913{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-.0035284{col 67}{space 3}-.0012103
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.5543317{col 26}{space 2} .1038244{col 37}{space 1}   -5.34{col 46}{space 3}0.000{col 54}{space 4}-.7578238{col 67}{space 3}-.3508395
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .1307901{col 26}{space 2} .0399186{col 37}{space 1}    3.28{col 46}{space 3}0.001{col 54}{space 4} .0525511{col 67}{space 3} .2090292
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.244553{col 26}{space 2} .3146254{col 37}{space 1}   -7.13{col 46}{space 3}0.000{col 54}{space 4}-2.861207{col 67}{space 3}-1.627899
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. esttab Logit Probit, mtitle
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                    Logit          Probit   
{txt}{hline 44}
{res}inlf                                        {txt}
{txt}nwifeinc    {res}      -0.0301***      -0.0172***{txt}
            {res} {ralign 12:{txt:(}-3.65{txt:)}}    {ralign 12:{txt:(}-3.63{txt:)}}   {txt}

{txt}educ        {res}        0.252***        0.150***{txt}
            {res} {ralign 12:{txt:(}5.92{txt:)}}    {ralign 12:{txt:(}6.08{txt:)}}   {txt}

{txt}exper       {res}        0.206***        0.124***{txt}
            {res} {ralign 12:{txt:(}6.63{txt:)}}    {ralign 12:{txt:(}6.77{txt:)}}   {txt}

{txt}expersq     {res}     -0.00391***     -0.00237***{txt}
            {res} {ralign 12:{txt:(}-3.92{txt:)}}    {ralign 12:{txt:(}-4.01{txt:)}}   {txt}

{txt}kidslt6     {res}       -0.918***       -0.554***{txt}
            {res} {ralign 12:{txt:(}-5.27{txt:)}}    {ralign 12:{txt:(}-5.34{txt:)}}   {txt}

{txt}kidsge6     {res}        0.223**         0.131** {txt}
            {res} {ralign 12:{txt:(}3.26{txt:)}}    {ralign 12:{txt:(}3.28{txt:)}}   {txt}

{txt}_cons       {res}       -3.740***       -2.245***{txt}
            {res} {ralign 12:{txt:(}-6.88{txt:)}}    {ralign 12:{txt:(}-7.13{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          753             753   {txt}
{txt}{hline 44}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_9
. est clear
{txt}
{com}. //_10
. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo LPM: margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0034052{col 26}{space 2} .0014485{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0062488{col 67}{space 3}-.0005616
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0379953{col 26}{space 2}  .007376{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4}  .023515{col 67}{space 3} .0524756
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0394924{col 26}{space 2} .0056727{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} .0283561{col 67}{space 3} .0506287
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005963{col 26}{space 2} .0001848{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0009591{col 67}{space 3}-.0002335
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0160908{col 26}{space 2} .0024847{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0209686{col 67}{space 3} -.011213
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0130122{col 26}{space 2}  .013196{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.0128935{col 67}{space 3} .0389179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_11
. quietly logit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Logit: margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0038118{col 26}{space 2} .0014824{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0067172{col 67}{space 3}-.0009064
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0394965{col 26}{space 2} .0072947{col 37}{space 1}    5.41{col 46}{space 3}0.000{col 54}{space 4} .0251992{col 67}{space 3} .0537939
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0367641{col 26}{space 2}   .00515{col 37}{space 1}    7.14{col 46}{space 3}0.000{col 54}{space 4} .0266702{col 67}{space 3}  .046858
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005633{col 26}{space 2} .0001774{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.0009109{col 67}{space 3}-.0002156
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0157194{col 26}{space 2} .0023808{col 37}{space 1}   -6.60{col 46}{space 3}0.000{col 54}{space 4}-.0203856{col 67}{space 3}-.0110532
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2577537{col 26}{space 2} .0319416{col 37}{space 1}   -8.07{col 46}{space 3}0.000{col 54}{space 4}-.3203581{col 67}{space 3}-.1951492
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0107348{col 26}{space 2}  .013333{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-.0153974{col 67}{space 3} .0368671
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_12
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Probit: margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0036162{col 26}{space 2} .0014414{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0064413{col 67}{space 3}-.0007911
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0393703{col 26}{space 2} .0072216{col 37}{space 1}    5.45{col 46}{space 3}0.000{col 54}{space 4} .0252161{col 67}{space 3} .0535244
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0370974{col 26}{space 2} .0051522{col 37}{space 1}    7.20{col 46}{space 3}0.000{col 54}{space 4} .0269993{col 67}{space 3} .0471956
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005675{col 26}{space 2} .0001771{col 37}{space 1}   -3.20{col 46}{space 3}0.001{col 54}{space 4}-.0009146{col 67}{space 3}-.0002204
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0158957{col 26}{space 2} .0023587{col 37}{space 1}   -6.74{col 46}{space 3}0.000{col 54}{space 4}-.0205186{col 67}{space 3}-.0112728
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2611542{col 26}{space 2} .0318597{col 37}{space 1}   -8.20{col 46}{space 3}0.000{col 54}{space 4}-.3235982{col 67}{space 3}-.1987103
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0108287{col 26}{space 2} .0130584{col 37}{space 1}    0.83{col 46}{space 3}0.407{col 54}{space 4}-.0147654{col 67}{space 3} .0364227
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_13
. esttab LPM Logit Probit, mtitle 
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}                      LPM           Logit          Probit   
{txt}{hline 60}
{res}main                                                        {txt}
{txt}nwifeinc    {res}     -0.00341*        -0.0213*        -0.0120*  {txt}
            {res} {ralign 12:{txt:(}-2.35{txt:)}}    {ralign 12:{txt:(}-2.53{txt:)}}    {ralign 12:{txt:(}-2.48{txt:)}}   {txt}

{txt}educ        {res}       0.0380***        0.221***        0.131***{txt}
            {res} {ralign 12:{txt:(}5.15{txt:)}}    {ralign 12:{txt:(}5.09{txt:)}}    {ralign 12:{txt:(}5.18{txt:)}}   {txt}

{txt}exper       {res}       0.0395***        0.206***        0.123***{txt}
            {res} {ralign 12:{txt:(}6.96{txt:)}}    {ralign 12:{txt:(}6.42{txt:)}}    {ralign 12:{txt:(}6.59{txt:)}}   {txt}

{txt}expersq     {res}    -0.000596**      -0.00315**      -0.00189** {txt}
            {res} {ralign 12:{txt:(}-3.23{txt:)}}    {ralign 12:{txt:(}-3.10{txt:)}}    {ralign 12:{txt:(}-3.15{txt:)}}   {txt}

{txt}age         {res}      -0.0161***      -0.0880***      -0.0529***{txt}
            {res} {ralign 12:{txt:(}-6.48{txt:)}}    {ralign 12:{txt:(}-6.04{txt:)}}    {ralign 12:{txt:(}-6.23{txt:)}}   {txt}

{txt}kidslt6     {res}       -0.262***       -1.443***       -0.868***{txt}
            {res} {ralign 12:{txt:(}-7.81{txt:)}}    {ralign 12:{txt:(}-7.09{txt:)}}    {ralign 12:{txt:(}-7.33{txt:)}}   {txt}

{txt}kidsge6     {res}       0.0130          0.0601          0.0360   {txt}
            {res} {ralign 12:{txt:(}0.99{txt:)}}    {ralign 12:{txt:(}0.80{txt:)}}    {ralign 12:{txt:(}0.83{txt:)}}   {txt}

{txt}_cons       {res}        0.586***        0.425           0.270   {txt}
            {res} {ralign 12:{txt:(}3.80{txt:)}}    {ralign 12:{txt:(}0.49{txt:)}}    {ralign 12:{txt:(}0.53{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}          753             753             753   {txt}
{txt}{hline 60}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_14
. est clear
{txt}
{com}. //_15
. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo LPM: margins, dydx(*) atmeans
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}178.0385 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0034052{col 26}{space 2} .0014485{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0062488{col 67}{space 3}-.0005616
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0379953{col 26}{space 2}  .007376{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4}  .023515{col 67}{space 3} .0524756
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0394924{col 26}{space 2} .0056727{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} .0283561{col 67}{space 3} .0506287
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0005963{col 26}{space 2} .0001848{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0009591{col 67}{space 3}-.0002335
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0160908{col 26}{space 2} .0024847{col 37}{space 1}   -6.48{col 46}{space 3}0.000{col 54}{space 4}-.0209686{col 67}{space 3} -.011213
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0130122{col 26}{space 2}  .013196{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.0128935{col 67}{space 3} .0389179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_16
. quietly logit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Logit: margins, dydx(*) atmeans
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}178.0385 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0051901{col 26}{space 2} .0020482{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-.0092045{col 67}{space 3}-.0011756
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0537773{col 26}{space 2} .0105608{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} .0330785{col 67}{space 3} .0744761
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0500569{col 26}{space 2} .0078247{col 37}{space 1}    6.40{col 46}{space 3}0.000{col 54}{space 4} .0347209{col 67}{space 3}  .065393
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0007669{col 26}{space 2} .0002477{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.0012524{col 67}{space 3}-.0002815
{txt}{space 9}age {c |}{col 14}{res}{space 2} -.021403{col 26}{space 2} .0035398{col 37}{space 1}   -6.05{col 46}{space 3}0.000{col 54}{space 4}-.0283408{col 67}{space 3}-.0144652
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.3509498{col 26}{space 2} .0496395{col 37}{space 1}   -7.07{col 46}{space 3}0.000{col 54}{space 4}-.4482414{col 67}{space 3}-.2536583
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0146162{col 26}{space 2} .0181884{col 37}{space 1}    0.80{col 46}{space 3}0.422{col 54}{space 4}-.0210324{col 67}{space 3} .0502649
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_17
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo Probit: margins, dydx(*) atmeans
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}178.0385 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-.0046962{col 26}{space 2} .0018903{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0084012{col 67}{space 3}-.0009913
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0511287{col 26}{space 2} .0098592{col 37}{space 1}    5.19{col 46}{space 3}0.000{col 54}{space 4} .0318051{col 67}{space 3} .0704523
{txt}{space 7}exper {c |}{col 14}{res}{space 2} .0481771{col 26}{space 2} .0073278{col 37}{space 1}    6.57{col 46}{space 3}0.000{col 54}{space 4} .0338149{col 67}{space 3} .0625392
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.0007371{col 26}{space 2} .0002347{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4} -.001197{col 67}{space 3}-.0002771
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0206432{col 26}{space 2} .0033079{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.0271265{col 67}{space 3}-.0141598
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-.3391514{col 26}{space 2} .0463581{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.4300117{col 67}{space 3}-.2482911
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2} .0140628{col 26}{space 2} .0169852{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 54}{space 4}-.0192275{col 67}{space 3} .0473531
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_18
. esttab LPM Logit Probit, mtitle 
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}                      LPM           Logit          Probit   
{txt}{hline 60}
{res}main                                                        {txt}
{txt}nwifeinc    {res}     -0.00341*        -0.0213*        -0.0120*  {txt}
            {res} {ralign 12:{txt:(}-2.35{txt:)}}    {ralign 12:{txt:(}-2.53{txt:)}}    {ralign 12:{txt:(}-2.48{txt:)}}   {txt}

{txt}educ        {res}       0.0380***        0.221***        0.131***{txt}
            {res} {ralign 12:{txt:(}5.15{txt:)}}    {ralign 12:{txt:(}5.09{txt:)}}    {ralign 12:{txt:(}5.18{txt:)}}   {txt}

{txt}exper       {res}       0.0395***        0.206***        0.123***{txt}
            {res} {ralign 12:{txt:(}6.96{txt:)}}    {ralign 12:{txt:(}6.42{txt:)}}    {ralign 12:{txt:(}6.59{txt:)}}   {txt}

{txt}expersq     {res}    -0.000596**      -0.00315**      -0.00189** {txt}
            {res} {ralign 12:{txt:(}-3.23{txt:)}}    {ralign 12:{txt:(}-3.10{txt:)}}    {ralign 12:{txt:(}-3.15{txt:)}}   {txt}

{txt}age         {res}      -0.0161***      -0.0880***      -0.0529***{txt}
            {res} {ralign 12:{txt:(}-6.48{txt:)}}    {ralign 12:{txt:(}-6.04{txt:)}}    {ralign 12:{txt:(}-6.23{txt:)}}   {txt}

{txt}kidslt6     {res}       -0.262***       -1.443***       -0.868***{txt}
            {res} {ralign 12:{txt:(}-7.81{txt:)}}    {ralign 12:{txt:(}-7.09{txt:)}}    {ralign 12:{txt:(}-7.33{txt:)}}   {txt}

{txt}kidsge6     {res}       0.0130          0.0601          0.0360   {txt}
            {res} {ralign 12:{txt:(}0.99{txt:)}}    {ralign 12:{txt:(}0.80{txt:)}}    {ralign 12:{txt:(}0.83{txt:)}}   {txt}

{txt}_cons       {res}        0.586***        0.425           0.270   {txt}
            {res} {ralign 12:{txt:(}3.80{txt:)}}    {ralign 12:{txt:(}0.49{txt:)}}    {ralign 12:{txt:(}0.53{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}          753             753             753   {txt}
{txt}{hline 60}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_19
. est clear
{txt}
{com}. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo lpm: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1015504{col 26}{space 2}  .091955{col 37}{space 1}    1.10{col 46}{space 3}0.270{col 54}{space 4}-.0789714{col 67}{space 3} .2820723
{txt}{space 10}2  {c |}{col 14}{res}{space 2}  .177541{col 26}{space 2} .0774562{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0254827{col 67}{space 3} .3295993
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2535316{col 26}{space 2} .0630748{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .1297062{col 67}{space 3} .3773571
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .3295222{col 26}{space 2} .0489147{col 37}{space 1}    6.74{col 46}{space 3}0.000{col 54}{space 4} .2334952{col 67}{space 3} .4255492
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .4055128{col 26}{space 2} .0352435{col 37}{space 1}   11.51{col 46}{space 3}0.000{col 54}{space 4} .3363244{col 67}{space 3} .4747013
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .4815034{col 26}{space 2} .0229524{col 37}{space 1}   20.98{col 46}{space 3}0.000{col 54}{space 4} .4364444{col 67}{space 3} .5265625
{txt}{space 10}7  {c |}{col 14}{res}{space 2}  .557494{col 26}{space 2} .0157087{col 37}{space 1}   35.49{col 46}{space 3}0.000{col 54}{space 4} .5266554{col 67}{space 3} .5883327
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .6334846{col 26}{space 2}  .020049{col 37}{space 1}   31.60{col 46}{space 3}0.000{col 54}{space 4} .5941254{col 67}{space 3} .6728439
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .7094753{col 26}{space 2} .0315024{col 37}{space 1}   22.52{col 46}{space 3}0.000{col 54}{space 4} .6476311{col 67}{space 3} .7713194
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .7854659{col 26}{space 2} .0449232{col 37}{space 1}   17.48{col 46}{space 3}0.000{col 54}{space 4} .6972748{col 67}{space 3} .8736569
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .8614565{col 26}{space 2} .0589832{col 37}{space 1}   14.61{col 46}{space 3}0.000{col 54}{space 4} .7456633{col 67}{space 3} .9772496
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_20
. quietly logit inlf nwifeinc educ exper expersq kidslt6 kidsge6
{txt}
{com}. eststo logit1: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0862997{col 26}{space 2} .0378791{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .0120581{col 67}{space 3} .1605413
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .1307839{col 26}{space 2}   .04457{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0434283{col 67}{space 3} .2181396
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1911164{col 26}{space 2} .0475215{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4}  .097976{col 67}{space 3} .2842567
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .2675469{col 26}{space 2} .0448132{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .1797146{col 67}{space 3} .3553791
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .3575117{col 26}{space 2} .0362904{col 37}{space 1}    9.85{col 46}{space 3}0.000{col 54}{space 4} .2863838{col 67}{space 3} .4286396
{txt}{space 10}6  {c |}{col 14}{res}{space 2}  .455911{col 26}{space 2}  .024513{col 37}{space 1}   18.60{col 46}{space 3}0.000{col 54}{space 4} .4078663{col 67}{space 3} .5039556
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .5562468{col 26}{space 2} .0165243{col 37}{space 1}   33.66{col 46}{space 3}0.000{col 54}{space 4} .5238597{col 67}{space 3} .5886338
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .6519779{col 26}{space 2} .0204676{col 37}{space 1}   31.85{col 46}{space 3}0.000{col 54}{space 4} .6118622{col 67}{space 3} .6920936
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .7376484{col 26}{space 2} .0281232{col 37}{space 1}   26.23{col 46}{space 3}0.000{col 54}{space 4} .6825279{col 67}{space 3} .7927688
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .8096698{col 26}{space 2} .0325919{col 37}{space 1}   24.84{col 46}{space 3}0.000{col 54}{space 4} .7457909{col 67}{space 3} .8735486
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .8666826{col 26}{space 2} .0327653{col 37}{space 1}   26.45{col 46}{space 3}0.000{col 54}{space 4} .8024638{col 67}{space 3} .9309015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_21
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo probit1: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1315922{col 26}{space 2}  .055059{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} .0236785{col 67}{space 3} .2395059
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .1833441{col 26}{space 2} .0570249{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0715773{col 67}{space 3} .2951109
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2455272{col 26}{space 2} .0543798{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} .1389447{col 67}{space 3} .3521097
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .3168216{col 26}{space 2} .0470756{col 37}{space 1}    6.73{col 46}{space 3}0.000{col 54}{space 4} .2245552{col 67}{space 3}  .409088
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .3949415{col 26}{space 2} .0360827{col 37}{space 1}   10.95{col 46}{space 3}0.000{col 54}{space 4} .3242206{col 67}{space 3} .4656623
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .4768675{col 26}{space 2} .0237722{col 37}{space 1}   20.06{col 46}{space 3}0.000{col 54}{space 4} .4302749{col 67}{space 3} .5234602
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .5592018{col 26}{space 2} .0159547{col 37}{space 1}   35.05{col 46}{space 3}0.000{col 54}{space 4} .5279311{col 67}{space 3} .5904724
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .6385748{col 26}{space 2} .0200316{col 37}{space 1}   31.88{col 46}{space 3}0.000{col 54}{space 4} .5993136{col 67}{space 3}  .677836
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .7120285{col 26}{space 2} .0288142{col 37}{space 1}   24.71{col 46}{space 3}0.000{col 54}{space 4} .6555538{col 67}{space 3} .7685032
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .7773109{col 26}{space 2} .0357596{col 37}{space 1}   21.74{col 46}{space 3}0.000{col 54}{space 4} .7072234{col 67}{space 3} .8473984
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .8330432{col 26}{space 2} .0391944{col 37}{space 1}   21.25{col 46}{space 3}0.000{col 54}{space 4} .7562235{col 67}{space 3} .9098629
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_22
. coefplot lpm logit1, at recast(line) ciopts(recast(rline) lpattern(dash))
{res}{txt}
{com}. coefplot lpm probit1, at recast(line) ciopts(recast(rline) lpattern(dash))
{res}{txt}
{com}. coefplot logit1 probit1, at recast(line) ciopts(recast(rline) lpattern(dash))
{res}{txt}
{com}. //_23
. quietly reg inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. margins, dydx(kidslt6) at(educ=(0(2)20))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:kidslt6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}kidslt6      {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.2618105{col 26}{space 2} .0335058{col 37}{space 1}   -7.81{col 46}{space 3}0.000{col 54}{space 4}-.3275875{col 67}{space 3}-.1960335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_24
. quietly logit inlf nwifeinc educ exper expersq kidslt6 kidsge6
{txt}
{com}. margins, dydx(kidslt6) at(educ=(0(2)20))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:kidslt6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}kidslt6      {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0677567{col 26}{space 2} .0262236{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.1191539{col 67}{space 3}-.0163594
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0949468{col 26}{space 2} .0281434{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.1501069{col 67}{space 3}-.0397867
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1248173{col 26}{space 2} .0285395{col 37}{space 1}   -4.37{col 46}{space 3}0.000{col 54}{space 4}-.1807537{col 67}{space 3}-.0688808
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.1526688{col 26}{space 2} .0293293{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.2101531{col 67}{space 3}-.0951844
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.1732958{col 26}{space 2} .0313347{col 37}{space 1}   -5.53{col 46}{space 3}0.000{col 54}{space 4}-.2347106{col 67}{space 3} -.111881
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.1829484{col 26}{space 2} .0327734{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.2471831{col 67}{space 3}-.1187137
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.1803418{col 26}{space 2} .0319215{col 37}{space 1}   -5.65{col 46}{space 3}0.000{col 54}{space 4}-.2429069{col 67}{space 3}-.1177768
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.1665232{col 26}{space 2} .0289231{col 37}{space 1}   -5.76{col 46}{space 3}0.000{col 54}{space 4}-.2232115{col 67}{space 3}-.1098349
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.1442912{col 26}{space 2} .0254362{col 37}{space 1}   -5.67{col 46}{space 3}0.000{col 54}{space 4}-.1941452{col 67}{space 3}-.0944372
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.1175221{col 26}{space 2} .0231237{col 37}{space 1}   -5.08{col 46}{space 3}0.000{col 54}{space 4}-.1628437{col 67}{space 3}-.0722005
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0902871{col 26}{space 2} .0218973{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-.1332051{col 67}{space 3}-.0473691
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_logitinlf.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_logitinlf.png written in PNG format)

{com}. //_25
. quietly probit inlf nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. margins, dydx(kidslt6) at(educ=(0(2)20))
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(inlf), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:kidslt6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}kidslt6      {txt}{c |}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} -.153748{col 26}{space 2} .0455045{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-.2429352{col 67}{space 3}-.0645607
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.1893831{col 26}{space 2} .0408614{col 37}{space 1}   -4.63{col 46}{space 3}0.000{col 54}{space 4}-.2694699{col 67}{space 3}-.1092962
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.2223621{col 26}{space 2} .0360335{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-.2929864{col 67}{space 3}-.1517377
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.2492771{col 26}{space 2}  .033371{col 37}{space 1}   -7.47{col 46}{space 3}0.000{col 54}{space 4}-.3146829{col 67}{space 3}-.1838712
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.2672253{col 26}{space 2} .0331963{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-.3322889{col 67}{space 3}-.2021617
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.2743121{col 26}{space 2} .0335951{col 37}{space 1}   -8.17{col 46}{space 3}0.000{col 54}{space 4}-.3401572{col 67}{space 3} -.208467
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.2699501{col 26}{space 2}  .032832{col 37}{space 1}   -8.22{col 46}{space 3}0.000{col 54}{space 4}-.3342997{col 67}{space 3}-.2056006
{txt}{space 10}8  {c |}{col 14}{res}{space 2} -.254902{col 26}{space 2}  .030869{col 37}{space 1}   -8.26{col 46}{space 3}0.000{col 54}{space 4}-.3154042{col 67}{space 3}-.1943998
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.2310833{col 26}{space 2} .0292123{col 37}{space 1}   -7.91{col 46}{space 3}0.000{col 54}{space 4}-.2883384{col 67}{space 3}-.1738282
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.2011899{col 26}{space 2} .0295232{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.2590542{col 67}{space 3}-.1433256
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.1682404{col 26}{space 2} .0317255{col 37}{space 1}   -5.30{col 46}{space 3}0.000{col 54}{space 4}-.2304211{col 67}{space 3}-.1060596
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. marginsplot, yline(0)

{text}{p 2 6 2}Variables that uniquely identify margins: educ{p_end}
{res}{txt}
{com}. //_26
. use mroz.dta, clear
{txt}
{com}. //_27
. sum hours

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}hours {c |}{res}        753    740.5764    871.3142          0       4950
{txt}
{com}. tab hours if hours == 0

      {txt}hours {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        325      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        325      100.00
{txt}
{com}. //_28
. tabstat hours, by(inlf) stat(mean median sd)

{txt}Summary for variables: hours
{col 6}by categories of: inlf 

{ralign 8:inlf} {...}
{c |}      mean       p50        sd
{hline 9}{c +}{hline 30}
{ralign 8:0} {...}
{c |}{...}
 {res}        0         0         0
{txt}{ralign 8:1} {...}
{c |}{...}
 {res}  1302.93    1365.5  776.2744
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} 740.5764       288  871.3142
{txt}{hline 9}{c BT}{hline 30}

{com}. //_29
. histogram hours
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}183.33333{txt})
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_hourhist.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_hourhist.png written in PNG format)

{com}. //_30
. sum hours if hours > 0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}hours {c |}{res}        428     1302.93    776.2744         12       4950
{txt}
{com}. //_31
. est clear
{txt}
{com}. eststo OLS: reg hours nwifeinc educ exper expersq age kidslt6 kidsge6

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(7, 745)       = {res}    38.50
{txt}       Model {c |} {res}  151647606         7  21663943.7   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  419262118       745  562767.944   {txt}R-squared       ={res}    0.2656
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2587
{txt}       Total {c |} {res}  570909724       752  759188.463   {txt}Root MSE        =   {res} 750.18

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       hours{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-3.446636{col 26}{space 2}    2.544{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-8.440898{col 67}{space 3} 1.547626
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 28.76112{col 26}{space 2} 12.95459{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} 3.329283{col 67}{space 3} 54.19297
{txt}{space 7}exper {c |}{col 14}{res}{space 2} 65.67251{col 26}{space 2} 9.962983{col 37}{space 1}    6.59{col 46}{space 3}0.000{col 54}{space 4} 46.11365{col 67}{space 3} 85.23138
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-.7004939{col 26}{space 2} .3245501{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-1.337635{col 67}{space 3}-.0633524
{txt}{space 9}age {c |}{col 14}{res}{space 2}-30.51163{col 26}{space 2} 4.363868{col 37}{space 1}   -6.99{col 46}{space 3}0.000{col 54}{space 4}-39.07858{col 67}{space 3}-21.94469
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-442.0899{col 26}{space 2}  58.8466{col 37}{space 1}   -7.51{col 46}{space 3}0.000{col 54}{space 4}-557.6148{col 67}{space 3} -326.565
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-32.77923{col 26}{space 2} 23.17622{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4} -78.2777{col 67}{space 3} 12.71924
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1330.482{col 26}{space 2} 270.7846{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} 798.8906{col 67}{space 3} 1862.074
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 740.5764{col 26}{space 2} 27.33803{col 37}{space 1}   27.09{col 46}{space 3}0.000{col 54}{space 4} 686.9076{col 67}{space 3} 794.2451
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_32
. eststo TOBIT: tobit hours nwifeinc educ exper expersq age kidslt6 kidsge6, ll(0)
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}       753
{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}    271.59
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-3819.0946{txt}{col 49}Pseudo R2{col 67}= {res}    0.0343

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       hours{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-8.814243{col 26}{space 2} 4.459096{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-17.56811{col 67}{space 3}-.0603724
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 80.64561{col 26}{space 2} 21.58322{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} 38.27453{col 67}{space 3} 123.0167
{txt}{space 7}exper {c |}{col 14}{res}{space 2} 131.5643{col 26}{space 2} 17.27938{col 37}{space 1}    7.61{col 46}{space 3}0.000{col 54}{space 4} 97.64231{col 67}{space 3} 165.4863
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.864158{col 26}{space 2} .5376615{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-2.919667{col 67}{space 3}-.8086479
{txt}{space 9}age {c |}{col 14}{res}{space 2}-54.40501{col 26}{space 2} 7.418496{col 37}{space 1}   -7.33{col 46}{space 3}0.000{col 54}{space 4}-68.96862{col 67}{space 3} -39.8414
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-894.0217{col 26}{space 2} 111.8779{col 37}{space 1}   -7.99{col 46}{space 3}0.000{col 54}{space 4}-1113.655{col 67}{space 3}-674.3887
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}  -16.218{col 26}{space 2} 38.64136{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-92.07675{col 67}{space 3} 59.64075
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 965.3053{col 26}{space 2} 446.4358{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} 88.88528{col 67}{space 3} 1841.725
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      /sigma {c |}{col 14}{res}{space 2} 1122.022{col 26}{space 2} 41.57903{col 54}{space 4} 1040.396{col 67}{space 3} 1203.647
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}           325{txt}  left-censored observations at hours <= {res}0
           428{txt}     uncensored observations
{res}             0{txt} right-censored observations

{com}. quietly sum exper
{txt}
{com}. local exp2=r(mean)^2
{txt}
{com}. //_33
. margins, dydx(*) predict(ystar(0,.)) at(expersq=`exp2')
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours*|hours>0), predict(ystar(0,.))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:expersq}{space 9}{txt:=} {space 3}113.0141}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-5.223903{col 26}{space 2} 2.639553{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-10.39733{col 67}{space 3}-.0504745
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 47.79592{col 26}{space 2}  12.7368{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} 22.83224{col 67}{space 3}  72.7596
{txt}{space 7}exper {c |}{col 14}{res}{space 2}  77.9737{col 26}{space 2} 9.900685{col 37}{space 1}    7.88{col 46}{space 3}0.000{col 54}{space 4} 58.56872{col 67}{space 3} 97.37869
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.104823{col 26}{space 2}  .316282{col 37}{space 1}   -3.49{col 46}{space 3}0.000{col 54}{space 4}-1.724724{col 67}{space 3}-.4849218
{txt}{space 9}age {c |}{col 14}{res}{space 2}-32.24401{col 26}{space 2} 4.348403{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4}-40.76672{col 67}{space 3}-23.72129
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-529.8564{col 26}{space 2} 65.40462{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-658.0471{col 67}{space 3}-401.6657
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-9.611857{col 26}{space 2} 22.90535{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-54.50553{col 67}{space 3} 35.28181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_34
. margins, dydx(*) predict(ystar(0,.)) at(expersq=`exp2')
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours*|hours>0), predict(ystar(0,.))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:expersq}{space 9}{txt:=} {space 3}113.0141}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-5.223903{col 26}{space 2} 2.639553{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-10.39733{col 67}{space 3}-.0504745
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 47.79592{col 26}{space 2}  12.7368{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} 22.83224{col 67}{space 3}  72.7596
{txt}{space 7}exper {c |}{col 14}{res}{space 2}  77.9737{col 26}{space 2} 9.900685{col 37}{space 1}    7.88{col 46}{space 3}0.000{col 54}{space 4} 58.56872{col 67}{space 3} 97.37869
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.104823{col 26}{space 2}  .316282{col 37}{space 1}   -3.49{col 46}{space 3}0.000{col 54}{space 4}-1.724724{col 67}{space 3}-.4849218
{txt}{space 9}age {c |}{col 14}{res}{space 2}-32.24401{col 26}{space 2} 4.348403{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4}-40.76672{col 67}{space 3}-23.72129
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-529.8564{col 26}{space 2} 65.40462{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-658.0471{col 67}{space 3}-401.6657
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-9.611857{col 26}{space 2} 22.90535{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-54.50553{col 67}{space 3} 35.28181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_35
. margins, dydx(*) predict(ystar(0,.)) at(expersq=`exp2') atmeans
{res}
{txt}Conditional marginal effects{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours*|hours>0), predict(ystar(0,.))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:nwifeinc educ exper expersq age kidslt6 kidsge6}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:nwifeinc}{space 8}{txt:=} {space 3}20.12896 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 3}12.28685 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:exper}{space 11}{txt:=} {space 3}10.63081 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:expersq}{space 9}{txt:=} {space 3}113.0141}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 3}42.53785 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidslt6}{space 9}{txt:=} {space 3}.2377158 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:kidsge6}{space 9}{txt:=} {space 3}1.353254 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}nwifeinc {c |}{col 14}{res}{space 2}-5.687381{col 26}{space 2} 2.877882{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-11.32793{col 67}{space 3}-.0468358
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 52.03649{col 26}{space 2} 13.82013{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 24.94954{col 67}{space 3} 79.12345
{txt}{space 7}exper {c |}{col 14}{res}{space 2} 84.89173{col 26}{space 2} 12.39757{col 37}{space 1}    6.85{col 46}{space 3}0.000{col 54}{space 4} 60.59293{col 67}{space 3} 109.1905
{txt}{space 5}expersq {c |}{col 14}{res}{space 2}-1.202846{col 26}{space 2} .3666136{col 37}{space 1}   -3.28{col 46}{space 3}0.001{col 54}{space 4}-1.921395{col 67}{space 3}-.4842964
{txt}{space 9}age {c |}{col 14}{res}{space 2}-35.10478{col 26}{space 2} 4.669466{col 37}{space 1}   -7.52{col 46}{space 3}0.000{col 54}{space 4}-44.25676{col 67}{space 3}-25.95279
{txt}{space 5}kidslt6 {c |}{col 14}{res}{space 2}-576.8666{col 26}{space 2} 70.92986{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-715.8866{col 67}{space 3}-437.8466
{txt}{space 5}kidsge6 {c |}{col 14}{res}{space 2}-10.46465{col 26}{space 2} 24.93972{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-59.34561{col 67}{space 3} 38.41632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_36
. esttab OLS TOBIT, mtitle
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS           TOBIT   
{txt}{hline 44}
{res}main                                        {txt}
{txt}nwifeinc    {res}       -3.447          -8.814*  {txt}
            {res} {ralign 12:{txt:(}-1.35{txt:)}}    {ralign 12:{txt:(}-1.98{txt:)}}   {txt}

{txt}educ        {res}        28.76*          80.65***{txt}
            {res} {ralign 12:{txt:(}2.22{txt:)}}    {ralign 12:{txt:(}3.74{txt:)}}   {txt}

{txt}exper       {res}        65.67***        131.6***{txt}
            {res} {ralign 12:{txt:(}6.59{txt:)}}    {ralign 12:{txt:(}7.61{txt:)}}   {txt}

{txt}expersq     {res}       -0.700*         -1.864***{txt}
            {res} {ralign 12:{txt:(}-2.16{txt:)}}    {ralign 12:{txt:(}-3.47{txt:)}}   {txt}

{txt}age         {res}       -30.51***       -54.41***{txt}
            {res} {ralign 12:{txt:(}-6.99{txt:)}}    {ralign 12:{txt:(}-7.33{txt:)}}   {txt}

{txt}kidslt6     {res}       -442.1***       -894.0***{txt}
            {res} {ralign 12:{txt:(}-7.51{txt:)}}    {ralign 12:{txt:(}-7.99{txt:)}}   {txt}

{txt}kidsge6     {res}       -32.78          -16.22   {txt}
            {res} {ralign 12:{txt:(}-1.41{txt:)}}    {ralign 12:{txt:(}-0.42{txt:)}}   {txt}

{txt}_cons       {res}       1330.5***        965.3*  {txt}
            {res} {ralign 12:{txt:(}4.91{txt:)}}    {ralign 12:{txt:(}2.16{txt:)}}   {txt}
{hline 44}
{res}sigma                                       {txt}
{txt}_cons       {res}                       1122.0***{txt}
            {res}                 {ralign 12:{txt:(}26.99{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          753             753   {txt}
{txt}{hline 44}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. //_37
. est clear
{txt}
{com}. //_38
. quietly reg hours nwifeinc educ exper expersq age kidslt6 kidsge6
{txt}
{com}. eststo OLS: margins, at(educ=(0(2)20)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OLS

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Linear prediction, predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 387.1927{col 26}{space 2} 161.5017{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4}    70.14{col 67}{space 3} 704.2453
{txt}{space 10}2  {c |}{col 14}{res}{space 2} 444.7149{col 26}{space 2} 136.0372{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} 177.6531{col 67}{space 3} 711.7767
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 502.2372{col 26}{space 2}  110.779{col 37}{space 1}    4.53{col 46}{space 3}0.000{col 54}{space 4}  284.761{col 67}{space 3} 719.7133
{txt}{space 10}4  {c |}{col 14}{res}{space 2} 559.7594{col 26}{space 2}  85.9094{col 37}{space 1}    6.52{col 46}{space 3}0.000{col 54}{space 4} 391.1061{col 67}{space 3} 728.4127
{txt}{space 10}5  {c |}{col 14}{res}{space 2} 617.2817{col 26}{space 2} 61.89861{col 37}{space 1}    9.97{col 46}{space 3}0.000{col 54}{space 4} 495.7652{col 67}{space 3} 738.7981
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 674.8039{col 26}{space 2} 40.31156{col 37}{space 1}   16.74{col 46}{space 3}0.000{col 54}{space 4} 595.6661{col 67}{space 3} 753.9417
{txt}{space 10}7  {c |}{col 14}{res}{space 2} 732.3262{col 26}{space 2} 27.58943{col 37}{space 1}   26.54{col 46}{space 3}0.000{col 54}{space 4} 678.1639{col 67}{space 3} 786.4884
{txt}{space 10}8  {c |}{col 14}{res}{space 2} 789.8484{col 26}{space 2} 35.21225{col 37}{space 1}   22.43{col 46}{space 3}0.000{col 54}{space 4} 720.7214{col 67}{space 3} 858.9754
{txt}{space 10}9  {c |}{col 14}{res}{space 2} 847.3707{col 26}{space 2}  55.3281{col 37}{space 1}   15.32{col 46}{space 3}0.000{col 54}{space 4} 738.7531{col 67}{space 3} 955.9882
{txt}{space 9}10  {c |}{col 14}{res}{space 2} 904.8929{col 26}{space 2} 78.89908{col 37}{space 1}   11.47{col 46}{space 3}0.000{col 54}{space 4} 750.0019{col 67}{space 3} 1059.784
{txt}{space 9}11  {c |}{col 14}{res}{space 2} 962.4152{col 26}{space 2}  103.593{col 37}{space 1}    9.29{col 46}{space 3}0.000{col 54}{space 4} 759.0463{col 67}{space 3} 1165.784
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_39
. quietly tobit hours nwifeinc educ exper expersq age kidslt6 kidsge6, ll(0)
{txt}
{com}. eststo Tobit: margins, at(educ=(0(2)20)) predict(e(0,6000)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       753
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:E(hours|0<hours<6000), predict(e(0,6000))}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}2}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}4}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}6}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 10}8}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:6._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}10}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:7._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:8._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}14}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:9._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}16}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:10._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}18}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:11._at}:{space 1}{res:{txt:educ}{space 12}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 727.4644{col 26}{space 2} 76.74259{col 37}{space 1}    9.48{col 46}{space 3}0.000{col 54}{space 4} 577.0517{col 67}{space 3} 877.8772
{txt}{space 10}2  {c |}{col 14}{res}{space 2} 773.4964{col 26}{space 2} 71.05237{col 37}{space 1}   10.89{col 46}{space 3}0.000{col 54}{space 4} 634.2364{col 67}{space 3} 912.7565
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 823.5401{col 26}{space 2} 63.95927{col 37}{space 1}   12.88{col 46}{space 3}0.000{col 54}{space 4} 698.1822{col 67}{space 3} 948.8979
{txt}{space 10}4  {c |}{col 14}{res}{space 2} 877.8933{col 26}{space 2} 55.47809{col 37}{space 1}   15.82{col 46}{space 3}0.000{col 54}{space 4} 769.1582{col 67}{space 3} 986.6283
{txt}{space 10}5  {c |}{col 14}{res}{space 2} 936.8485{col 26}{space 2} 45.95104{col 37}{space 1}   20.39{col 46}{space 3}0.000{col 54}{space 4} 846.7861{col 67}{space 3} 1026.911
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 1000.685{col 26}{space 2} 36.67591{col 37}{space 1}   27.28{col 46}{space 3}0.000{col 54}{space 4} 928.8013{col 67}{space 3} 1072.568
{txt}{space 10}7  {c |}{col 14}{res}{space 2} 1069.659{col 26}{space 2} 31.51807{col 37}{space 1}   33.94{col 46}{space 3}0.000{col 54}{space 4} 1007.885{col 67}{space 3} 1131.433
{txt}{space 10}8  {c |}{col 14}{res}{space 2} 1143.997{col 26}{space 2} 36.60999{col 37}{space 1}   31.25{col 46}{space 3}0.000{col 54}{space 4} 1072.242{col 67}{space 3} 1215.751
{txt}{space 10}9  {c |}{col 14}{res}{space 2} 1223.883{col 26}{space 2} 52.37388{col 37}{space 1}   23.37{col 46}{space 3}0.000{col 54}{space 4} 1121.232{col 67}{space 3} 1326.534
{txt}{space 9}10  {c |}{col 14}{res}{space 2} 1309.452{col 26}{space 2} 75.03347{col 37}{space 1}   17.45{col 46}{space 3}0.000{col 54}{space 4}  1162.39{col 67}{space 3} 1456.515
{txt}{space 9}11  {c |}{col 14}{res}{space 2} 1400.783{col 26}{space 2} 102.4283{col 37}{space 1}   13.68{col 46}{space 3}0.000{col 54}{space 4} 1200.027{col 67}{space 3} 1601.539
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_40
. coefplot (OLS, ciopts(recast(rline) lpattern(solid))) ///
> (Tobit, ciopts(recast(rline) lpattern(dash))), at recast(line)
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/week8_tobitols.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/week8_tobitols.png written in PNG format)

{com}. //_41
. cd "/Users/Sam/Desktop/Econ 645/Data/Mitchell"
{res}/Users/Sam/Desktop/Econ 645/Data/Mitchell
{txt}
{com}. //_42
. use wws2, clear
{txt}(Working Women Survey w/fixes)

{com}. tabulate married, summarize(wage)

            {txt}{c |}       Summary of hourly wage
    married {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          0 {c |}  {res} 8.0920006    6.354849         804
  {txt}        1 {c |}  {res} 7.6319496   5.5017864       1,440
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 7.7967807   5.8245895       2,244
{txt}
{com}. //_43
. bysort married: summarize wage

{txt}{hline}
-> married = 0

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}        804    8.092001    6.354849          0   40.19808

{txt}{hline}
-> married = 1

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}      1,440     7.63195    5.501786   1.004952   40.74659

{txt}
{com}. //_44
. correlate wage age if married == 0
{txt}(obs=804)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.0185   1.0000

{txt}
{com}. correlate wage age if married == 1
{txt}(obs=1,440)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}   0.0049   1.0000

{txt}
{com}. //_45
. bysort married: correlate wage age

{txt}{hline}
-> married = 0
(obs=804)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.0185   1.0000


{txt}{hline}
-> married = 1
(obs=1,440)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}   0.0049   1.0000


{txt}
{com}. //_46
. bysort race: correlate wage age

{txt}{hline}
-> race = 1
(obs=1,637)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}   0.0017   1.0000


{txt}{hline}
-> race = 2
(obs=581)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.0331   1.0000


{txt}{hline}
-> race = 3
(obs=26)

             {c |}     wage      age
{hline 13}{c +}{hline 18}
        wage {c |}{res}   1.0000
         {txt}age {c |}{res}  -0.2194   1.0000


{txt}
{com}. //_47
. use tv1, clear
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c BRC}

{com}. //_48
. bysort kidid: egen avgtv = mean(tv)
{txt}
{com}. sort kidid
{txt}
{com}. list kidid tv avgtv, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 7}{c TRC}
     {c |} {res}kidid   tv   avgtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  1. {c |} {res}    1    1       2 {txt}{c |}
  2. {c |} {res}    1    3       2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  3. {c |} {res}    2    8       8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  4. {c |} {res}    3    2     3.5 {txt}{c |}
  5. {c |} {res}    3    5     3.5 {txt}{c |}
  6. {c |} {res}    3    1     3.5 {txt}{c |}
  7. {c |} {res}    3    6     3.5 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 7}{c RT}
  8. {c |} {res}    4    7       4 {txt}{c |}
  9. {c |} {res}    4    1       4 {txt}{c |}
 10. {c |} {res}    4    4       4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 7}{c BRC}

{com}. //_49
. bysort kidid: egen sdtv = sd(tv)
{txt}(1 missing value generated)

{com}. //_50
. generate ztv = (tv-avgtv)/sdtv
{txt}(1 missing value generated)

{com}. //_51
. list 
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   avgtv        sdtv          ztv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       2   1.4142136   -.70710678 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       2   1.4142136    .70710678 {txt}{c |}
  3. {c |} {res}    2   16jan2002        1   58    8     1       8           .            . {txt}{c |}
  4. {c |} {res}    3   18jan2002        0   60    2     0     3.5   2.3804761   -.63012604 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1     3.5   2.3804761    .63012604 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c RT}
  6. {c |} {res}    3   21jan2002        0   66    1     1     3.5   2.3804761   -1.0502101 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0     3.5   2.3804761    1.0502101 {txt}{c |}
  8. {c |} {res}    4   10jan2002        1   62    7     0       4           3            1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       4           3           -1 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       4           3            0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 11}{c -}{hline 12}{c BRC}

{com}. //_52
. bysort kidid: egen vac_total = total(vac)
{txt}
{com}. bysort kidid: egen vac_sd = sd(vac)
{txt}(1 missing value generated)

{com}. bysort kidid: egen vac_min = min(vac)
{txt}
{com}. bysort kidid: egen vac_max = max(vac)
{txt}
{com}. list kidid vac*, sepby(kidid) abb(10)
{txt}
     {c TLC}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c TRC}
     {c |} {res}kidid   vac   vac_total      vac_sd   vac_min   vac_max {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  1. {c |} {res}    1     1           2           0         1         1 {txt}{c |}
  2. {c |} {res}    1     1           2           0         1         1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  3. {c |} {res}    2     1           1           .         1         1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  4. {c |} {res}    3     0           2   .57735027         0         1 {txt}{c |}
  5. {c |} {res}    3     1           2   .57735027         0         1 {txt}{c |}
  6. {c |} {res}    3     1           2   .57735027         0         1 {txt}{c |}
  7. {c |} {res}    3     0           2   .57735027         0         1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c RT}
  8. {c |} {res}    4     0           0           0         0         0 {txt}{c |}
  9. {c |} {res}    4     0           0           0         0         0 {txt}{c |}
 10. {c |} {res}    4     0           0           0         0         0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 5}{c -}{hline 11}{c -}{hline 11}{c -}{hline 9}{c -}{hline 9}{c BRC}

{com}. //_53
. generate tvlo = (tv < 4) if !missing(tv)
{txt}
{com}. //_54
. bysort kidid: egen tvlocnt = count(tvlo)
{txt}
{com}. bysort kidid: egen tvlototal = total(tvlo)
{txt}
{com}. bysort kidid: egen tvlosum = sum(tvlo)
{txt}
{com}. bysort kidid: gen tvlosum2 = sum(tvlo)
{txt}
{com}. bysort kidid: egen tvlosame = sd(tvlo)
{txt}(1 missing value generated)

{com}. bysort kidid: egen tvloall = min(tvlo)
{txt}
{com}. bysort kidid: egen tvloever = max(tvlo)
{txt}
{com}. list kidid tv tvlo*, sepby(kidid) abb(20)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tvlo   tvlocnt   tvlototal   tvlosum   tvlosum2    tvlosame   tvloall   tvloever {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1      1         2           2         2          1           0         1          1 {txt}{c |}
  2. {c |} {res}    1    3      1         2           2         2          2           0         1          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8      0         1           0         0          0           .         0          0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2      1         4           2         2          1   .57735027         0          1 {txt}{c |}
  5. {c |} {res}    3    5      0         4           2         2          1   .57735027         0          1 {txt}{c |}
  6. {c |} {res}    3    1      1         4           2         2          2   .57735027         0          1 {txt}{c |}
  7. {c |} {res}    3    6      0         4           2         2          2   .57735027         0          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7      0         3           1         1          0   .57735027         0          1 {txt}{c |}
  9. {c |} {res}    4    1      1         3           1         1          1   .57735027         0          1 {txt}{c |}
 10. {c |} {res}    4    4      0         3           1         1          1   .57735027         0          1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c -}{hline 11}{c -}{hline 9}{c -}{hline 10}{c BRC}

{com}. //_55
. help egen
{txt}
{com}. //_56
. use tv1, clear
{txt}
{com}. //_57
. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c BRC}

{com}. //_58
. display tv[1]
{res}1
{txt}
{com}. //_59
. display "kid: " kidid[1] ", Date: " dt[1] ", Sex: " female[1] ", TV Hours: " tv[1]
{res}kid: 1, Date: 15347, Sex: 1, TV Hours: 1
{txt}
{com}. //_60
. display tv[2]
{res}3
{txt}
{com}. //_61
. display tv[2]-tv[1]
{res}2
{txt}
{com}. //_62
. help system variables
{txt}
{com}. //_63
. use tv1, clear
{txt}
{com}. //_64
. bysort kidid: gen tv_1ob = tv[1]
{txt}
{com}. list kidid tv tv_1ob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}kidid   tv   tv_1ob {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res}    1    1        1 {txt}{c |}
  2. {c |} {res}    1    3        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  3. {c |} {res}    2    8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  4. {c |} {res}    3    2        2 {txt}{c |}
  5. {c |} {res}    3    5        2 {txt}{c |}
  6. {c |} {res}    3    1        2 {txt}{c |}
  7. {c |} {res}    3    6        2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  8. {c |} {res}    4    7        7 {txt}{c |}
  9. {c |} {res}    4    1        7 {txt}{c |}
 10. {c |} {res}    4    4        7 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_65
. bysort kidid: gen tv_lastob = tv[_N]
{txt}
{com}. list kidid tv tv_lastob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_las~b {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          3 {txt}{c |}
  2. {c |} {res}    1    3          3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          6 {txt}{c |}
  5. {c |} {res}    3    5          6 {txt}{c |}
  6. {c |} {res}    3    1          6 {txt}{c |}
  7. {c |} {res}    3    6          6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          4 {txt}{c |}
  9. {c |} {res}    4    1          4 {txt}{c |}
 10. {c |} {res}    4    4          4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_66
. bysort kidid: gen tv_2tolastob = tv[_N-1]
{txt}(1 missing value generated)

{com}. list kidid tv tv_2tolastob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_2to~b {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          1 {txt}{c |}
  2. {c |} {res}    1    3          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          1 {txt}{c |}
  5. {c |} {res}    3    5          1 {txt}{c |}
  6. {c |} {res}    3    1          1 {txt}{c |}
  7. {c |} {res}    3    6          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          1 {txt}{c |}
  9. {c |} {res}    4    1          1 {txt}{c |}
 10. {c |} {res}    4    4          1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_67
. bysort kidid: gen tv_lagob = tv[_n-1]
{txt}(4 missing values generated)

{com}. list kidid tv tv_lagob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_lagob {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          . {txt}{c |}
  2. {c |} {res}    1    3          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          . {txt}{c |}
  5. {c |} {res}    3    5          2 {txt}{c |}
  6. {c |} {res}    3    1          5 {txt}{c |}
  7. {c |} {res}    3    6          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          . {txt}{c |}
  9. {c |} {res}    4    1          7 {txt}{c |}
 10. {c |} {res}    4    4          1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_68
. bysort kidid: gen tv_leadob = tv[_n+1]
{txt}(4 missing values generated)

{com}. list kidid tv tv_leadob, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_lea~b {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          3 {txt}{c |}
  2. {c |} {res}    1    3          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          5 {txt}{c |}
  5. {c |} {res}    3    5          1 {txt}{c |}
  6. {c |} {res}    3    1          6 {txt}{c |}
  7. {c |} {res}    3    6          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          1 {txt}{c |}
  9. {c |} {res}    4    1          4 {txt}{c |}
 10. {c |} {res}    4    4          . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c BRC}

{com}. //_69
. use tv1, clear
{txt}
{com}. //_70
. bysort kidid (dt): gen tv_1ob1 = tv[1]
{txt}
{com}. bysort kidid dt: gen tv_1ob2 = tv[1]
{txt}
{com}. //_71
. list kidid tv tv_1ob*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c TRC}
     {c |} {res}kidid   tv   tv_1ob1   tv_1ob2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  1. {c |} {res}    1    1         1         1 {txt}{c |}
  2. {c |} {res}    1    3         1         3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  3. {c |} {res}    2    8         8         8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  4. {c |} {res}    3    2         2         2 {txt}{c |}
  5. {c |} {res}    3    5         2         5 {txt}{c |}
  6. {c |} {res}    3    1         2         1 {txt}{c |}
  7. {c |} {res}    3    6         2         6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c RT}
  8. {c |} {res}    4    7         7         7 {txt}{c |}
  9. {c |} {res}    4    1         7         1 {txt}{c |}
 10. {c |} {res}    4    4         7         4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 9}{c -}{hline 9}{c BRC}

{com}. //_72
. bysort kidid (dt): gen tv_lastob1 = tv[_N]
{txt}
{com}. bysort kidid dt: gen tv_lastob2 = tv[_N]
{txt}
{com}. //_73
. list kidid tv tv_lastob*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_las~1   tv_las~2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          3          1 {txt}{c |}
  2. {c |} {res}    1    3          3          3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          8          8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          6          2 {txt}{c |}
  5. {c |} {res}    3    5          6          5 {txt}{c |}
  6. {c |} {res}    3    1          6          1 {txt}{c |}
  7. {c |} {res}    3    6          6          6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          4          7 {txt}{c |}
  9. {c |} {res}    4    1          4          1 {txt}{c |}
 10. {c |} {res}    4    4          4          4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_74
. bysort kidid (dt): gen tv_lagob1 = tv[_n-1]
{txt}(4 missing values generated)

{com}. bysort kidid dt: gen tv_lagob2 = tv[_n-1]
{txt}(10 missing values generated)

{com}. //_75
. list kidid tv tv_lagob*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}kidid   tv   tv_lag~1   tv_lag~2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}    1    1          .          . {txt}{c |}
  2. {c |} {res}    1    3          1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}    2    8          .          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  4. {c |} {res}    3    2          .          . {txt}{c |}
  5. {c |} {res}    3    5          2          . {txt}{c |}
  6. {c |} {res}    3    1          5          . {txt}{c |}
  7. {c |} {res}    3    6          1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c RT}
  8. {c |} {res}    4    7          .          . {txt}{c |}
  9. {c |} {res}    4    1          7          . {txt}{c |}
 10. {c |} {res}    4    4          1          . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_76
. use tv1, clear
{txt}
{com}. //_77
. bysort kidid (dt): generate tvdfp = tv - tv[_n-1]
{txt}(4 missing values generated)

{com}. //_78
. bysort kidid (dt): generate tvdfs = tv - tv[_n+1]
{txt}(4 missing values generated)

{com}. //_79
. bysort kidid (dt): generate tvdff = tv - tv[1]
{txt}
{com}. //_80
. bysort kidid (dt): generate tvdfl = tv - tv[_N]
{txt}
{com}. //_81
. bysort kidid (dt): generate tv3avg = (tv[_n-1] + tv[_n] + tv[_n+1])/3
{txt}(7 missing values generated)

{com}. //_82
. list kidid dt tvd* tv3avg
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c TRC}
     {c |} {res}kidid          dt   tvdfp   tvdfs   tvdff   tvdfl      tv3avg {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c RT}
  1. {c |} {res}    1   07jan2002       .      -2       0      -2           . {txt}{c |}
  2. {c |} {res}    1   08jan2002       2       .       2       0           . {txt}{c |}
  3. {c |} {res}    2   16jan2002       .       .       0       0           . {txt}{c |}
  4. {c |} {res}    3   18jan2002       .      -3       0      -4           . {txt}{c |}
  5. {c |} {res}    3   19jan2002       3       4       3      -1   2.6666667 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c RT}
  6. {c |} {res}    3   21jan2002      -4      -5      -1      -5           4 {txt}{c |}
  7. {c |} {res}    3   22jan2002       5       .       4       0           . {txt}{c |}
  8. {c |} {res}    4   10jan2002       .       6       0       3           . {txt}{c |}
  9. {c |} {res}    4   11jan2002      -6      -3      -6      -3           4 {txt}{c |}
 10. {c |} {res}    4   13jan2002       3       .      -3       0           . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 7}{c -}{hline 11}{c BRC}

{com}. //_83
. import excel using "cpi_1993_2023.xlsx", cellrange(A12:P42) firstrow clear
{res}{txt}
{com}. keep Year Annual
{txt}
{com}. //_84
. gen rebase93 = Annual/Annual[1]*100
{txt}
{com}. //_85
. gen rebase22 = Annual/Annual[_N]*100
{txt}
{com}. //_86
. gen rebase12 = Annual/Annual[_N-10]*100
{txt}
{com}. list
{txt}
     {c TLC}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c TRC}
     {c |} {res}Year    Annual    rebase93    rebase22    rebase12 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  1. {c |} {res}1993     144.5         100   49.375545   62.937185 {txt}{c |}
  2. {c |} {res}1994     148.2   102.56055   50.639832   64.548725 {txt}{c |}
  3. {c |} {res}1995     152.4   105.46713   52.074969   66.378041 {txt}{c |}
  4. {c |} {res}1996     156.9   108.58131   53.612616   68.338023 {txt}{c |}
  5. {c |} {res}1997     160.5   111.07266   54.842733   69.906008 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
  6. {c |} {res}1998       163   112.80277   55.696981   70.994887 {txt}{c |}
  7. {c |} {res}1999     166.6   115.29412   56.927098   72.562872 {txt}{c |}
  8. {c |} {res}2000     172.2   119.16955   58.840614    75.00196 {txt}{c |}
  9. {c |} {res}2001     177.1   122.56055   60.514941   77.136162 {txt}{c |}
 10. {c |} {res}2002     179.9   124.49827   61.471699   78.355706 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 11. {c |} {res}2003       184   127.33564   62.872666   80.141467 {txt}{c |}
 12. {c |} {res}2004     188.9   130.72664   64.546992   82.275669 {txt}{c |}
 13. {c |} {res}2005     195.3   135.15571   66.733868   85.063199 {txt}{c |}
 14. {c |} {res}2006     201.6   139.51557   68.886573   87.807173 {txt}{c |}
 15. {c |} {res}2007   207.342   143.48927    70.84861   90.308109 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 16. {c |} {res}2008   215.303   148.99862   73.568878   93.775534 {txt}{c |}
 17. {c |} {res}2009   214.537   148.46851   73.307136   93.441902 {txt}{c |}
 18. {c |} {res}2010   218.056   150.90381   74.509576   94.974607 {txt}{c |}
 19. {c |} {res}2011   224.939   155.66713   76.861492   97.972508 {txt}{c |}
 20. {c |} {res}2012   229.594   158.88858   78.452102         100 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 21. {c |} {res}2013   232.957   161.21592   79.601237   101.46476 {txt}{c |}
 22. {c |} {res}2014   236.736   163.83114   80.892518   103.11071 {txt}{c |}
 23. {c |} {res}2015   237.017   164.02561   80.988536    103.2331 {txt}{c |}
 24. {c |} {res}2016   240.007   166.09481   82.010217    104.5354 {txt}{c |}
 25. {c |} {res}2017    245.12   169.63322   83.757325   106.76237 {txt}{c |}
     {c LT}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c RT}
 26. {c |} {res}2018   251.107   173.77647   85.803079   109.37002 {txt}{c |}
 27. {c |} {res}2019   255.657   176.92526    87.35781   111.35178 {txt}{c |}
 28. {c |} {res}2020   258.811   179.10796    88.43553   112.72551 {txt}{c |}
 29. {c |} {res}2021    270.97   187.52249   92.590251   118.02138 {txt}{c |}
 30. {c |} {res}2022   292.655   202.52941         100   127.46631 {txt}{c |}
     {c BLC}{hline 6}{c -}{hline 9}{c -}{hline 11}{c -}{hline 11}{c -}{hline 11}{c BRC}

{com}. //_87
. graph twoway line Annual Year || line rebase93 Year || ///
> line rebase22 Year, yline(100) ///
> legend(order(1 "100=1982" 2 "100=1993" 3 "100=2022"))
{res}{txt}
{com}. graph export "/Users/Sam/Desktop/Econ 645/Stata/bls.png", replace
{txt}(file /Users/Sam/Desktop/Econ 645/Stata/bls.png written in PNG format)

{com}. //_88
. use tv1, clear
{txt}
{com}. //_89
. generate tvrunsum = sum(tv)
{txt}
{com}. //_90
. bysort kidid (dt): generate bytvrunsum=sum(tv)
{txt}
{com}. //_91
. bysort kidid (dt): egen bytvsum=total(tv)
{txt}
{com}. //_92
. egen tvsum = total(tv)
{txt}
{com}. //_93
. bysort kidid (dt): generate bytvrunavg=sum(tv)/_n
{txt}
{com}. //_94
. bysort kidid (dt): egen bytvavg = mean(tv)
{txt}
{com}. //_95
. list kidid tv tv* by*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c TRC}
     {c |} {res}kidid   tv   tv   tvrunsum   tvsum   bytvru~m   bytvsum   bytvrun~g   bytvavg {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  1. {c |} {res}    1    1    1          1      38          1         4           1         2 {txt}{c |}
  2. {c |} {res}    1    3    3          4      38          4         4           2         2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  3. {c |} {res}    2    8    8         12      38          8         8           8         8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  4. {c |} {res}    3    2    2         14      38          2        14           2       3.5 {txt}{c |}
  5. {c |} {res}    3    5    5         19      38          7        14         3.5       3.5 {txt}{c |}
  6. {c |} {res}    3    1    1         20      38          8        14   2.6666667       3.5 {txt}{c |}
  7. {c |} {res}    3    6    6         26      38         14        14         3.5       3.5 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c RT}
  8. {c |} {res}    4    7    7         33      38          7        12           7         4 {txt}{c |}
  9. {c |} {res}    4    1    1         34      38          8        12           4         4 {txt}{c |}
 10. {c |} {res}    4    4    4         38      38         12        12           4         4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 10}{c -}{hline 9}{c -}{hline 11}{c -}{hline 9}{c BRC}

{com}. //_96
. use tv1, clear
{txt}
{com}. //_97
. bysort kidid (dt): generate idcount=_N
{txt}
{com}. //_98
. bysort kidid (dt): egen idcount_nomiss = count(tv)
{txt}
{com}. //_99
. bysort kidid (dt): gen idruncount = _n
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   idcount   idcoun~s   idrunc~t {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1         2          2          1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1         2          2          2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1         1          1          1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0         4          4          1 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1         4          4          2 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1         4          4          3 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0         4          4          4 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0         3          3          1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0         3          3          2 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0         3          3          3 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. //_100
. use tv1, clear
{txt}
{com}. //_101
. bysort kidid (dt): generate singleob = (_N==1)
{txt}
{com}. //_102
. bysort kidid (dt): generate firstob = (_n==1)
{txt}
{com}. //_103
. bysort kidid (dt): generate lastob = (_n==_N)
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   singleob   firstob   lastob {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1          0         1        0 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1          0         0        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1          1         1        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0          0         1        0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1          0         0        0 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1          0         0        0 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0          0         0        1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0          0         1        0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0          0         0        0 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0          0         0        1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 9}{c -}{hline 8}{c BRC}

{com}. //_104
. use tv1, clear
{txt}
{com}. //_105
. bysort kidid (dt): generate vacstart=(vac==1) & (vac[_n-1]==0)
{txt}
{com}. bysort kidid (dt): generate vacend=(vac==1) & (vac[_n+1]==0)
{txt}
{com}. list kidid dt vac*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   vac   vacstart   vacend {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002     1          0        0 {txt}{c |}
  2. {c |} {res}    1   08jan2002     1          0        0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002     1          0        0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002     0          0        0 {txt}{c |}
  5. {c |} {res}    3   19jan2002     1          1        0 {txt}{c |}
  6. {c |} {res}    3   21jan2002     1          0        1 {txt}{c |}
  7. {c |} {res}    3   22jan2002     0          0        0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002     0          0        0 {txt}{c |}
  9. {c |} {res}    4   11jan2002     0          0        0 {txt}{c |}
 10. {c |} {res}    4   13jan2002     0          0        0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 5}{c -}{hline 10}{c -}{hline 8}{c BRC}

{com}. //_106
. use tv2, clear
{txt}
{com}. sort kidid dt
{txt}
{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0    .    .     . {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    .     1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    .     . {txt}{c |}
 10. {c |} {res}    4   13jan2002        1    .    4     0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c BRC}

{com}. //_107
. generate tvimp1 = tv
{txt}(3 missing values generated)

{com}. bysort kidid (dt): replace tvimp1 = tv[_n-1] if missing(tv)
{txt}(2 real changes made)

{com}. //_108
. list kidid dt tv tvimp1, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   tv   tvimp1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002    1        1 {txt}{c |}
  2. {c |} {res}    1   08jan2002    3        3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002    8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002    2        2 {txt}{c |}
  5. {c |} {res}    3   19jan2002    .        2 {txt}{c |}
  6. {c |} {res}    3   21jan2002    .        . {txt}{c |}
  7. {c |} {res}    3   22jan2002    6        6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002    7        7 {txt}{c |}
  9. {c |} {res}    4   11jan2002    .        7 {txt}{c |}
 10. {c |} {res}    4   13jan2002    4        4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_109
. generate tvimp2 = tvimp1
{txt}(1 missing value generated)

{com}. bysort kidid (dt): replace tvimp2 = tvimp2[_n-1] if missing(tvimp2)
{txt}(1 real change made)

{com}. list kidid tv tvimp*, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}kidid   tv   tvimp1   tvimp2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  1. {c |} {res}    1    1        1        1 {txt}{c |}
  2. {c |} {res}    1    3        3        3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  3. {c |} {res}    2    8        8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  4. {c |} {res}    3    2        2        2 {txt}{c |}
  5. {c |} {res}    3    .        2        2 {txt}{c |}
  6. {c |} {res}    3    .        .        2 {txt}{c |}
  7. {c |} {res}    3    6        6        6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c RT}
  8. {c |} {res}    4    7        7        7 {txt}{c |}
  9. {c |} {res}    4    .        7        7 {txt}{c |}
 10. {c |} {res}    4    4        4        4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 8}{c BRC}

{com}. //_110
. generate tvimp3=tv
{txt}(3 missing values generated)

{com}. //_111
. bysort kidid (dt): replace tvimp3 = (tv[_n-1]+tv[_n+1])/2 if missing(tv)
{txt}(1 real change made)

{com}. list kidid tv tvimp3, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c TRC}
     {c |} {res}kidid   tv   tvimp3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  1. {c |} {res}    1    1        1 {txt}{c |}
  2. {c |} {res}    1    3        3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  3. {c |} {res}    2    8        8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  4. {c |} {res}    3    2        2 {txt}{c |}
  5. {c |} {res}    3    .        . {txt}{c |}
  6. {c |} {res}    3    .        . {txt}{c |}
  7. {c |} {res}    3    6        6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c RT}
  8. {c |} {res}    4    7        7 {txt}{c |}
  9. {c |} {res}    4    .      5.5 {txt}{c |}
 10. {c |} {res}    4    4        4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c BRC}

{com}. //_112
. bysort kidid (dt): replace tvimp3 = ((tvimp3[4]-tvimp3[1])/3)+tvimp3[_n-1] if missing(tvimp3) & kidid==3
{txt}(2 real changes made)

{com}. list kidid tv tvimp3, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 11}{c TRC}
     {c |} {res}kidid   tv      tvimp3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  1. {c |} {res}    1    1           1 {txt}{c |}
  2. {c |} {res}    1    3           3 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  3. {c |} {res}    2    8           8 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  4. {c |} {res}    3    2           2 {txt}{c |}
  5. {c |} {res}    3    .   3.3333333 {txt}{c |}
  6. {c |} {res}    3    .   4.6666667 {txt}{c |}
  7. {c |} {res}    3    6           6 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 4}{c -}{hline 11}{c RT}
  8. {c |} {res}    4    7           7 {txt}{c |}
  9. {c |} {res}    4    .         5.5 {txt}{c |}
 10. {c |} {res}    4    4           4 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 11}{c BRC}

{com}. //_113
. use tv1, clear
{txt}
{com}. bysort kidid (dt): generate tvchange = tv[_n]-tv[_n-1]
{txt}(4 missing values generated)

{com}. bysort kidid (dt): generate tvchangerate = ((tv[_n]-tv[_n-1])/tv[_n-1])
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   tvchange   tvchange~e {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1          .            . {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1          2            2 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1          .            . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0          .            . {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1          3          1.5 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1         -4          -.8 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0          5            5 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0          .            . {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0         -6   -.85714286 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0          3            3 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c BRC}

{com}. //_114
. gen tvchangeid=(tvchange <= -2) if !missing(tvchange)
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   tvchange   tvchange~e   tvchan~d {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1          .            .          . {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1          2            2          0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1          .            .          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0          .            .          . {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1          3          1.5          0 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1         -4          -.8          1 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0          5            5          0 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0          .            .          . {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0         -6   -.85714286          1 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0          3            3          0 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 10}{c -}{hline 12}{c -}{hline 10}{c BRC}

{com}. //_115
. use tv1, clear
{txt}
{com}. bysort kidid (dt): generate ltv = tv[_n-1]
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   ltv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1     . {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1     . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0     . {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1     2 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1     5 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0     1 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0     . {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0     7 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0     1 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 5}{c BRC}

{com}. //_116
. use tv1, clear
{txt}
{com}. sort kidid dt
{txt}
{com}. //_117
. tsset kidid dt, daily delta(1)
{res}{txt}{col 8}panel variable:  {res}kidid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dt, 07jan2002 to 22jan2002, but with gaps
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. //_118
. generate lagtv = L.tv
{txt}(6 missing values generated)

{com}. //_119
. generate leadtv = F.tv
{txt}(6 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   lagtv   leadtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       .        3 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1       .        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0       .        5 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1       2        . {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1       .        6 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0       .        1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       7        . {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       .        . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c BRC}

{com}. //_120
. use tv1, clear
{txt}
{com}. sort kidid dt
{txt}
{com}. //_121
. xtset kidid dt, daily delta(1)
{res}{txt}{col 8}panel variable:  {res}kidid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}dt, 07jan2002 to 22jan2002, but with gaps
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. //_122
. generate lagtv = l.tv
{txt}(6 missing values generated)

{com}. //_123
. generate leadtv = f.tv
{txt}(6 missing values generated)

{com}. //_124
. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   lagtv   leadtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       .        3 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1       .        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0       .        5 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1       2        . {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1       .        6 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0       1        . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0       .        1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       7        . {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       .        . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c BRC}

{com}. //_125
. bysort kidid (dt): gen bylagtv=tv[_n-1]
{txt}(4 missing values generated)

{com}. bysort kidid (dt): gen byleadtv=tv[_n+1]
{txt}(4 missing values generated)

{com}. list, sepby(kidid)
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c TRC}
     {c |} {res}kidid          dt   female   wt   tv   vac   lagtv   leadtv   bylagtv   byleadtv {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  1. {c |} {res}    1   07jan2002        1   53    1     1       .        3         .          3 {txt}{c |}
  2. {c |} {res}    1   08jan2002        1   55    3     1       1        .         1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  3. {c |} {res}    2   16jan2002        1   58    8     1       .        .         .          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  4. {c |} {res}    3   18jan2002        0   60    2     0       .        5         .          5 {txt}{c |}
  5. {c |} {res}    3   19jan2002        0   63    5     1       2        .         2          1 {txt}{c |}
  6. {c |} {res}    3   21jan2002        0   66    1     1       .        6         5          6 {txt}{c |}
  7. {c |} {res}    3   22jan2002        0   64    6     0       1        .         1          . {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c RT}
  8. {c |} {res}    4   10jan2002        1   62    7     0       .        1         .          1 {txt}{c |}
  9. {c |} {res}    4   11jan2002        1   58    1     0       7        .         7          4 {txt}{c |}
 10. {c |} {res}    4   13jan2002        1   55    4     0       .        .         1          . {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 8}{c -}{hline 4}{c -}{hline 4}{c -}{hline 5}{c -}{hline 7}{c -}{hline 8}{c -}{hline 9}{c -}{hline 10}{c BRC}

{com}. //_126
. use "/Users/Sam/Desktop/Econ 645/Data/CPS/jun23pub.dta",replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Sam/Desktop/Econ 645/Stata/week8_LDV1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Oct 2023, 16:50:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}